[{"rating": "5", "user": "-", "raw-text": "Pros: It's like an endless box of features! Using Jar2Alx converter, you can install a PLETHORA of software, including games, apps, IM, etc! Due to the standard headphone connection, I can hook this up into my car and use the AUX output to turn my car into a BIG speakerphone AND still use the microphone on the blackberry to talk! the music also works correctly. The touchpad is a nice upgrade over most blackberries, you wouldn't believe how apparently easy it is to take the trackbakk out of a blackberry (I've seen numerous floor models without their trackball, due to people abusing them)! You can even connect your blackberry to your PC and us it as a modem, which is pretty cool! You can also convert your videos using the blackberry software and put it on your phone! The QWERTY keyboard is actually quite nifty to have, and the battery life is a little bit above average.Cons: Sadly there's been times where the keypad or trackball wouldn't make their beeping noises (you can turn this feature on and off). The logo on the battery compartment isn't built as a tough (it's been about a month since I've had mine and only ONE part of the blackberry logo is still on there, and the imprints are still there).. the Internet is sometimes slow on this device, and some webpages don't display properly. for what it's worth, if you turn the wi-fi on, it seems to work faster, depending on connection. Youtube is also a bit flakey, but it does work. The only way to fully turn off this blackberry is to"}, {"rating": "5", "user": "-", "raw-text": "While I am a first time owner of a BlackBerry, I have played with my share of others and I must say, even for what apparently is a \"budget model\", I am not that impressed with this BlackBerry effort. (I am reviewing the at&t model.) PROS: > Sound quality is excellent as most BB users have become used to. > Nice appearance and sleeker than many other BB models. > TrackPad replaces the TrackBall and provides the ability for the user to adjust sensitivity settings. > Easy access to battery compartment without having to push hard against the phone to open. > Easy Bluetooth setup with flawless operation. > Battery life is not all that bad. I usually lose a couple of bars of a charge after a full day. CONS: > While the design is nice and sleek, the unit overall has a very \"cheap\" feel to say the least. Especially the Call/Menu/Back & End buttons. The screen cover is made of cheap, flexible plastic that appears to be more like plastic/paper. > The user interface seems to be very poorly thought out compared to past models. > With all the cheaper \"Smartphones\" and cheap phones overall with 3G technology, I don't understand why this new model has to run off archaic EDGE. > QWERTY keyboard response is \"hard\" and clicks very loudly compared to other models. > No camera flash. > Many user customizing settings that should be available... aren't. ie I have not been able to figure out how to just have the entire homepage show up from wake, instead of the useless shortcut menu. Overall, a very"}, {"rating": "5", "user": "-", "raw-text": "First up, if you are a power user you need to find a different BB. This is not the phone for you. For everyone else that wants a superior e-mail/messenger smartphone that just works, read on. So for starters this is the successor to the Curve 83XX series but it is no longer a middle of the road device but a more focused themed Blackberry in line with the rest of the collection. Much like the Storm and Flip are for specific audiences so is this device despite the fact it looks like the 8900. This phone is for the person who needs something smarter than a \"dumbphone\" yet not quite a smart device. While true a BB is a smart phone, it doesn't act like it. At the top of the phone there are media control features, a first for a BB. I must say they work very well and as advertised for easy access to the media player. Music sounds great and videos look pretty good though the screen is a bit small in resolution. Text and e-mail look great on the device, the internet and videos, not so much. It isn't bad, but definately not a selling point. What does sell the device is the superb e-mail and messaging features along with the great, yet somewhat click-y feeling keyboard. In a way it feels somewhat cheap but it functions and I had absolutely feeling I was going to break it and that goes for the rest of the rest of the device. It is deceptively lightweight and features a great rubber \"bumper\" for protection. So the Trackpad is an amazing step up from the trackball of past models and feels"}, {"rating": "5", "user": "Mpls", "raw-text": "Pros: Attractive Design, QWERTY Keypad ... Cons: Poor Battery Life, Poor OS My wife and I have had identical 8520s for 7 months now, and both of us have been very underwhelmed. The latest BB OS update crippled the audio on our phones. They now require sporadic battery pulls to get any output from our ringers or alarms. There is no fix available. Camera performance is poor and there is no flash. Wifi reception is sporadic at best. The Blackberry App store is infuriatingly glitchy and apps already installed are a real pain to update. This unit shines in call quality and voice reception. The speakerphone is better than average. Push email works great, and the qwerty keyboard is a breeze for email & sms. Overall, there are FAR better choices on your GSM carrier."}, {"rating": "5", "user": "-", "raw-text": "After having several Blackberries through out the yrs, when I changed providers, I was sure I wanted to go with another Blackberry, Boy...was I wrong! Pros: Already familiar with BB applications. Cons: Shuts off automatically when trying to use camera. Sound will shut off, have to reboot phone to get it back. Wont allow text to go through at times. No Flash with camera. GPS with Sprint doesnt work half the time. I dont know if its the Provider or the Phone, but I have spent more time with my battery out to reset the phone, then any other phone Ive owned. Provider: Sprint Region: KCMO Software Version: v5.0.1030"}, {"rating": "5", "user": "-", "raw-text": "Pros: Screen, Blackberry OS, TrackPad, Qwerty Keyboard.Cons: No LED Flash.This is a nice Blackberry that has everything any one woud like. You can edit documents, It has wifi, Blackberry APP World pre-instaled. Has a nice big screen. Has a myspace and face book app installed. 2 mega pixel camera that can take pictures and videos. Easy to text on. You can go to Starbucks, McDonalds, etc and use the wifi to use the internet for free."}, {"rating": "5", "user": "-", "raw-text": "With the BlackBerry Storm, RIM made a huge step towards the consumer market. With a touchscreen, newly designed multimedia player and a 3.2-megapixel camera, it was a step away from the straight-laced business philosophy that people were used to from the Canadian manufacturer.Now, RIM has introduced another more consumer-focused, lower cost device in the form of the 8520 Curve.Although this latest device doesn't feature a touchscreen, there is a newly designed touch sensitive navigation button, situated in the centre below the screen. This takes the place of the Pearl, one aspect of the BlackBerry we've become accustomed to.This optical trackpad is successful at re-inventing a way to navigate around the BlackBerry - allowing you to scroll smoothly through menus. Like the Pearl, you can press down on the trackpad to select an item. For those people who have been using a BlackBerry with a Pearl, it may take a little time to get used to the experience, but soon you'll find it's more responsive.On either side of this navigation feature, there's the usual BlackBerry key that pulls up a content-specific menu, depending on which app you're using, and a back key on the right hand side. On the outer edges, you'll find call answer and end buttons. All four of these keys are recessed, giving the Curve 8520 a super-sleek finish.However, this sleek, shiny finish does come with a foible. The outer casing attracts more fingerprints than any other BlackBerry, so you'll be wiping away smudges from dawn"}, {"rating": "5", "user": "-", "raw-text": "Positives-- 1. Love the track pad, easy to get used to, although this is my first BB 2. Camera works great considering no flash. 3. Like having wi-fi option, although my marginal bandwidth doesn't work much faster than edge. 4. Recharge battery nightly, but only because I have become a heavy user-- will probably browse less when the newness wears off. 5. Good construction for one of the low end Blackberries. 6. I'm sure my next phone will be 3G, but for now Edge works pretty well for my needs. 7. Love the ability to seamlessly pull up our corporate G-Mail calendar e-mail functions. 8. Lots of third party stuff out there software wise. Negatives- 1. Still getting used to small keyboard although it's easier to figure out than I would have thought. 2. Previous cheap Nokia had a flashlight which came in handy. If this had a flash I could get a software flashlight function. I find this to be a bigger problem than lack of flash on camera, per se. 3. Still haven't figured out how to send photos-- lost in the ether. 4. Opera Mini 4+ and native BB browser vary greatly in speed depending on site or ???-- will upgrade to Opera 5 shortly and see how that works. Use Opera on the desktop and like the products just fine. All in all I like this a lot. Can't say enough about the trackpad."}, {"rating": "5", "user": "-", "raw-text": "Pros: Decent phone for the price, WiFi, bluetooth, no trackball, feels solid, bright crisp and clear screen.I liked the trackball, don't get me wrong, but the lack of an actual ball is nice...Cons: International version. I'm not sure if all of them are, or just the one that I got, but mine is the international version, which for the phone itself doesn't really matter, but my charger is huge now because of it... thankfully I have my old blackberry charger that works for it. In order to use the charger in the US it requires a US socket adapter (included) but then it sticks out about 5 inches from the wall...I feel as though Newegg should put on there that this is the international version if that's really what it is, or maybe I should call customer service and see if I just happened to get one by \"mistake\"..."}, {"rating": "5", "user": "-", "raw-text": "Pros: This being my first Smartphone it is an easy phone to setup and use. The screen is very large and the colours are great. The Menu of this Blackberry Is customisable which is great if you want to hide certain things from view. In my opinion the TrackPad on Blackberrys are better than the TrackBalls as the TrackPad does not stick. The QWERTY keyboard is an excellent addition to this phone as it makes it easier to type TXT messages and browse the web.Cons: One of the only things I dont like about this Smartphone is that the Alt and Shift keys are opposite to a regular computer keyboard.I highly recommend this Blackberry for people new to Blackberrys. Easy to use an setup. Great KeyPad and TrackPad. Excellent Phone. ..."}, {"rating": "5", "user": "-", "raw-text": "the price of the phone is reasonable the look of it is also smart and funky. it will help you with the day 2 day life style. the curve has a good camera you can record or take pictures,it has mp3 and wi-fi. i think its the ideal smart phone."}, {"rating": "5", "user": "-", "raw-text": "I bought the phone as a present and it was difficult to set up at first because it was on pay as you go contract and we didn't realise that nothing worked until you paid for 30 days access to the email/internet or 6 months. We had purchased air time and registered it to the handset and thought it would be automatically set up but it required a text message. I phoned customer service and they were very helpful and now everything is set up. It would be easier on contract as this would be sorted out straight away."}, {"rating": "5", "user": "-", "raw-text": "Purchaced this in the sale and as far as features go the phone is great, as far as reliability goes its not so great.... the phone tends to lock up now and again while texting and you might be waiting 2-3 minutes for it to come back to life. Also the battery is not great either but then again i do have bluetooth and wi-fi activated constantly. the only other gripe really is internet speed is slow but i knew when buying that it was not 3G so maybe i cant complain too much. All in all a decent all round smartphone for the sale price money but far from a perfect phone.... must admit though i would buy another :-)"}, {"rating": "5", "user": "-", "raw-text": "It may look nice in the photo, but this headset underperforms even its low price. It sounds as if callers are talking to you from inside a tin can, only less clear. The wires to the ear buds are uneven in length, which is meant so you can share the sound with your BFF. If you re older than 12 however, this is a nuisance. The ear bud inserts slip out of the ears, partly due to being small and slick, partly because the cord is too short. Because of the price they re not worth returning, but I got less than what I paid for in these."}, {"rating": "5", "user": "-", "raw-text": "i've had the phone almost a week n im in love wit it, although it doesnt hve 3g it still seems very fast, this is my very first blackberry. im comin from a long line of phones n dnt wanna mention all of em but i can say this is the best phone i've had, i had a touch screen phone (lg vu) n this is 2me a total upgrade from tht piece of junk, lol, ok here's my pros n cons Pros: 1.media player is awesome 2.messaging memory 3.the FREE micro sd card lol 4.track pad is great 5.battery is acceptable 6.screen size bigger than my centro 7.looooooooooove the color(i got da wht one) 8.great available apps, 9.3.5mm head set jack is a superior convenience 10.charges quickly like another person said, 11. the browser is very gud 4 da size of da phone n edge wrks efficiently 4 it, 12.umm i can go on n on, jus get it n u'll luv it lol Cons: 1. although the battery is acceptable it could possibly b better but not real problem, it last all day or more 4me. 2. 2mp camera is old tech n is popular among a lot of cellies nw, blackberry shoulda gave it a 3mp+ but again, not a real problem, 3. cnt think of ne thing else really. overall its an xcellent device, i think ima stay getting blackberrys from now on n tmobile seems 2 ba great service thus far so we'll c. if ur lookin 4 a new pda u should def consider this one cuz it's a keeper!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Very nice UI, keyboard is very good to type on despite its small size. The new trackpad is very sensitive and you can adjust its sensitivity inside one of the manual itemsNewegg.ca's unlock price vs the non-contract price for the Canadian carriersPutting applications and ringtones into the blackberry are very simple. Lots of free apps and you don't have to go through BB's app store for applications.Very nice screen.Cons: The BB built in browser is a little bit dated but there are plenty of free browsers you can download and install.Some of the built in apps doesn't work within a BB data plan. Try to sync to google calendars via wifi without the BB data plan and this doesn't work at all. hopefully OS 5.0 will let me use some of these apps without subscribing to BIS."}, {"rating": "5", "user": "-", "raw-text": "As others have stated, this is a budget blackberry but when purchasing it I realized the only difference between this one and the 8900 is the screen resolution and gps... but other than that it's comparable and does the exact same thing as the upper level blackberries. Pros: -First thing is first, this optical trackball is amazing... took me literally 10 seconds to get used to it. It's smooth, sensitive, and responds just the way you want it to. -The phone itself is slim, a lot smaller than my pre and other blackberries I have used in the past. The rugged edges on the side places a firm grip on the phone so dropping it won't be as easy, and also there are multimedia functions on the top such as play, rewind, fast forward for media applications. -Streams videos such as youtube... and other miscellaneous sites ;], in good resolution as well. Since it's not like the 8900 the pictures seem a little pixelated but it's not a terrible picture. Think of it as playing a dvd on an hdtv using rca inputs if you want a general idea. -UMA is fantastic. Your calls go through your wireless network, as well as data. Reception is clear with UMA enabled, and websites load blistering quick. -Comes with a 1GB microsd card. -Just like the other blackberries, e-mails push in quick and efficiently. -128MB of program and internal storage left after installing my apps, say goodbye memory leaks. -Inexpensive, purchased it for fifty. Not saying where, but it starts with an R. Cons: -One thing I found annoying is that I"}, {"rating": "5", "user": "-", "raw-text": "So Far so good. Had the phone 2 weeks now, very nice upgrade from the pearl. Pros: screen size, resolution, WIFI, automatically connects to best signal...no track ball!!! cursor moves very easily and smoothly...External music player controls Cons: Not many, no flash and only a 1.2 pixel camera, battery seems to drain quicker than it should. Not many accessories available yet"}, {"rating": "5", "user": "-", "raw-text": "Pros: Navigation and selection via the center button is pretty convenient. Looking forward to another chance with it...Cons: Received opened item, was supposed to be new in box.Could not get WiFi to work with a DHCP IP address for internet access, even though it seemed to indicate an active connection with my router.Trying to get this to work with AT&T. Was able to make calls OK. Hoping the wifi radio was bad in this one. RMAd and new one hopefully on the way."}, {"rating": "5", "user": "TOP", "raw-text": "The features are good, but a little bulky to carry around. Keyboard layout is great. Much better than the Pearl, but not as good as the Torch.Very easy to set up e-mail, Blackberry desk top software seems a little slow."}, {"rating": "5", "user": "-", "raw-text": "The battery doesn t hold a charge for a full day. It is not the battery in the picture. I put it in my phone, and it charged quickly. It seems to work fine, but it does not hold a charge for a full day. I have to keep it on the charger at work to keep my phone active. Not worth the price - no matter how cheap."}, {"rating": "5", "user": "-", "raw-text": "This is only the second review? I'm sure more people than this have this phone. Anyway, I've sampled and have used the 8800, 8320 both sunset and titanium (I have T-Mobile), 8100 red blue and black, 8120 silver, and 8220 red and bladk(not counting other phones I've used). I had my eye on the 8900, but decided to save $20 plus tax and go for the 8520. Pros: Touchpad! No Rollerballs anymore! Sweet camera and video! Same great e-mail as always Tons more application memory Nice, loud speaker (No annoying \"what?!\" comments, like on my 8100.) Charges quickly and efficiently. Comes with 1GB card (which is good, because I lost mine) Cons: Not too many accesories are available for the 8520, currently. Not too many applications are ready for this phone yet. No Blackberry Pouch You can see that my cons are trivial. I still have a week to decide if I want to keep this or go to the 8900. For now, I'll keep what I have. You should get one, too."}, {"rating": "5", "user": "-", "raw-text": "Pros: Sleek design. VERY light weight. Love the touch pad.I have a Nokia N900 which is basically a workout weight in my pocket. However, the N900 is a small Linux computer, so for that I can't compare.Cons: Small screen compared to the N900. But still looks great.Small keys for typing but getting used to it (vs. N900)T-Mobile brand BB with T-mobile service. It works!"}, {"rating": "5", "user": "and", "raw-text": "Absolutely love the phone. I've had touch screens for a couple of years now and got fed up with them. I wanted a phone with a qwerty button keyboard and this is the perfect phone for me. I use it for facebook and hotmail and general browsing of the web. I think the WiFi is amazing. Very happy - not sure how to turn it off properly tho - my husband has the same issue with his. When you think you've turned it off it kind of goes onto sleep mode and then if u click a button, hello - it's back on again! My phone's always on tho, so I'm not too fussed!"}, {"rating": "5", "user": "-", "raw-text": "I was very impressed with how low the price was for this item that usually costs around $30 at the mall. I received it promptly in the mail and was able to easily snap it onto my new blackberry. Looks just like the picture. I am pleased with the service and will be returning to overstock.com for future purchases!"}, {"rating": "5", "user": "-", "raw-text": "I received this phone as a birthday gift, i think it is fantastic especially as it is so practical, checking emails or going on the Internet on the go.it is a small handy phone which is jam packed with great stuff.. i would recommend this to anyone who is thinking of getting a phone.Definitely worth the money.But i would recommend getting a screen protector and case as with any other phoneBrillliant :)"}, {"rating": "5", "user": "-", "raw-text": "I really like this phone, if you dont like the touch screens then this is the next best thing. Easy to use functions, many extra functions than a bog standard phone, battery life excellent, i charge mine about twice a week and im always playing on it !"}, {"rating": "5", "user": "-", "raw-text": "For the price you pay, this puchase is well worth it. The covers fit perfectly easy to switch out. The car charger works well (must slide the case away for it to plug in properly) but thats minor (especailly for the price paid!) Or course, overstock's delivery was awesome and ordering made easy...love them. Would highly recommend this purchase to someone on a budget!! ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Attractive Design, Brilliant Display, QWERTY Keypad I bought another Blackberry for one reason. It has an excellent address book function. I've had many other phones and this phone for someone who needs a quick and easy address book function is perfect."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great ProtectionCons: Difficult installationAt first I was a bit skeptical about putting an after market accessory on my brand new phone. But after realizing that a standard case doesn't usually protect the screen, I figured I needed to find something to fill that void. So a helpful sales associate pointed me in the right direction of the invisible shields by ZAGG. It turns out that you can get a thin protective film called an \"invisible shield\" to help protect against scuffs, scratches, and even dreaded fingerprints. They even offered to install it for me for a small additional price. Granted I denied the installation because I wanted to experiment for myself. However, I would HIGHLY recommend that you have a trained associate perform the installation for you. This is because it can be very tricky and somewhat frustrating executing a perfect application of the invisible shield. Bottom line, get one for all of your handheld devices and avoid any unsightly blemishes that can occur on account of human error."}, {"rating": "5", "user": "-", "raw-text": "Hot pink silicone case for my Blackberry came quickly to my door, courtesy of Overstock.com, which is a favorite shopping website because of the super prices and speedy service. Silicone provides a bit of grip so it's easy to hold onto the Blackberry as I have a tendency to drop cell phones. Fit is great, perfectly aligning with all openings, like camera shutter and power cord. No complaints; just compliments for another great Overstock product at a great price. ..."}, {"rating": "5", "user": "-", "raw-text": "the color was a little different than the picture showed but not really a big deal. totally cute and fits waaay better than the one i bought in the mall for like 3 times as much! love it!"}, {"rating": "5", "user": "-", "raw-text": "Phone was alright, pretty blue color. It's a T-Mobile phone that comes unlocked (has engravings and splash screen). Worked fine but wasnt for me. One cool thing I liked was this blackberry had a trackpad instead of the little trackball. Pic quality on camera left a little to be desired (no flash) and also the phone has no built-in GPS on it. I ended up returning it to get another model of blackberry. If you dont take alot of pics and mind not having GPS, this is a fairly nice phone. ..."}, {"rating": "5", "user": "-", "raw-text": "great phone - a replacement for my daughter after she had lost hers. Had a blackberry curve 8520 previously and wanted the same one as she loved it so much and Argos has best price as I was only looking to buy the handset."}, {"rating": "5", "user": "-", "raw-text": "This is the second time that I have had to take the phone back & on both occasions the staff were so helpful & the phone was changed for a new one.I have an Argos card which was the best thing I ever did for making purchases & the best bit is the customer service as stated.I make as many purchases as I can from Argos for this very reason keep up the good work."}, {"rating": "5", "user": "-", "raw-text": "Pros: has all the features I want, and moreCons: small keypad is hard to get used to,I got this phone as an upgrade on my contract because my old phone was horrible. I wanted something that could surf the web and more, and this phone is it! The trackpad is great, this is my first BlackBerry but I have heard the trackball isn't so great. There are tons of apps and other features, I know I've only scratched the surface of looking at/using them all. The keypad is small, and hard to get used to when dialing or texting, but wasn't a make or break deal for me."}, {"rating": "5", "user": "-", "raw-text": "Great phone for the price. This is the second BlackBerry 8520 I have owned. For the price you simply can't get a better phone. Battery life is above average and with Spotify and the new BlackBerry app it is the perfect all round phone."}, {"rating": "5", "user": "-", "raw-text": "Pros: The features and how easy they are to useCons: Have to get used to the small keypads.This is my first Blackberry and I am not disappointed. I originally got an iPhone and was very upset over how it worked/didn't work for me. Took it back the next day to Best Buy and the Sales Rep told me about this phone. I got a good deal. $29 for an added line to my ATT account. Have had it 2 days and can not complain yet. I was hoping to get a lighter color but my only complaint was they only had black, but I can deal with it. It is so easy to use and I just love it so much."}, {"rating": "5", "user": "-", "raw-text": "Pros: Attractive Design, Good Interface w/email, Great Battery Life, Great OS, QWERTY Keypad ... Cons: Small Buttons this is my second Blackberry. The track pad feature is great. Phone is good as advertised, but the buttons are small. Took me a few days to get used to."}, {"rating": "5", "user": "-", "raw-text": "Pros: Attractive Design, Brilliant Display, Good Interface w/email, Great Battery Life, QWERTY Keypad ... Cons: Small Buttons I finally, reluctantly, made the leap from a regular mobile to a smartphone. The motivation was the change in legislation, in the province of Ontario, which now requires drivers to use hands free while using wireless devices. It has earned the nickmane \"crackberry\" for a good reason... :) Email and BBMessenger are probably its best features. BBMessenger being the equivalent of texting... except it's free, and supposedly more secure, in that data bypasses your wireless provider and routed via Blackberry's own servers. Wireless connection to my motorala bluetooth enabled earpiece, model H500, is terrific and sound quality is quite good with the exception of very windy days."}, {"rating": "5", "user": "-", "raw-text": "Bought this phone for pre teen child, easy to use and if you register for blackberry package is very cost effective for text mad teenager. Need to get used to track pad."}, {"rating": "5", "user": "-", "raw-text": "I just got this phone last friday,its not even a week old and i am enjoying the features so far. Can't find accessories or even a holder so i can prtoect it from gettin scratched. Pros: wifi, lightweight, bluetooth, camera is good. Cons: i cant seem to get the phone to light up and alert me when there is a new incoming message. Also it doesnt alert me when i am in a wireless area."}, {"rating": "5", "user": "-", "raw-text": "Ordered these soft skin cases for my new Blackberry 8530 because of the multiple colors and value. I was not disappointed. Each case fit well and the bold colors are easy to spot deep in my bag."}, {"rating": "5", "user": "-", "raw-text": "I love this bundle. I bought it for my husband and he thought everything was great. What I love most was the price. If you were to buy everything separately it would cost a lot more. Not only did it work great it is also durable. He has had the bundle for six months now and they still work. I have to mention he breaks every everything, and knock on wood it is still working. I am also buying the same car charger for myself!"}, {"rating": "5", "user": "-", "raw-text": "had just bought a Curve and kept loosing it in the bottom of my purse. I bought these covers so I could find it in my purse. (use the pink) I wish I had bought the screen protector at the same time since I'm hard on phones. The cover just slips on. And the color is bright! I'll give the others away to friends. ..."}, {"rating": "5", "user": "-", "raw-text": "I didn't think I'd like this phone mostly because of the keypad but I love it. You can do everything you want and it's so easy to use. When you think how much the phone can do the battery life is good really. Great phone all round :)"}, {"rating": "5", "user": "-", "raw-text": "Am pleased with my purchased and it's my first blackberry phone unit apart from motorola... good phone for messaging and social network. Managed to download free apps. too...the only downside is the battery doesn't last longer..."}, {"rating": "5", "user": "-", "raw-text": "Very pleased with phone - easy to set up, plenty of features. Especially useful with my BT homehub and the UMA technology as the signal is boosted by the home hub. Never had a consistent signal on any network because of where we live so this is invaluable."}, {"rating": "5", "user": "Curse", "raw-text": "got this phone from a friend, and everything's working great. i works in high lightings like outdoors. trackpad responses well. apps are good and sound quality was batter compared to my previous nokia phone. the only problem that i have is the blootooth connection. it's not pairing to other devices like nokia, samsung & lg. but overall i like it a LOT!!!"}, {"rating": "5", "user": "-", "raw-text": "The screen on this blackberry has malfunctioned and has a defect. It has numerous odd multi-colored stripes from top to bottom on the face of the phone. I am returning the blackberry to a Best Buy location to be replaced with another unit. The other features appear to be working."}, {"rating": "5", "user": "-", "raw-text": "I bought two of these batteries for my blackberry curve 8330. Neither one of them will hold a charge over night. My phone is completely dead the next day and will not turn on. I turn my signal off, my gps off, and the phone. And it's still dead the next morning. I highly doubt these are original OEM blackberry batteries. I would not waste your money on one. ..."}, {"rating": "5", "user": "-", "raw-text": "I am very pleased with this product. I use to have the silicone black case and I prefer this one much more. It's sturdy and has a nice rubber texture for grip and my phone is very protected. Great quality for the price. Would definitely recommend to anyone! ..."}, {"rating": "5", "user": "-", "raw-text": "You could pay more and get a fancier case, but this one was cheap and has a really nice feel to it, as another reviewer said. It's not too grippy that it gets stuck in your pocket but it's softer than raw plastic. When I first put it on the phone it clicked together so easily I was afraid it would come apart easily. It didn't. When I needed to take it off it was a bit tough, which I prefer. Access to all ports. Feels good. Sturdy enough to protect phone. Better than I expected for $10. ..."}, {"rating": "5", "user": "-", "raw-text": "The fit is spot on; holes are in the appropriate spaces. Couldn't ask for anything better :) Overall, great feel, great look, great price, great Overstock service!!! ..."}, {"rating": "5", "user": "-", "raw-text": "I love my new case. I had the plastic kind that cost 20.00 at a mall and it usto come off . But besides the price the purple one is bright and it feels so soft to be a hard cover. I have recommended to my friends and family. I think I will purchase in every color."}, {"rating": "5", "user": "-", "raw-text": "This cover is very cute, however it peeled really easy and would not stop. It peeled around the most used areas. Cute if you dont handle the phone as much as I do."}, {"rating": "5", "user": "Agent", "raw-text": "Pros: Brilliant Display, Easy Navigation, Good Interface w/email, Great Battery Life, QWERTY Keypad ... Cons: Locked into BB storeOS Used for business e-mail, only $15 for unlimited e-mail plan with attachments. BB central will limit attachment size to reasonable amount ~2MB. Pushes e-mails faster from gmail domains than a web browser. Beware initial old OS / firmware versions were charging lots of $$ to use your own WiFi network.. bug was fixed only a few months ago by Fido pushing firmware upgrade to all customers."}, {"rating": "5", "user": "Mom", "raw-text": "Pros: Attractive Design, Big Buttons, Brilliant Display, Good Interface w/email ... Cons: Difficult Navigation I've been through several now, keep neeeding to replace it cause it breaks very easily. Screen goes dark if even a trace amount of water comes near it. Web browsing is awful, you certainly are not going to shop online with it. Not compatible with many attachments."}, {"rating": "5", "user": "customer", "raw-text": "Pros: Easy Navigation, Good Interface w/email, Multiple applications, QWERTY Keypad ... Cons: Internet display sporadic, Slow internet speed Works well for email, texting, and phone calls. Internet is slow and will not display all the functions of the internet. Does not compare to my wife's iPhone. Wish I would have bought an iPhone and not listened to the AT&T rep."}, {"rating": "5", "user": "-", "raw-text": "I was gutted when my iphone 3gs got stolen, I had no insuramce and couldnt afford another one - so I purchased this Blackberry as I noticed lots of people had them, and I certainly havent been dissapointed! it does everything the iphone does (if not more) and with no annoying itunes to deal with! brilliant!"}, {"rating": "5", "user": "-", "raw-text": "I love my case! I got the black and white one, though it looks more like black and silver. I love it! Very cute and stylish! It never pops off or anything. Nice and sturdy and not in the way of any buttons or speakers, etc. I definitely recommend it. :)"}, {"rating": "5", "user": "-", "raw-text": "I have a 8530 and it fits great but there is one small opening/crack looking on the bottom which is prob. for the 8520 and it looks a bit strange. Overall 4 the price it's worth it! ..."}, {"rating": "5", "user": "customer", "raw-text": "This is a nice item I always get compliments on how stylish my phone looks.. however I emailed and emailed the shipper and did not get a response until a week after I had my product. It was a great price, shipping was wayyy too long the case also has glitter on it which would have been nice to know.. The case is pretty hard to get off when you want to change out faces, the little diamonds start falling off but hey you get what you pay for I guess..."}, {"rating": "5", "user": "-", "raw-text": "Pros: E-mail and easy to textCons: Size and featuresI returned this phone. Nobodfy could tell me how to filter the e-mails coming to my Blackberry. I did want e-mails from my family, but I do not want e-mails coming from my bank. At home I wanted those e-mails, but not on the blackberry. I talked with Best Buy, AT&T and Blackberry. Why do they have a filter if it doesn't work. What a waste of time.I also thought the device was too large to fit comfortably in my pocket."}, {"rating": "5", "user": "-", "raw-text": "Case is ok for the price. not put together very well. the outside layer lifted the first day i got. it's also kind of difficult to take the case off the phone. one false move and you could brake the case. overall it does the job, protect the phone ..."}, {"rating": "5", "user": "-", "raw-text": "Very good phone with excellent features. Bought for my daughter(10) she had no problems with working it. Loads of features and qwerty keyboard. Slightly fiddly with BIG fingers but easy for a child or small adult"}, {"rating": "5", "user": "-", "raw-text": "The case I purchased was for a Blackberry, however upon receieving it the case had the camera hole in the wrong place. The top of the case did not appear to be made for a BB. The hole for the camera lens was on the opposite side."}, {"rating": "5", "user": "-", "raw-text": "This is the most ill fitting screen protcetor I have ever used. I know I ordered the right size, but what I got was too big to fit securely. So I just threw it away. Save your money!!! This is pure junk!!!"}, {"rating": "5", "user": "-", "raw-text": "I love this case. It's very sturdy. I found a little trick to taking the case off because it can be difficult. If you get a credit card and swipe it through the space where the two sides meet the case pops right off. Hope that helps for those who said it was hard to get off. ..."}, {"rating": "5", "user": "-", "raw-text": "I bought this item for the better half who does not have any differculty with it. She has said that she finds it easy to go from ap to ap and she enjoys playing the games and it is very easy the use the camara"}, {"rating": "5", "user": "-", "raw-text": "Great, simple case for my BB 8530. Fits great and seems sturdy. The silicone allows the phone to slide in and out of your pocket much easier than rubberized cases and the fact that it is white means that it will not show any lint or fuzz. Overall, for the price, this is a fantastic case!!"}, {"rating": "5", "user": "-", "raw-text": "very nice not much to it for the price thou,ordered before christmas and it went awol. but another sent out , daughter loves it so all ok,went great with lavender blackberry,,,"}, {"rating": "5", "user": "-", "raw-text": "If you sometimes drop your Blackberry and gasp in horror as it breaks apart and pieces go flying this case is a perfect solution. I dropped my phone many times but insted of my phone breaking open, the case would absorb the shock and the phone would stay in tact."}, {"rating": "5", "user": "-", "raw-text": "I love this phone case and mom loves it too since its hers. now i wanna take it from her because it looks and feels so smooth definitely better then i thought it would look especially for the price its definitely in good quality"}, {"rating": "5", "user": "-", "raw-text": "This cell phone case is solid and well made. I have purchased ones like this from kiosks in the mall for a lot more than I paid for this but weren't even this well made. It's a great case for a great price. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: it has so many feature memory space!!!Cons: scratches easy and the front cover snaps offthis cell phone is preety cool i would recommend it because of all the extra features it has its a good camera video recorder its ure own computer in your hands!!"}, {"rating": "5", "user": "-", "raw-text": "The cases arrived very quickly in the mail. The package wasn't ruined at all. I really like them and that I have a variety of colors to chose from. I also love how easily they come off and on my phone. ..."}, {"rating": "5", "user": "-", "raw-text": "I put the snap on case on my phone and loved it. Great color and the case looked really nice. 2 days later I needed to clean my phone. I took the case off and ALL the snaps broke, even with my very careful. So it lasted 2 days ..... very upset."}, {"rating": "5", "user": "-", "raw-text": "Pros: New user interface which is very similar to bold.Keyboard is ok. Key spacing is fine.Screen contrast and colour is good.Cons: Phone is too light. Very plastic. It doesn't feel substantial in the hand.It seems like it will break easily.The trackpad is not as accurate as the roller ball.Screen sits flush with the front face of the phone, so it can be scratched easily.I do not recommend this phone. It is so light and plasticky, it's almost a joke.I still prefer the old Blackberry curves, which feels much more solid in the hand. ..."}, {"rating": "5", "user": "-", "raw-text": "I love it! The case covers exactly what I was looking for it to cover! Of course my favorite color is pink, so it is exactly what I was wanting. I am super satisfied! It got here a lot quicker then the other that I purchased. Plus it is the same colors I had in my wedding, so it is my all time #1 favorite. I really recommend this to anyone to purchase!!!"}, {"rating": "5", "user": "-", "raw-text": "I purchased this case for my daughter. It is exactly as described and was (literally) a snap to put on. It snaps onto the phone and it fits perfectly with all the buttons on the side of the phone being fully accessible. It is a plastic case which is just as well because I have heard that some metal cases effect the signal strength which is not an issue with this case. Overall a good case and well worth the money."}, {"rating": "5", "user": "-", "raw-text": "This is a good smartphone charges very qiuckly which i think is very handy infact it charges quicker than any other smartphone iv ever had, easy to use and set up, but i do think there could be more apps on blackberry app world and there should also be more free!! ones, but its still a great smartphone and good value to."}, {"rating": "5", "user": "lady", "raw-text": "My daughter is very pleased to own a lavender blackberry curve, she got this for her 12th birthday,yes, a very lucky girl! she loves it & manages the tiny keys with no problem."}, {"rating": "5", "user": "-", "raw-text": "We bought this as a present for my mum on her birthday as I already have one and am very happy with it. Good purchase. Blackberry should reduce the price further and should not lock it so that anybody can use it when they travel out of the country."}, {"rating": "5", "user": "-", "raw-text": "I've had the 8520 for a little over a year now and I've put up with more than what most people would. It isn't the specific device that I have because I have replaced it four times. The 5.0 software did improve it somewhat, but not enough in my opinion to recommend it to a relative acquaintance let alone anyone I want to keep around. My next purchase will definitely be a 3G or better phone. Pros: -Track pad -Nice interface while in app world -Durable against dropping -Relatively decent water resistance -Better now with some of the 5.0 software bugs worked out -Great for a basic or first time smart phone user Cons: -No flash for the camera -Some speaker fuzz on some louder tones -Poor battery life -Gets stuck in mid cycle when resetting -Runs 2G(EDGE) internet -Slower when tethered"}, {"rating": "5", "user": "-", "raw-text": "Super. cheap little blackberry, after friends played with it and explaned functions in simple terms i get on with it great. As a basic blackberry it does everything it says on the box."}, {"rating": "5", "user": "-", "raw-text": "Love this phone dont know how i lived without it! I would recomend it to ALL my friends! It is great if your friends have a blackberry because you can instant message them throught blackberry messenger! It has an app world so you can download all your favourite games!"}, {"rating": "5", "user": "-", "raw-text": "I have been so pleased with my hard case. It is actuallly just the back and a thin silicon piece in between which gives added protection from dropping the phone or when my puppy thought the corner was tasty enough, the hard back piece saved it from her sharp new teeth. I was disappointed that pink was the only bright color available. So much black and I can't find black in the abyss of our pocketbooks usually lined in black ! otherwise I can count on it for protection, slips easily in and out of the pocket of my jeans. I would love purple, neon green, yellow, cherry red or designs. But I love it and bought 2 for fun. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: great protectionCons: smellthis is the best type of case for your blackberry. I bought this for my new blackberry after being very satisfied with the one I had on my first one. I have dropped the phone on several occasions and the phone was never damaged."}, {"rating": "5", "user": "-", "raw-text": "Once this phone is set up it is fine, but little things like activating email, bluetooth, and getting correct settings are a nightmare! Also, the phone is useless without the data bolt-on, i thought i could just use the wifi on it like I do on iphone, but you have to have the bolt-on, so ended up costing more than I anticipated.But now everything is set up, am quite happy with it."}, {"rating": "5", "user": "-", "raw-text": "I loved my new silicone case for my Blackberry!! I found this case at the store for 20 dollars and I recevied it for **** dollars at Overstock!! ITs amazing what you can find in this site!!"}, {"rating": "5", "user": "-", "raw-text": "this case is great but the clip leaves something to be desired. the clip needs to be made up to par with the awesome case that seriously can be dropped over and over and the phone is perfectly fine"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to put on, easy to cleanCons: Takes about 5 minutes to properly installI bought this for my red Blackberry Torch so that the screen would be protected from scratches and fingerprints.The instructions seem intimidating, but It was very easy to put on, just make sure your phone is off or locked since you have to push on the screen. Take your time to make sure it lines up as best as possible.There were microbubbles, but these easily went away on their own within 48 hours.Tip: If you get smudges on the protector, just spray some of the install solution on a paper towel and wipe away."}, {"rating": "5", "user": "-", "raw-text": "I ordered this item January 14th, before I got my new phone. I've had my phone for almost 2 weeks now and still my item hasn't arrived. Very disappointed with Overstock for such long slow shipment. The bundle looks great though, too bad I'm still waiting...."}, {"rating": "5", "user": "-", "raw-text": "Bought this for my daughter for Xmas As she was deparate for a purple Blackberry. She hasn't putit down, functionality is just what she hoped for and it's so trendy."}, {"rating": "5", "user": "aithwaite", "raw-text": "we bought this from argos after o2 let us down badly. it was for a christmas present and agros saved our lives !...the phone is packed with features, works well and is very stylish. if you buy on o2 then when you want to change networks theres no need to have the phone unlocked...o2 phones are already open to other networks !"}, {"rating": "5", "user": "-", "raw-text": "I found the same one for $15 more in store just three days before I purchased it here. I was nervous that with it being so much cheaper that it wouldn't fit and look cheap. Im glad it looks exactly the same as the one in stores! ..."}, {"rating": "5", "user": "-", "raw-text": "The case I ordered was advertised a rubber and the one I received is in fact cheap hard plastic. This will most likely be the last time I purchase from Overstock. Two of the three items I ordered had false descriptions or I was shipped the wrong item. Either way, bad business practice."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great for business functions. Puts your entire in the palm of your hand.Cons: The system freezes from time to time and you must reboot to fix the problem.My Curve 8520 is my first Blackberry. Both my girlfriend and I have one. I love the phone and as a business owner it makes things so much easier. I don't need to be near a computer to receive my emails or use social media. It's like having my office in my pocket at all times. My only complaint is from time to time the Curve freezes and you must reboot the system to unfreeze it."}, {"rating": "5", "user": "-", "raw-text": "very Stylish i like the chrome and leather look combination. the only thing I don t like is the belt clip. is not wider enough to stay secure in my belt and keeps coming off of it."}, {"rating": "5", "user": "-", "raw-text": "This phone is by far the best one that I've ever purchased, so easy to use and looks great. The battery life is not the best as have to charge every other day (BUT IF YOU USE IT A LOT THEN THIS IS TO BE EXPECTED), thus making this a minor issue that I am more than happy to put up with. I would definitely recommend, so if you're considering purchasing and have any doubts, all I can say is don't doubt, JUST BUY........."}, {"rating": "5", "user": "-", "raw-text": "Pros: batteryCons: the appsThe ease of use is something to be desired. Very hard to download apps.and sync phone with the apps. Needed to go to sales person to help figure it out."}, {"rating": "5", "user": "-", "raw-text": "The otter box was a great choice for me because of its ruggedness and level of protection. The 3 layers def protect the phone from long falls and screen protection is superb. The only down side is the bulky ness that it creates but if you don't normally put it in your pocket, as I do not, then its really not a problem. ..."}, {"rating": "5", "user": "-", "raw-text": "This is an excellent case for the Blackberry 8520. It comes with a holster if you prefer. I like to carry my phone in my pocket, or throw it in my purse. It does add a little bulk to the phone when carried in my pocket, but I would rather have a little bulk than a beat up or ruined phone! Highly recommend!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Attractive Design, Brilliant Display, Easy Navigation, Good Interface w/email, Great Battery Life, QWERTY Keypad ... Cons: No GPS, Slow internet, Small Buttons This is the second Blackberry in the household. Both lack 3G, but EDGE and Wi-Fi provide a minimal level of app and web access for simple searches when away from our home computers. Works great for email in International Travel so family and friends can stay in contact. We use both Blackberries with Wi-fi at home and whenever available away from home. This give us T-mobile network service whenever wi-file is available when roaming in the US. Would have liked 3G and the GPS, but this is a good smart phone for a retired lady."}, {"rating": "5", "user": "-", "raw-text": "this case is stylish with it's color, i bought the blue, and it feels great! very comfortable and i like that it leaves the side buttons around the phone exposed for easier use. i wish it had more colors. ..."}, {"rating": "5", "user": "-", "raw-text": "I find the case and rubber cover for the blackberry to be excellent. This is a good buy based on that alone. The holster it fits into is terrible. The belt clip is prone to popping off and it simply doesn't match the quality of the phone cover. The holster is really just pitiful. I am still looking for a suitable holster to use with the very well made case- I would recommend this to a friend. ..."}, {"rating": "5", "user": "-", "raw-text": "Very disappointed. Cover was flimsy and when it was installed properly the creases showed where it was not painted. Pretty Ghetto looking though it was cheap enough so I guess I cannot complain all that much. I did however get a similar one from eBay that was $3 and free shipping that was much better quality."}, {"rating": "5", "user": "-", "raw-text": "bought this as a birthday gift for my 16yr old daughter, she delighted as she can msn, facebook, blackberry messenger e-mails and a whole lot more. It's like having a pocket size computer."}, {"rating": "5", "user": "-", "raw-text": "I just received this today and I love it. I ordered the red one and the color is beautiful. Its a candy apple red . I love the feel of the case on my phone. Once again, I am very pleased with my purchase from Overstock."}, {"rating": "5", "user": "-", "raw-text": "I love the case I have an 8530 so I really wasn't to sure how the case would fit on my phone, but to my surprise it's a PERFECT match!!!! Highly pleased and would recommend it if you do the occasional drop to the ground, I have dropped mine at least 3 times and the case is still in 1 strong piece!!!! ..."}, {"rating": "5", "user": "-", "raw-text": "I had the exact trouble with this product that another rater did. The clear window was ruined with glue residue from a sticker. In the process of trying to clean it, I ruined the whole thing. The upside: Overstock credited my account so I could order another one. He also told me I'd get a shipping credit...which I didn't. But I took advantage of a free shipping promotion, so it worked out okay. And this time, the product worked, more or less. There's a bubble in the screen but I'm afraid of making things worse if I try to reapply it. In the past when I've bought these types of things, they come with several in the pack. No such luck with this one. You get one shot. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to use, touchpad featureCons: Unreliability of AT&T NetworkThis phone is a great upgrade from my previous Blackberry Curve. I like the touchpad feature, and while I had to figure out the menus and how to rearrange the icons, once I set it up the way I liked it, I have been very happy."}, {"rating": "5", "user": "-", "raw-text": "Had a Nokia e63 before. This is better in almost every way, Facebook works very well, you can have more than 2 email accounts etc.It's not 3G though which makes web surfing a bit slow..."}, {"rating": "5", "user": "-", "raw-text": "This product serves it's purpose. Be sure your screen is clean and dry before removing the plastic from the screen protector. It has a sticky side that goes on the phone and once you get fuzz or dust on it, it will not come off. I could not get all the bubbles out , but overall it serves it's purpose. ..."}, {"rating": "5", "user": "-", "raw-text": "I love this product I dropped my phone and the phone didn't even come from the case like other. I give it a 5***** rating because of the quality and how durable it is and the price was amazing hated I only ordered 1 when I went back to order more they were gone. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: looks good and protects from everyday handlingCons: comes apart too easilyIt's very pretty and It does protect your phone from everday handling. But if you drop your phone its going to come apart. I was hoping to find something that would really protect my phone from falls but this is NOT it."}, {"rating": "5", "user": "-", "raw-text": "This case is so cute, with pretty shades of pink and vibrant plum colored butterflies, flowers and swirls on black. Easy to put on, only 2 pieces and it snaps right over the phone. I have been using this case for over a month now and have received many compliments on it. Also very durable, I have dropped it several times and so far not a scratch on it ( phone is okay too). Bonus: very well priced. I would recommend this case...LUV IT!!!"}, {"rating": "5", "user": "-", "raw-text": "I needed a case to protcet my new blackberry, I had already dropped it twice. This case was perfect...it fit well and does not snap off easily. I have used overstock for many of my cell phone needs and I;m never disappointed....and I love the prices too!!!"}, {"rating": "5", "user": "-", "raw-text": "A pretty good case and I like the hard case which snaps over the soft case. However, the hard case is a little more delicate than I anticipated - it cracked in two places without much effort ... a little disappointing."}, {"rating": "5", "user": "-", "raw-text": "I love this skin, the design is beautiful, hot pink flowers and butterflies. I get a lot of compliments, people asking where I got it from. It fits perfectly to my 8520. I recommend this to anyone who wants to both protect their blackberry and have a cute skin. Thanks Overstock, you never disappoint!"}, {"rating": "5", "user": "-", "raw-text": "bought as an xmas gift but had to exchange for a new one as the phone buttons froze so couldnt even turn it on, then lo and behold same thing happened to the 2nd one so had to return and exchange for a different phone entirely. have to say tho argos are brilliant if you need to return anything top service which is why i do nearly all my shopping at argos. so the phone has its problems but argos does not"}, {"rating": "5", "user": "-", "raw-text": "I bought this for my daughter as a christmas present after 3-4 days the picture had started to peal off, it is ment to protect the phone it does its job but doesnt stay in good condition for long.I wouldnt not recommend it to a friend as it is not good quality for how much it costs."}, {"rating": "5", "user": "-", "raw-text": "Pros: everythingCons: I do have to charge my battery every night....Blackberry is the absolute best phone in the world....My 30 days is almost up and I have considered taking it back and getting the Blackberry Bold just because the camera has a flash....And the keypad is a tiny bit larger....but I would have to pay $99.00 and I don't want to do that.....I am an official crackberry tho.....I never want to own anything ever again but a Blackberry....Some people may like i-phones, but that has to be the ones who want a touch phone....well, not me...I want a keypad.......I LOVE A BLACKBERRY....But I wish someone would read this and let me know if I would prefer the Bold 9700 over the Curve 8520.....The only problem I have is even when I'm not logged on, my battery does go down pretty fast....I have had people to tell me that there's doesn't have to be charged but every 2 or 3 days, but mine has to absolutely be charged every single day......"}, {"rating": "5", "user": "-", "raw-text": "Nice case that does the job. I would have love to have more color options, but for under $2, you take what you can get. Silicone material grips pretty well so it stays put when placed somewhere."}, {"rating": "5", "user": "-", "raw-text": "i got this product for me and my husband because we have the same phone. he had one but he dropped it and it broke, so i found this product at a great price. and my husband loves, he couldn't believe the price either. ..."}, {"rating": "5", "user": "-", "raw-text": "Bought this phone for my 14 year old son and he likes it alot. Seems to be the thing to have. Have always found the orange network good and think this was a good buy."}, {"rating": "5", "user": "-", "raw-text": "was a bit of a pain to set up i brought 2 of these one from argos and one from carphone warehouse the latter one was really easy but the one we had from here was a pain we had to contact orange to register the sim it took about 24 hours before it was up and running properly having said that we've had no problems since and it seems a really good phone"}, {"rating": "5", "user": "-", "raw-text": "02 Blackberry8520 curve mobile phone-purple the phone was bought for my daughters birthday both her and her sister have the same phone different colours and they love the phone they love using the bbm feature and internet on the go i would recommend this phone others"}, {"rating": "5", "user": "-", "raw-text": "Don't know what I would do without it,know some people have said it's obsolete?But it's a wonderful product and saves me time,easy to use,and quite frankly best phone I've ever had."}, {"rating": "5", "user": "mmmmm", "raw-text": "its a verry nice phone its wicket for communications with your friends on blackberry messenger in short bbm you can have internet tooo facebook email gosh do i love this phone or what :)"}, {"rating": "5", "user": "-", "raw-text": "I had one of these phones 5 years ago gave it to my husband when i got a new phone, sorry i did. Bought this one for my grandaugher because her pearl broke. she happier with this blackberry; No complaints"}, {"rating": "5", "user": "-", "raw-text": "Brought this phone for my daughter and she loves it. She perticually liked the lavender colour. The only problem is the phone seems to be stuck to her hand! Lol! It has made her happy which makes me happy to. Great buy would defo recommend to a friend."}, {"rating": "5", "user": "-", "raw-text": "bought blackberry for teenager son i had problems starting it up but my daughter had no problem although it has many features you do have to pay for BB which i think is a gimmick but a must for teenagers"}, {"rating": "5", "user": "-", "raw-text": "This phone is not the best phones at all in my opinion its pretty rubbish so i took it back to argos for a full refund straight away. The phone is rather ugly and is so slow and takes ages to load it also hard to download apps and when you download them they don't work"}, {"rating": "5", "user": "-", "raw-text": "Pros: Brilliant Display, Easy Navigation, Great OS, QWERTY Keypad ... Cons: Smaller than 8830 World E Having a busy schedule with community involvement, part-time work and Veterans'affairs the interactive syncronized calendar is what I found efficient; having owned an 8830 World version the curve is definitely a valuable tool; bluetooth works great - a must for talking while driving. Although the keypad is a little smaller they are prominently designed for easy use. I find it easy to manage the keypad with one hand when necessary. Talking while retrieving info a plus! The side buttons are now protected with dust \"booties\" - another plus!"}, {"rating": "5", "user": "-", "raw-text": "This case is absolutely wonderful. It would have been much better with a clip on the back, but it cost me $3.00 to put one on there, so I'm not complaining. This product has LITERALLY saved my phone quite a number of times. It's a bit hard to come off, so it's more so a pro than a con. So, if you buy this or are thinking about buying it, you'll love it. Okay?! ..."}, {"rating": "5", "user": "-", "raw-text": "sorry but I returned this item due to not fitting my phone I ordered it because it was very stylish and had bling but my phone was a little bit bigger so this cover did not fit."}, {"rating": "5", "user": "-", "raw-text": "i brought this item for my daughter for her birthday she was really happy with it everything is very simple to get up a going i think the price is really good for the features the product has in all a really good buy i want one now :)"}, {"rating": "5", "user": "-", "raw-text": "I recently shopped for a similar protector case at a mall kiosk and I'm definitely glad that I opted not to buy it there because it was four times the price of this one. My only complaint about this particular design is that the striping appears to chip easily. Given the amount of money that I saved by buying it on Overstock.com, I won't have a problem buying a replacement, if necessary. I didn't give it \"5\" stars but it was certainly worth the money that I spent on it. ..."}, {"rating": "5", "user": "-", "raw-text": "bought this for my partner,who has bb also he did'nt want the full case so I opted for this one.He likes it says it fits phone perfectly and is good to access all functions.great item for bb"}, {"rating": "5", "user": "-", "raw-text": "this is a good phone the camera is good quality the sound is great only downside is the battery goes down very quick when your watching videos or listening to music it comes with a 2GB card which is great for storing your stuff"}, {"rating": "5", "user": "-", "raw-text": "This product is inexpensive enough -- but since it is just molded plastic, it just did not fit my phone. Then the horror of rying to return it and being told it would cost over $***. The product only cost about $*** to purchase, plus shipping."}, {"rating": "5", "user": "-", "raw-text": "This is my first BB telephone and I think it is great,have a lot to learn,but it is exciting learning.My only down side at present is the battery life,it needs recharging very often."}, {"rating": "5", "user": "-", "raw-text": "Pros: Keeps you phone safeCons: Price is a bit muchFirst off, definitely have the phone guys at Best Buy set it up..they have a couple tools that let them do it much easier than you sitting at home with a penny. That said, with installation at $7, $37 for an invisible protector (installed) seems a bit much to me.It does, however, do an excellent job. You have to clean it every once in awhile, but it protects your screen from damage very well. It's taken a couple licks that would surely scratch the screen, but nothing is visible at all on the shield.As a little side bonus, the shield is every-so-slightly sticky. It actually makes the phone into its own friction mat on your dashboard."}, {"rating": "5", "user": "-", "raw-text": "Pros: Phone does what I need. It calls and texts. I don't use the fancy junk.Cons: None that I am aware of.If you don't care for 3g or internet at all its good. I disabled the data under options so I am not using it at all. Save some greeny leafy spendy money."}, {"rating": "5", "user": "-", "raw-text": "I bought this phone for my 14 yr old son and he loves it.He has all his friends added on bbm which is why he wanted this particular phone. Its seems nice and light to carry aswell. Very pleased as it was actually more expensive to buy in most mobile phone stores!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Attractive Design, Brilliant Display, Great Battery Life, Great OS, QWERTY Keypad ... Cons: Small Buttons Good visual contrasts; lots of useful applications available. Con: under my coat--can't hear the phone ring. Had previous incarnation of Blackberry curve--same problem."}, {"rating": "5", "user": "-", "raw-text": "My PDA was old and on its last legs. This was recommended as a good, proven replacement (and is a phone as well). Early use of it suggests it will be a satisfactory replacement."}, {"rating": "5", "user": "-", "raw-text": "I was a bit apprehensive before I bought the Curve as I had never had one before, and I am not very technical regarding these phones, but I need not have worried, as after playing around with with it and reading the manual in a couple of days I have nearly mastered everthing on it and would recommend it to anyone"}, {"rating": "5", "user": "-", "raw-text": "I bought one of these for my Blackberry and my husband liked it so much that I ordered another for him. The quality is better than the more expensive ones that they replaced."}, {"rating": "5", "user": "-", "raw-text": "im really happy with this phone best phone i have had my old phone was a touch screen prefer buttons been wanting a blackberry for a while but wasnt sure so went for it very pleased i did battery does go down quite quick but that is cus on it a lot i was very pleased that it got 3 covers for it go for it"}, {"rating": "5", "user": "-", "raw-text": "It's a very cute design and it does dress up the phone. However, it's a pain to get on and just about impossible to take off. I had to take a butterknife to get in between my phone and the case in order to unsnap it off. In doing so, I scratched the paint on my phone. Definitely not worth it. Sillicone is a lot better. ..."}, {"rating": "5", "user": "-", "raw-text": "BlackBerry Curve 8520 White GSM Unlocked Cell Phone; i love anything white!!! when you received this phone my son took it from me! thinking of getting new one. I will bring in all my friends to shop in here"}, {"rating": "5", "user": "-", "raw-text": "I purchased this phone for my son for his birthday. As I don't know anything regarding up to date mobiles/gadgets I took a gamble and WOW he is absolutely delighted with his 02 Blackberry 8520. Typing is easy and comfortable to hold"}, {"rating": "5", "user": "-", "raw-text": "the phone is an amazing device it has everything i need i am 22 years old and i act like a child i have it 24/7 but the thing that lacks it is that the battery goes out quickly but still useful.I am very happy that i bought this product .Thank you all very much especially to the person/s who invented it.The features are wonderful and powerful i especially like bbm and of course social network.The design is very attractive."}, {"rating": "5", "user": "-", "raw-text": "Pros: Plain, simple and does the job.Cons: Lint and such sticks to it.The summary says it all. This is a good unobtrusive skin to protect your iPhone. Plain, simple and has already protected from several drops without fail."}, {"rating": "5", "user": "-", "raw-text": "I personally have not used this item, it was bought as a birthday present for my neice (12 years old). She is absolutely delighted with it, which is why I gave 5 star ratings!! If anyone was going to find a fault with it, she would be the one!!"}, {"rating": "5", "user": "-", "raw-text": "This skin does exactly as it should;protect your BlackBerry Curve,especially if like me you carry your 'phone in jeans pocket, I have had no problems with this product."}, {"rating": "5", "user": "-", "raw-text": "My 15 year old son loves this phone he's never looked after something so well ,must be good because he's not moaned about anything apart from having to charge it every couple of days,it's an hard life !"}, {"rating": "5", "user": "-", "raw-text": "took a bit of getting used to using it, but i love it,i never leave home without it, i like the fact that it has a keyboard , its just like a mini computer i love it , the best purchase ive made"}, {"rating": "5", "user": "-", "raw-text": "I brought it for my 16 yr old daughter for xmas 2010, she wanted one for a long time. I got her the lavendar curve, and she has done nothing but complain about it, she feels so disappointed, the battery life is bad, the phone needs charging up to 3 times per day, the middle button on the phone don't work most of the time. It crashes all the time.not a good purchase unfortunately.I am hoping Argos will exchange it"}, {"rating": "5", "user": "-", "raw-text": "I bought this for my daughter for xmas and to be honest she hasnt been seperated from it since she had it. She is on it 24/7, its well worth the money and a good little gadget. Would recommend it."}, {"rating": "5", "user": "-", "raw-text": "It was not entirely clear that one can not access the Internet as a Pay As You Go customer, this resulted in a visit to the O2 shop in order to take out a contract. This made the purchase somewhat frustrating. The product itself is fine."}, {"rating": "5", "user": "Twist", "raw-text": "Best phone I ever had! The 3gps and the option to connect to BT openzone free means I always have a signal!( area is quite rural) Previously I have had to walk down my drive for signals. The querty board is easy to use for a novice texter like myself. It has so many features which as I mobile novice I hope to conquer, my 13 year old daughter worked out far more features than me already, I just have to remind her this is a business tool, but obviously great for socal networking too!"}, {"rating": "5", "user": "-", "raw-text": "bought this for my daughter as she had hampered on for it and found that Argos had a different colour that she liked easy to use and up to date also the reserving and pick up was great as could not get out of the house for the weather"}, {"rating": "5", "user": "-", "raw-text": "Bought this phone for my daughter as they are the rave at the moment. She had no idea she was getting one, and she was over the moon. I would recommend this phone for anyone looking for one, i"}, {"rating": "5", "user": "-", "raw-text": "great phone,great style.has some really good features and apps.love how my email comes direct to my phone, good for when youre on the go.very easy to use and has a lot of storage for video , music and games.only one thing that lets this phone down and thats the camera. the camera itself isnt bad its the lack of a flash so most photos come out dark, for a blackberry i expected a better camera facility.., but on the whole im very pleased with it."}, {"rating": "5", "user": "-", "raw-text": "I bought this phone for my 13 yr old son as a Xmas present & he was thrilled with it.it took a couple of days to get used to but soon got to know & would recommend to any1.the keys seem small but are actually a good size."}, {"rating": "5", "user": "-", "raw-text": "Bought for my daughter for Christmas. It was want she wanted so she was very pleased with it!!!I must say, u do not have to pay to find out your balance on this orange mobile!!"}, {"rating": "5", "user": "-", "raw-text": "Bought this as a present for my son on request. He loves it! Unfortunately it fell out of my sons pocket and the screen cracked, while he was on his bike but thankfully had bought argos insurance so had it exchanged for a new one no problem."}, {"rating": "5", "user": "-", "raw-text": "A GREAT PHONE EXCELLENT APPS, ONLY PROBLEM IS THE KEYBOARD LETTERS A BIT SMALL BUT YOU DO GET USED TO IT AFTER A WHILE DEFINETLY LIVES UP TO MY EXPECTATIONS, WOULD HIGHLY RECOMMEND, BATTERY LIFE COULD BE IMPROVED NEEDS CHARGED EVERYDAY, ALTHOUGH I AM A CHATTER BOX SO MIGHT NOT APPLY TO EVERYONE, ALL IN ALL A GREAT BUY............"}, {"rating": "5", "user": "-", "raw-text": "This product is only 240 brand new from a company that you belong to. Max 20 dollars to unlock it if not free, and you save a ton of money. Why do we come on here if we are just going to get ripped off?"}, {"rating": "5", "user": "-", "raw-text": "Pros: EverythingCons: Price, should have more than oneThe perfect shield for a great phone, just wish for the price you would get more than one in a package."}, {"rating": "5", "user": "-", "raw-text": "phone is great dont have a bad word to say altho to start with i put my old sim straight in it instead of using the one that came with it and i had to ring o2 and get the settings but apart from that great phone love it!!!!!!!!!!!!"}, {"rating": "5", "user": "-", "raw-text": "My Daughter asked for this Blackberry for her 18th Birthday as she is delighted with everything about it.If anything,it has exceeded her expectations.Smartphones tend to drain the battery so a recharge is necessary at the end of every day but it's a small price to pay.She was already on the o2 Network so by visiting the o2 website and using live-chat to an Operator,my Daughter was able to transfer her old number and credits to her new phone with the minimum of fuss.Recommended to all and thanks to Argos for the lowest price we could find."}, {"rating": "5", "user": "-", "raw-text": "have had it for 3 weeks now, on the whole im pleased with it, track wheel has jammed a few times but started working again. will be returning it if i happens again."}, {"rating": "5", "user": "-", "raw-text": "my daughter loved this for her birthday, sooo excited, shes now showing it off to all her friends!!!! its now a 'must have' for xmas for all teenagers, that is, till the next updated mobile comes along.... xx"}, {"rating": "5", "user": "-", "raw-text": "Pros: Good Interface w/email, QWERTY Keypad ... Cons: Brks at chargeconnection, Poor Battery Life, Poor OS, Screen Scratches Easily, Small Buttons Used daily for work. Two used in 2 years - both broke - too expensive to break that easily. very disappointed in quality and relability. Switched to alternate smart phone which I love"}, {"rating": "5", "user": "of", "raw-text": "Pros: Compact, Lighter weight than many, Works great in Europe ... Cons: Small screen Easy to use in Europe Wide range of plans for the overseas traveler Works better in Europe than in the USA"}, {"rating": "5", "user": "-", "raw-text": "Pros: Big Buttons, Brilliant Display, Easy Navigation, QWERTY Keypad This is a no-nonsense phone that gets the job done, although recently the combination of touchscreen AND slideout keyboard of the new blackberrys will likely edge out my favourtism of the Curve. It is easy to use, reliable and tough, I've dropped it several times with no damage. My biggest complaint is that there's no tiny ABC DEF type alphabet which corresponds to the number keys (since the number keys already share speace with the qwerty letters) which makes figuring out today's popular method of advertising phone numbers as words or phrases virtually impossible (aka 1-800-CALL MAYTAG or something similar)"}, {"rating": "5", "user": "-", "raw-text": "Was a bit nervous about buying a blackberry after people giving them quite a bit of abuse but I LOVE IT! Would definitely recommend for girls because of the colour! Great xmas present. Easy to use, nice loud ringtone, message alert etc. Facebook very easy to use on this phone : )"}, {"rating": "5", "user": "-", "raw-text": "Feels cheapy but stays on well enough. Not quite big enough for the 8530 like it said it should fit. There's gaping around the edges but it still stays put even after a drop. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Attractive Design, Durable, Easy Navigation, Good voice quality, Great Battery Life, QWERTY Keypad ... Cons: Pricey These phones handle typical teenage abuse without damage."}, {"rating": "5", "user": "-", "raw-text": "Pros: Features, Color screen, Apps, BBMCons: NothingPurchase for relatives Overseas and myself when i travel works great best of all i can take my blackberry anywhere i want and not have to worry about a thing great phone."}, {"rating": "5", "user": "-", "raw-text": "I love it. It goes perfect with my purple Blackberry and it fits in my holster just nicely . Thanks Overstock. I will be shopiing with you more often for other things I need. You delivery is great. My two cases I bought from you got to me in no time."}, {"rating": "5", "user": "-", "raw-text": "This item has two tabs to remove before application and after. The before worked fine the after did not. The glue on the \"after\" tab did not come off. Tried to clean it and ruined the protector. Had to pull it off and throw in the garbage. ..."}, {"rating": "5", "user": "-", "raw-text": "Once again Overstock.com has proven their ability to continue to produce amazing products with excpetional quality and efficiency. Overstock is my new obsession."}, {"rating": "5", "user": "-", "raw-text": "These are a must have to use with your BB Curve It helps you hold it and protect the phone in general I would hate to drop mine and this really helps . Plus you can match your outfit with 4 different colors to choose from.Very easy to put on and take off."}, {"rating": "5", "user": "-", "raw-text": "Pros: Not a bad phoneCons: I do'nt know what happened to Newegg but it took them 2 weeks to validate my address, I was ordering from them now for over 2 years and when I ordered this phone next day, they kept telling me to validate my address. I payed for next day and it took 2 weeks with no explanation.Newegg is falling down on the job. Why would it take over 2 weeks for them to deliver a phone. No explanation was given I just wanted to cancel the order if it was so much problem for them to mail it to me."}, {"rating": "5", "user": "-", "raw-text": "got this today and easy to put on and get off and it looks great just love it my sisters are mad at me cause I did not order them one and know it's 5.00 more than I brought it for not sure why the price went up ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: It has everything I need and performs excellentlyCons: Maybe, just that it's not 3G, but still does fineI basically received my new phone for free as an upgrade, but would definately pay a reasonable amount for it if I had too. So far, I have been able to do everything I need to do on the phone without even viewing the manual. There are more complex uses that I will eventually desire to accomplish and will be reading up on those issues. Would reccomend this phone to anyone looking to buy a smartphone."}, {"rating": "5", "user": "-", "raw-text": "Pros: Attractive Design, Easy Navigation, Good Interface w/email, Great OS, QWERTY Keypad ... Cons: Poor Battery Life I use it for general use, emailing, texting, Facebooking and light Web surfing. It excels at all of them. GPS works great, though not with Google Maps. I had the BB Bold before and it was a great phone but much to big for my needs."}, {"rating": "5", "user": "-", "raw-text": "I got this phone a few weeks ago this is my first blackberry and I'm impressed Pro's: -track pad -media key's(nice touch for a PDA) -UMA calling(wifi calling)(this rocks if you live in a basement or going someplace were you get no signal) -blackberry app world(jest needs more apps) -battery life is good(not great)bout 2 days on standby i get 5 hours with bluetooth calling -rubberized border makes it feel secure in your hand -clear calling Con's: -screen could be clearer -speaker could be better -no GPS (kinda a stander these days) -no flash(want not a need) -small keyboard -volume rocker doesn't do anything on the home screen all and all for jest the few flaws its great phone ps for thous who could not fined a swivel holster I'm using the one from the 8300 curve and it fits great (my first reveiw thanks for reading)"}, {"rating": "5", "user": "Phone", "raw-text": "Good phone but not as great as the BB 8900 Cons: -Display ( resolution is similar to BB flip) -Talk time (4.5hrs compare to other BB) -Camera/Video (only 2.0MP and video is a bit laggy) Pros: +Optical Sensor Pad( this is what set this phone asides from all BBs is that it uses an optical sensor pad compare to those trackball that you have to eventually replace unless they are the new trackless balls ex. 8900 and Tour) +Much Slimmer Much Lighter than most BB full qwerty keyboards +Does support UMA which is great if reception is not great @ home) Tried this phone for 2 days now but coming from a BB8900 it is still a bit better"}, {"rating": "5", "user": "-", "raw-text": "Overall I can simply say this is a sexy phone! Size: This wouldn't be called a \"hand-held\" if it doesn't fit in your hand. Ever notice those ridiculous clunky"}, {"rating": "5", "user": "-", "raw-text": "Pros:Guaranteed to make you love it :-) Cons:Letters on keys hard to see, needs brighter backlighting of keys I got this as a Christmas present yesterday. Although I'm a bit of a techie, I essentially keep a cell phone only for emergency…"}, {"rating": "5", "user": "-", "raw-text": "Pros:Trackerpad, Light, Durable, Plenty of apps, Charging, Talk Time Cons:Average Camera, Small Buttons I can't deny it any longer, as I'm a \"Crackberry Addict,\" and need serious treatment for this disorder. A cell phone used to be just a device for me, and I didn't care about getting anything fancy. As long as it made and received…"}, {"rating": "5", "user": "-", "raw-text": "Pros:Great apps. Track-pad. Cons:No flash on camera. Freezes a lot. Slow browser. Low battery life. This was my first blackberry purchase from T-Mobile! Right away…"}, {"rating": "5", "user": "-", "raw-text": "Pros:The entire phone Cons:Old curve used USB Mini and the new uses USB Micro If this curve was a woman I would be drooling. I just migrated from an 8330 (trackball style)…"}]