[{"rating": "4", "user": "-", "raw-text": "The very appearance of the device is impressive, it looks very solid and expensive, a large mass adds to that feeling. Design original strict. Metal case, though not all, not only gives high strength and reliability but also excellent cooling system due to its high thermal conductivity. The screen is exactly the minimum size at which you can read webpages in landscape mode, no zoom, movies look very comfortable. For me, the perfect size to the hand rather big and always pull out with one hand even zoomt. The picture quality is excellent, very pleasant to look at, does not hurt too much eye brightness and contrast as a super amoled, colors are natural, the sun can be seen well."}, {"rating": "4", "user": "-", "raw-text": "Pros:Lots of memorybig screenlower price than before Cons:Not Amoled I bought this phone a few months ago, upgrading from my HTC Desire. I gotta say there are both upsides and…"}, {"rating": "4", "user": "-", "raw-text": "Pros: Large, bright screen that produces amazing images. Android software is straight forward and easy to get used to. Processing power is superior to all current phones. HTC Sense…"}, {"rating": "4", "user": "-", "raw-text": "Pros:\u0095 Screen size\u0095 Extra Memory for Apps\u0095 Beautiful Design\u0095 Workarounds for common problems Cons:\u0095 Poor battery Life\u0095 Screen Brightness and Sound Volume. So many are wondering whether or not to upgrade…"}, {"rating": "4", "user": "-", "raw-text": "Pros: Beautiful large, sharp screen. Dedicated \"Home\", \"Menu\", \"Search\" and \"Back\" buttons on the face, feels well made, runs Android platform, microUSB dual data/charge, lots of small thoughtful…"}, {"rating": "4", "user": "-", "raw-text": "Pros: Nice big screen for emails and good operating system and build quality ... Cons: Battery life and speaker not loud enough Had this phone a couple of weeks now…"}, {"rating": "4", "user": "-", "raw-text": "Pros: Large screen is awesome for browsing online, playing games, email etc. Easy to use. Camera is 8mp and has high def video recording. ... Cons: Only a…"}, {"rating": "4", "user": "-", "raw-text": "Pros: Attractive, useful, big memory for pictures and apps, great camera! ... Cons: The size of the buttons This phone is sleek, beautiful and really great! It…"}, {"rating": "4", "user": "-", "raw-text": "Pros: Camera ... Cons: Almost everything The phone itself runs Android, which is great! However my model shuts itself off, calls people in my contacts list…"}, {"rating": "4", "user": "Ball", "raw-text": "I have been using the Desire HD for a couple of weeks. Generally, excellent performance. The big screen is superb for video - I watched the Bourne Ultimatum on the train from…"}, {"rating": "4", "user": "-", "raw-text": "Pros:- Seemingly unlimited apps- Great size- Reputable brand- Simple to operate Cons:- Wish the battery lasted a bit longer I've had a few smartphones in the past, mostly pocket pc's and I have a blackberry for work. It was time for something new (and I LOVE…"}, {"rating": "4", "user": "-", "raw-text": "Pros:Has Wi-fi, Android Market, 5 Megapixel Camera, Flash, Facebook, Twitter and other Social Networks. Cons:Big screen may make it easy to drop. When I first came…"}, {"rating": "4", "user": "-", "raw-text": "Pros: large screen, easily personalised, dont need itunes, syncs settings wirelessly with HTC Sencce (cloud). ... Cons: battery life requires that some features…"}, {"rating": "4", "user": "-", "raw-text": "Pros: Nice size and shape, solidly made except for rather flimsy covers to the battery and card compartments (see below). ... Cons: Rather heavy - it's a metal chassis so feels more solid. The…"}, {"rating": "4", "user": "-", "raw-text": "This is my first HTC and my first touch screen. Its fast, its well built, its easy to get to grips with and if there are glitches they can be fixed. I am no…"}, {"rating": "4", "user": "-", "raw-text": "Pros: Not a lot. Was talked into buying this over the Nokia N8 by the wizard in the Vodafone store. Massive mistake. I hate that wizard. ... Cons: No manual. Can't…"}, {"rating": "4", "user": "to", "raw-text": "Hey Great phone, set up was a dream especially with the \"Data Transfer\" app (selects your old phone via a list of phones and bluetooth's you critical data over to Desire HD…"}, {"rating": "4", "user": "-", "raw-text": "This phone is great. I have had windows phones and symbian phones in the past. My choice was to wait for windows mobile 7 or go for an android. I chose the…"}, {"rating": "4", "user": "D.", "raw-text": "If you want this HTC Desire HD to be a phone, Blackberry has twice the reception in marginal areas. ie. 3 Bars on my old Blackberry phone here at home but 0 on…"}, {"rating": "4", "user": "-", "raw-text": "Really big 4.3 inch SLCD display.Visible screen content at sunlight!If screen backlight set up ~30% battery life will increases a little bit."}, {"rating": "4", "user": "-", "raw-text": "Pros:Lots of apps Great designHTC SENSEGreat performanceGreat for multimediaSuperfast web browsing Cons:Battery life is a problem Hey I'm here to tell you about the…"}, {"rating": "4", "user": "-", "raw-text": "I have an HTC Desire. After about 2 months, the wi-fi stopped working, I had to send it in for repair - failed circuit board or something along those lines.…"}, {"rating": "4", "user": "-", "raw-text": "I have had the THC Desire HD for about 3 months now and I think its an amazing phone. When I got this phone I was worried about the battery life as some people…"}, {"rating": "4", "user": "-", "raw-text": "Pros: Google Maps Navigation, everything Google ... Cons: Battery life, speaker too low As well as my iPhone4 I have used one of these for a while and I think it's a great…"}, {"rating": "4", "user": "-", "raw-text": "I have owned a DHD for some months now and I have to say that not only do I love this little machine but I love this device more and more as I use it each day in different…"}, {"rating": "4", "user": "-", "raw-text": "had this HTC that has more problems that solutions. The battery is a real mess. Even with a 1600 battery it does not last more than 8 hours. I used to re-charged it…"}, {"rating": "4", "user": "1,", "raw-text": "Very satisfied. Vast improvemt on awful HTC HD7 which is just an entertainment device. Desire HD allows transfers of contacts, calendar & files with PC."}, {"rating": "4", "user": "30,", "raw-text": "This phones extrerior and interior is just so sleek and amazingly perfect. Never had a problem. Stunning graphics and colour, perfect sound. It's probably the…"}, {"rating": "4", "user": "23,", "raw-text": "i dont know if it was just my model but the battery life on my desire hd was awful! loved the phone but being on constant charge and draining in udner 7 hours…"}, {"rating": "4", "user": "-", "raw-text": "This phone is an amazing device. Truly the best I had so far. Fast as hell, screen is huge. The only thing is bloatware... It is full of preinstalled useless…"}, {"rating": "4", "user": "-", "raw-text": "Pros: love this phone because it is big, cant lose it, big text, loud when people call,so easy to use. this is a great phone for people on the go and who have a…"}, {"rating": "4", "user": "-", "raw-text": "This is the best phone I've used ever, so fast and the touch screen is amazing. With the large screen I don't even miss having a built in hardware key board!…"}, {"rating": "4", "user": "rashad", "raw-text": "needs usa 3g , i cant stand having a awsome phone with slow web cause htc hates america.other wise perfect phone for me"}, {"rating": "4", "user": "Richardson", "raw-text": "What a great phone, picture quality is amazing! Challenges the iphone!!"}, {"rating": "4", "user": "-", "raw-text": "The best smartphone I've ever had and the Sense UI is just amazing on this model. Battery life's better than most Android devices and the performance of the…"}, {"rating": "4", "user": "-", "raw-text": "Pros: Straight forward and easy to use android interface, clear display, accurate touchscreen, good tethering for internet access, well laid out phone contacts…"}, {"rating": "4", "user": "-", "raw-text": "The most terrific smartphone to ever come to the world of phones. Brilliance all over."}, {"rating": "4", "user": "-", "raw-text": "I just love my phone .. The Huge screen ... the performance ... the camera .... the apps ... and the interface ... just everything is brilliant !! NO COMPLAINS !!"}, {"rating": "4", "user": "-", "raw-text": "i got the htc desire hd little over a week ago and im still checking out new apps and features, downloading is a dream and the HUGE HD screen is the best ive…"}, {"rating": "4", "user": "-", "raw-text": "fooking excellent :)"}, {"rating": "4", "user": "-", "raw-text": "Excellent phone, a worthy competitor of Apple products."}, {"rating": "4", "user": "-", "raw-text": "I sincerely get 3 days off my DHD with moderate use, having said that I get a day plus with playing videos, calls, texts and browsing and with the brightness"}, {"rating": "4", "user": "-", "raw-text": "Superb.....best of the best smartphone I ever had..."}, {"rating": "4", "user": "Tayo", "raw-text": "I've been using PDA phones now acknowledged as Smartphones for the past four (4) years now, HTC Desire HD is exceptional to all have used so far, and I really…"}, {"rating": "4", "user": "-", "raw-text": "The best mobile phone I have ever used out of series. I recommend this phone for all professionals."}, {"rating": "4", "user": "-", "raw-text": "- power button is placed awkwardly for right-handed people - power button is too recessed - volume rocker is hard to find by feel - volume rocker's tactile feel is…"}, {"rating": "4", "user": "from", "raw-text": "got my hd yesterday have moved all my data from my iphone 4 it is a great phone also have made my txt font bigger which is fantastic just trying to sort my…"}, {"rating": "4", "user": "-", "raw-text": "expensive"}]