[{"rating": "5", "user": "-", "raw-text": "Pros: Everything.Cons: Speaker could be better!I have used all kind of phone including iphones and Nexus, but this one stands out.Hardware: Dual Core processor is the soul of this phone. It has beautiful 4.3\" qHD screen and very accurate and sensible touch screen unlike other Android phones. Camera and video recoding is amazing as well. It has good looks and its light in weight yet solid. I would recommend remove the cover and clean from inside every couple weeks which will keep you phone nice n clean from inside.Software: All the applications run and looks smooth with HD screen and dual core processor. I love the inbuilt Task Manger helps you kill the running task. If you tune this phone well you will get good battery life. It has cool effect when you unlock the phone. Moreover HTC has done good job integrating lot of softwares and making android even cooler. TMOBILE app give you all the updates / info about your account.Only thing i think could be better is speaker!"}, {"rating": "5", "user": "-", "raw-text": "Pros: EverythingCons: Smartphones have shorter battery livesThe HTC Sensation is my first Android phone. I had the HTC HD2 before the Sensation, and there is no comparison. I use my phone for calls, lots of texting, a few apps, skype, and occasional internet browsing.The Sensation and the Android operating system are superior quality. Boot up is fast. Graphics are stunning. Processing is fast. The cameras are superb; I love having a camera in the front and the back. WiFi is easy and fast. 4g is just as great. Touch screen is very responsive. Call quality is good. Internet and video is fast, too; get the Dolphin web browser from the app marketplace, though; don't use the default browser. The interface and menus are intuitive and easy to use. It's super customizable to fit whatever you want to use your phone for and make it whatever you'd like. It's not like any other phone I've had before.Your battery will die quickly (as with any smart phone) if you don't take practical measures to save it. I recommend turning down the backlight, getting a battery saving app (good, free ones to are easy to find in marketplace), and turning off unnecessary WiFi, background data, etc when not necessary. Battery will be an issue with any smartphone, and taking practical steps has made my battery last much, much longer - almost 2 days of normal use.It's fun to use. I love it. I've had no problems with it, and I don't think I would change anything about it. I discover fun new things about"}, {"rating": "5", "user": "-", "raw-text": "Pros: Great speed, call quality, multitasking, photo quality, customizationCons: ringtone volume is low, phone can run pretty hot sometimes .I recently upgraded to the sensation from the blackberry bold 9700. Wow what a difference. The duo core processor makes it easy to takle multiple task on the phone. The camera has a great led flash and takes wonderful pictures. At 8mp its almost as good as a low end point and shoot camera. The video quality is pretty good as well it can get shaky when recording fast movement but other than that its great. The customization of the home screen is wonderful and makes the phone more convenient to your life style.The call quality is very good. The touch screen is very responsive. Also one of the features I was most impressed with was the voice command I know this feature has been on every phone since early 2005 but it works so well on the sensation I had to mention it. The 8gb memory card isn't as large as competition but its sufficient. The front facing camera has much better quality than competition especially better than the my touch 4g and the Iphone 4. Overall this was definitely the best phone I have every purchased and I plan to keep it for a very long time. My favorite thing about this phone is that it comes with free tethering so you can connect your laptop to the t-mobile 4g network when your on the go which is extremely helpful for me because I'm a student."}, {"rating": "5", "user": "-", "raw-text": "Pros: Ergonomics, android, 4.3 screen in a relatively small packageCons: battery life (on par or better then other smartphone), screen brightness and quality (which is very good just not great)I have very little experience with smart phones before i bought this phone. I think this phone is great, i love android so far. it lets me do all kinds of things that apple users can only dream of customization wise. as far as phone quality it is great. very solid build, very fast phone. No reception problems over any other phone i have used on T-mobile (network fault for reception problems, not phone). I have no problems with anything i have tried to run on it. Though ram is a little on the short side though. Wish it had 1gb of ram instead of 768mb that it has. Also the battery life is lacking. I have not gotten anything longer then a day out of one charge. Sometimes have to charge in the middle of the day. I used to get almost a week out of the phone i had previous to this one. From what i have seen from other people and their smart phones that is on par though. So no negative against this phone over other phones. The only small problem that i see with it compared with other phones (namely iPhone 4 and Galaxy s II) is the screen brightness and quality. Not to say that this phone has bad screen quality and brightness by any means, just that it is not on par with its main competitors. Its screen is really good, just not great like the others. The thing i love the most about this"}, {"rating": "5", "user": "-", "raw-text": "Pros: speed of all phone functionsCons: I can't get accessories at Best Buy yet!!! I need a case y'all!!!Smoothest and fastest operating phone I've ever owned. Great screen size and easy keyboard use. The camera and camcorder are also really nice. Love the LCD Flash for use in dim light.Played a Halo-like game with the phone yesterday. Moved as smooth as a console while running message program, and all other background TSRs. So far, I have nothing but positive comments."}, {"rating": "5", "user": "-", "raw-text": "Cons: Price decreased by $100 after I bought it.It's only been a month so I haven't even exploited it to the max. The camera works great for photos, QR codes and other mobile tag codes (just move to focus and it automatically goes to the site). Excellent web capability. I haven't moved my music or Outlook contacts yet - the Google contacts came over automatically on signing in. I had an older BlackBerry and became frustrated with doing things. Typing takes getting used to for those with long fingernails, but the haptic feedback is welcome."}, {"rating": "5", "user": "-", "raw-text": "Pros: EVERYTHINGI LOVE MY PHONE, THIS IS THE ONE TO GET. IT'S SO ADVANCE THAT I THINK IT CAN'T HAVE NOTHING ELSE ADDED BUT ONE THING, DOING DISHES. I ALSO THINK IT IS EASY TO LEARN. YOU CAN GET TO USE THIS PHONE REAL FAST AND CONTINUE TO LEARN THE FEATURES AS YOU GO, I LOVE HOW I AM LEARNING ONE THING ON IT EVERYDAY. GO AHEAD, READ ABOUT THIS PHONE WHEN YOU GOOGLE, IT'S ALL GOOD! EVEN THE FEEL OF IT, IT FEELS GOOD IN YOUR HAND AND ALSO STURDY. OH, MOST IMPORTANT, THE BATTERY ON THIS LAST LONGER THAN OTHER SMARTPHONES, YEAH!"}, {"rating": "5", "user": "-", "raw-text": "I placed my order through Best Buy because of the price. I just realized that Best Buy does NOT include the microSD card! HTC's, T-Mobile's, and all of the other review websites all say the HTC Sensation comes with a 8 GB card. Be prepared to purchase your own card!"}, {"rating": "5", "user": "-", "raw-text": "Pros: light weight for all the great things it doesCons: normal battery smartphone life...I got this phone last month and there is no phone better with the price in a reasonable range,graphics superior to any other phone(Even the Iphone newbie) and very easy to use for any level of smartphone touch screen users. You want the best phone out there...HTC Sensation is your destination!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Ultra Fast, Crystal Clear Resolution....Cons: NOTHINGI am a big crazy cell phone fanatic. I have tried and tested and reviewed all released cell phones and this one is simply outrun the competition. The overall performance of the phone is excellent, screen resolution is crystal crisp clear and processing speed is really fast.This is highly recommended if you are wanting to have the best android phone in the market. You will never be disappointed. HTC have made the Sensation a truly S E N S A T I O N..."}, {"rating": "5", "user": "-", "raw-text": "Pros: SpeedCons: Hmm?I have had most Android phone and I have to say this is by far the best. Its fast, has all the top of the line features. If you are on Tmobile order one today you will love the speed of its dual core and the QHD display is amazing. HTC Sense 3.0 is the icing on the cake."}, {"rating": "5", "user": "-", "raw-text": "The Sensation is a amazing phone this phone is packing a lot of features 1.2 ghz Dual Core processor, 1080p video recording, 8Mp camera, 4.3 inch super LCD qhd screen. 4G, These are top of the line specs and right now is probably the top Android on the market. From my past few days of use with it the battery life is good but if you are a power user than you will want a extended battery. This phone is basically a Evo 3D but without the 3D and the sensation has the 1080p video recording while the 3D only has 720p."}, {"rating": "5", "user": "-", "raw-text": "Cons: very low battery life...come on fix this!Great phone but a HUGE LEARNING curve for my first smartphone. Like holding a small tablet in your palm. Ruggedly built to last!"}, {"rating": "5", "user": "-", "raw-text": "Pros: everythingI love this phone right from the day I bought it. It met my expectation of an android phone as it is my first android phone. It has so many features that is combined into it from videos to 8 MP camera to listening to FM radio, watching TV and Movies and lots of applications on the android market. The display is great. I just love my HTC sense."}, {"rating": "5", "user": "-", "raw-text": "Pros: Camera, Fast processor.Big Screen, battery is better than the other android phonesCons: HTC need to fix Media Speaker, the sound is badI'm smartphone maniac, always changing phones all the times, from Iphone 2g -Iphone 4, samsung Galaxy S, My touch 4G,G2x, all kind Crackberry lol....,all the high tech phone.But SenSation is different. Right now i think sensation is the best phone on the market."}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast, Apps Apps AppsCons: Short battery lifeGet this phone you will love it. It's better than the Iphone."}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast, good battery lifeCons: ummmm.Its my fave HTC phone so far and I have owned MANY of them. Blows the thunderbolt away."}, {"rating": "5", "user": "-", "raw-text": "This is probably the best Android smartphone on the market right now."}]