[{"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; brews quicklyCons: K-cups are expensiveI purchased the Keurig Special Edition Brewing System as a late Christmas present for my husband.  I got a very good deal on it and was so excited to being it home and try it out.  We took it out of the box and plugged it up right away.  The instruction manual is very easy to understand.  It walks you through step by step as to what to do.  The Keurig I purchased came with a sample o 12 K cups to try out the coffee maker with.  After reading through the instructions, the hubby selected his coffee he wanted to try and put the K cup in the machine.  we waited for the display to show now ready and hit the appropriate cup size.  Well, it made such a big mess!  Water spilled out every where.  So we opened up the K cup holder and compared what was there to what we were suppose to have and we figured out that our machine was missing the K cup holder.  I called customer service and they were very helpful and they are sending us a replacement part, free of charge!  Very good customer service."}, {"rating": "5", "user": "-", "raw-text": "Pros: Ease of use; no fuss, no mess clean up; lots of variety in coffee selectionCons: Not an inexpensive coffee maker; K-cups are slightly more expensive per cup of coffeeI purchased this for my wife for Christmas - she had been wanting one for several months - but I think I'm getting as much benefit and enjoyment as she is. It was easy to get brewing, just unpack, plug in, add water and K-cup and go. Gone are the wasted 8- and 10-cup pots when we really only need a couple for the two of us. I think my favorite feature is the clean up: there is no mess, just dispose of the K-cup. We've found that every coffee we like has K-cup options, and the small size and relative low cost of the cups allows us to try new brews without spending much. She also received the adapter that allows you to brew with your own coffee, but we haven't tried that yet."}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Stylish; Easy To UseCons: Limited Cup SizesI drink many cups of coffee every day. My first Keurig was the simple 2 sizes machine. It worked perfectly but I wanted more size choices and advenced features. Gave the machine to daughter and bought the Special Edition. It worked as advertised for a month, then started short cupping. Customer service had me descale and thoroughly clean upper and lower needles. Still short cups. It takes 2 brew cycles to get the correct largest size dispensed. The smallest size seems to work correctly. Haven't had time to follow up with CS, but doubt they will offer much further help. This would be a GREAT product IF it worked as advertised. I may go back to the simple one."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy To Use; Accommodates All Cup Sizes; Multiple Settings; Stylish; Durable; FastThe Keurig B60 is a good overall product for home use. It delivers a good cup of coffee of your choice anytime of the day very quickly. Every once in a while it may deliver the wrong cup size. It is always of a smaller size so no overflows so far."}, {"rating": "5", "user": "-", "raw-text": "This is a nice coffee brewer if you don't mind paying a little more for the cup of coffee. As the only coffee drinker in the house it works nicely for me. The only down side I see to this brewer is that if you have hard water you will need to purchase your water also or clean the mineral build up often. Coffee prices for the machine are from 11.99-18.99 for 18 K-cups unless you find a bargin. If I had to purchase this over again I think I would purchase the smaller Keurig and this one is rather big on my counter.Brew PerformanceIt brews nicely unless you get mineral buildup from using tap waterEase of CleaningOutside cleans up nicely. Inside alittle tougherEase of Use"}, {"rating": "5", "user": "Berry", "raw-text": "Pros: Durable; Fast; Accommodates All Cup Sizes; Stylish; Multiple Settings; Easy To UseCons: NoisyI, personally, love this brewer. We've had it for about 3 years now, and it's been through two moves, no problem. I love K-cups because sometimes I drink a lot of coffee (few times a day, usually when I'm writing), but sometimes I can go weeks without even a cup. With the K-cups, each one is individually sealed, and thus stays fresh, unlike a bag of coffee beans.My only complaint is that it is noisy. I get up in the morning before my mom, and the sound is VERY loud when it fills the tank to boil.Other than that, easy to use, no advance planning involved, removable drip tray allows me to fill the thermos, quick results. Overall a very well designed machine, and worth the money."}, {"rating": "5", "user": "-", "raw-text": "Pros: Quick and easy to useCons: Can be a little costly, but there's options to lower the cost per cup.So I've had the B60 for a month now and it's been a lot of fun. I brought it home and everyone thought I was crazy because I'm not a huge coffee drinker, but I'm a tech geek and BB had a gift card promotion going on, so I picked one up.I've picked up different flavors from all over the place to try them out, funny enough the flavored ones I thought I'd like I don't like as much as plain old coffee. I'm still trying to figure out which I like best. And you don't have to tie yourself to K-cups if you don't want, there's several filter cup devices out there that lets you put in your own grounds to make a cup. It's not quite as \"clean\", in that there's no grounds in the cup but there's some sediment that the wire filter lets through, but as long as you skip that last sip, you're ok and it ends up being a lot cheaper.I've even taken to using it for hot water for cup o' noodles or instant oatmeal.I'm ok with the water reserve size, but I wouldn't want anything smaller. And if you really want to, you can order a larger tank from Keurig for $25."}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Easy To Use; DurableI BOUGHT THE B40 BUT THE BREW WAS WEAK, EVEN ON THE LOWEST SETTING. I LIKE STRONG COFFEE AND I TRIED ALL CUPS FOR STRONGER TASTE TO NO AVAIL. CALLED CUSTOMER SERVICE BUT WAS TOLD I COULD NOT SEND BACK AND REPLACE WITH A B60, WHICH HAS A 5&1/2OZ. CUP SIZE. I NOW BUY THE BIG BAGS FOR MY OLD QUICK DRIP COFFEEMAKER. NOW MY MACHINE JUST SITS. VERY UNHAPPY"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!; K-cups are expensive; expensive; A bit more cost than conventional pots; worsened my coffee addictionWe bought the Keurig because our friends had one and all they did was rave about it. Every time we visited with them they would show it off and rave about how wonderful it was and how easy it is to use. So after weeks of hearing all the rave reviews we decided to get our own. I usually don't drink much coffee, but we bought one anyway because my husband drinks a ton of tea. I did not think I would get much use out of a coffee maker, but because it is so easy I find myself drinking much more coffee and tea than I ever have before.The system is extremely easy to set up and even easier to use. It brews so quickly that I even have to time to brew my coffee if I am running late, which has lead to me drinking even more coffee. The only thing we had a little bit of trouble with it figuring out which of our cups were small, medium, and large but that didn't take us very long. It's not like other coffee makers, because with the Keurig you can make coffee, hot tea, cold teas, and hot chocolate. It's just so simple, fill it with water, stick the K cup in, and then select the size you want to brew. There is no mess, you don't have to add water every single time, and you only make the amount you need with no waste like other coffee pots. Not only is it"}, {"rating": "5", "user": "old", "raw-text": "Pros: Easy To UseCons: FragileAfter just over a year we began to get pieces of black plastic in our cups after use. Today, the piece that supports the upper needle fell out. Now I know where the plastic came from. Must be a special Chinese plastic. Service folks said \"so sorry, out of warranty\". Offered coupon off cost of new one. NOT."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; brews quickly; Looks great on counterCons: expensiveI had eyeing up a Keurig since Thanksgiving. My parents have the big deluxe one and it made a nice cup of hot chocolate. When they went on sale at Christmas, I went for it. I found mine at a big box retailer and, after all the coupons and deals they were offering, paid about $110 for it. I've had it now for 5 months and I love it. It's super easy to use, the Kcups come in a variety of flavors. The machine itself is sleek and modern looking. I don't mind it sitting out on my countertop and the machine doesn't take up that much room either. The 3 amount settings are nice to fit any preference of coffee strength. Personally, I use it to make hot chocolote and spiced chai lattes. I figure, we spend about $12/box of the 18 Kcups vs spending $4 per coffee at coffee houses. It's also great to just brew up hot water for tea or cider. The kids loved having fresh, hot chocolate when they came in from playing outside in the snow over the winter. Now I look forward to having fresh tea during the summer."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; great tasteCons: K-cups are expensive; expensiveI love this Keurig. Its a great product is makes the perfect cup of coffee. With three different siz options, you can find the right size for in the morning, an after dinner drink, and for my grandmother (she likes the small size). Though it takes about 3 minutes to turn on in the morning, it does make the coffee pretty quickly.The variety of coffee flavors can be beat. From many different traditional coffees and non cafinated drinks (hot chocolate or tea), to sweetened coffees and seasonal blends. One great thing is that you can get the pods at many different locations other than the Keruig website. Le Gourmet, Bed Bath and Beyond, Kohls, and BJs have them in stock, just to name a few.The only issue is that once you use it, you dont want to go back to the old coffee maker and the Keurig requires expensive coffee pods! One pack of 16 or 18 can cost as much as $14. But keep your eyes open for sales at Bed Bath and Beyond or Kohls to get them at a discounted price."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; brews quickly; great tasteCons: a bit more expensive but worth it!I am a coffee lover but I do not always make the best cup of coffee which makes it hard to love what I am drinking. But, everytime I make a keurig cup of coffee it is the best cup every. It is always fresh, it brews quickly and it is simple. At first I was hesitant to buy this because of the money but it is well worth every penny. The machine gives you the option to brew regular or strong. The machine also gives you the choice of what size cup you want. I would recommend this product to anyone who wants to be able to make a great cup of coffee fast in the morning or any coffee lover in general. The coffee inserts are cheap and are sold at every grocery store. I have brewed many of my friends cups of coffee and they go out and buy this right away. It is also great that it is a single serve meathod because if you are the only one drinking the coffee, you do not have to brew an enire pot adn the coffee is always fresh!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; brews quickly; great taste; no more large pots of coffee; No WasteCons: a bit more expensive but worth it!My husband LOVES this for his coffee, especially the different varieties available.  I love the hot chocolate, it is low calorie and delicious!  You can brew one right after the other with no taste contamination.  This machine is quick and amazing.  One of the best kitchen products we have purchased. The small size takes up only a minute amount of counter space and the variety of colors will fit with any kitchen decor.  There is a flavor of coffee, tea or hot chocolate that will appeal to any palette and the cost is very reasonable.  There is also the added bonus of the availability to purchase free market, fair trade coffee, benefiting those in third world economies.  This machine pays for itself with no waste, you make each cup when you want it, so they are always fresh and there is never anything to throw away and no \u0093old coffee\u0094 smells in the house.  This is a truly brilliant invention, any coffee lover would adore this machine and the myriad of coffees available to use with this machine, including an attachment which allows you to use your own favorite coffee if you wish.  I highly recommend this machine to anyone who drinks any amount of coffee.."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; great tasteI came about this coffee maker when I was in Kohl's a few weeks ago and I really can't say anything bad about it at all.  I actually had a 30 percent off coupon which helped me save a good amount of money.  What I like about this particular coffee maker is the settings and how I can customize my drink to the right size and the right brew.  The individual pods was something that I was very hesitant about because I have always been one to grind my own beans and make it fresh.  I can't give the pods high enough marks and I am very impressed with the flavor and the aromas that this machine can produce.  Along with it I have purchased coffee pods from the green mountain company as well as gloria jean.  I have also used this brewing system to make great teas from pods which I once again absolutely recommend to any of the people out there who are still using hot water and tea bags.  To all the naysayers out there, this product is the real deal."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great tasteCons: a bit more expensive but worth it!I love this Keurig system. I always use it. Now instead of going out to get coffee, I can be using this to make my morning coffee. And it's not the instant coffee either. Before, I always hate making a cup of coffee for myself because it's a pain just to fill up the coffee beans and filter just to make myself one cup of coffee. But now, I can enjoy the coffee (and it's not the instant coffee) in just a minute or less. It's so convenient and I can adjust whether I want it stronger by changing the cup size. It's just so easy to use and quick. And the best thing is that I can also make Green Tea and other Hot Coco with this as well. Only thing I have to complain about it the cost of the coffee k-cups itself. It is a little too expensive. I wish they are less expensive. Overall they are less expensive than buying coffee outside, but they do taste good like regular coffee and it's just so easy and quick. I wish there is a place for the sugar and cream too."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; great taste; brews quickly; no more large pots of coffeeCons: a bit more expensive but worth it!; Hot Cocoa kcups could be betterI received this coffee maker for Christmas 2010 and absolutely love it! It is stylish, easy to use and makes great coffee, tea, and other hot beverages. It is so easy to use that my 7-year-old can make himself a cup of cocoa with no problem. I love tea and my husband loves his coffee, but we always used to go to a coffee shop because it wasn't worth brewing a whole pot of coffee for a cup or two. Now we can make it at home and we're saving a lot of money and the coffee/tea is always fresh and tasty!The K Cups for this machine are widely available from Target, WalMart, Amazon, etc. If you register your brewer on the Keurig web site, you can get a coupon code for two free boxes of K Cups when you purchase two. Good deal! There is a pretty much endless variety of coffees, teas and even iced beverages.You can also purchase a reusable \"k cup\" to use with your favorite ground coffee. I just received a Solofill but haven't used it yet.Buy it, you won't regret it!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great tasteI have to admit I am not a coffee person, nor did I use to drink it at all.  My husband loves coffee, so we purchased the Keurig B60 Brewer from Sams Club for $129.  It was the best price I could find, which also included the My K-Cup coffee grinds accessory and 60 K-cups.  I was excited to make our first cups after reading all the directions to ensure I didn't burn down the house.  A freshly brewed, designer cup of coffee is available within 2 minutes in an 8 oz., 10 oz., or 12 oz. size of your choice.  I haven't had the brewer long enough to see if there is a buildup due to use, although I see it has a self-cleaning option to remove calcium buildup.  I do enjoy drinking the specialty coffees and making cups for him now that it is so easy to do.  I have found K-cups on Amazon.com and at Bed Bath and Beyond, cheaper than other sites.  I do recommend registering your Keurig online at their website, as they send you a coupon for 10% and free shipping off your next order, which includes 2 free 22 count boxes of coffee.  I would greatly recommend the Keurig B60 Brewer to anyone looking for an easy solution to yummy coffee at a reasonable price and quick speed."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy To Use; Stylish; Durable; Accommodates All Cup Sizes; Multiple SettingsI thought the mine was great. Only after 4 years did we start to have problems. But because I am a club member and purchased online, my brewer was replaced at no cost to me. You don't get that kind of service anywhere else! Great product, great prices."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; single serve; no more large pots of coffee; brews quicklyCons: a bit more expensive but worth it!I just got this for myself for \"Christmas\". ;)  It is such a great buy!!  I make myself coffee every morning, and I hate having to wait for a whole pot, set up for a whole pot, and then only drink 2 glasses.  The Keurig is so simple!  Just turn it on, insert your desired coffee pouch, pick your size and whala- coffee.  I take it to work in my reusable mug, and I chuckle to myself at everyone else that has coffee from the bucks.  It's a little spendy, but I think if you are used to paying for coffee, waiting in line, and driving there...you'll definitely get your money's worth.  I don't have a negatives to say about it.  I still occasionally make myself espresso, but as far as just a cup of joe, I use this predominately.  I know that you can get the coffee cups at Costco, which I think will cut down on cost also.  This is a perfect gift for Christmas.  We are buying my Mother In Law one, 1 gift down. :)"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; great taste; single serve; brews quicklyCons: a bit more expensive but worth it!The Keurig Special Edition Brewing System is so easy to use and assemble.  You simply fill the side pitcher with water, place it back into place and turn on the system.  When it is ready it will read ready to brew.  You then lift the front, put in your kcup and pick the size cup you wish to enjoy.  My system came with a variety pack of different types of coffees, tea and hot chocolate.  I couldnt wait to try them all.  They are all very good.  Most boxes of kcups are readily available at local retailers and can even be ordered online.  I would definitely recommend this to anyone who knows someone who loves coffee. It can even be set to automatically make your cup of coffee in the morning so that when you get up you can just grab your cup.  New flavors are always being introduced and I recently ordered hot apple cider and some cold brew coffees which I cant wait to try.  The price on this system is reasonable.  It averages about 140.  I used a 20 percent off coupon at my local Bed Bath and Beyond when I purchased mine and saved  28 dollars."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; single serve; no more large pots of coffee; brews quickly; tea, coffee or hot chocolate; easy to read display; fun; always a fresh cup of coffee; large variety of flavorsCons: a bit more expensive but worth it!I received a Keurig coffee maker for my birthday and it's the best present I've received in a long time!  No one else in my house likes coffee, so the single serving concept is perfect for me.  I'm not into making fancy coffee either (I save that for Starbucks) so the simplicity of the machine is wonderful.The Keurig SE is very attractive and looks nice on my countertop.  When the machine is turned on, it immediately gets ready to brew the coffee.  All you have to do is insert the k-cup and press the size of cup you want to make.  It takes about 30 seconds to brew a large cup and does not drip once it finishes.  The coffee is nice and hot and there is absolutely no mess to clean up!  It is so easy to use everyone who comes over wants to make their own coffee.  Best of all, everyone can choose their own flavors and the coffee is always fresh.The K-cups are a bit pricey, but you can find great deals on them online.  They come in a lot of various flavors and you can also get hot chocolate and teas.  If you prefer to save money, the Keurig also has a coffee filter you can buy so you can brew your own coffee.  Overall, I highly recommend this machine to any coffee lover!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; single serve; no more large pots of coffee; brews quickly; tea, coffee or hot chocolate; easy to read display; funCons: a bit more expensive but worth it!; worsened my coffee addictionThe Keurig B60 was a great addition to our kitchen. The sleek and modern design fits right in with our stainless steel appliances. The machine produces excellent coffee, taking less than one minute to produce an average size cup of coffee. The temperature can be set manually so ensure that the coffee is neither \"too hot\" or \"too cold\" for your personal preference. The machine is very quiet when it brews (unlike my parent's older model Tassimo). The Keurig cups can be purchased almost anywhere - from Macy's and JcPenneys in the mall to Target and Bed Bath and Beyond. You get about 18 cups for $10 - not bad in a world of $2 cups of coffee! For fellow coupon clippers - Bed Bath and Beyond gives you the best deal because you can get 20% off with a coupon (or buy two and use a $5 off $20!)The only setback I can think of is that the system can get a little dirty on the inside after a week or two of coffee brewing, so remember to run a couple of hot-water-only runs to clean it from the inside out. Overall, it is a convenient and impressive machine and I can imagine getting through the morning without it!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; no more large pots of coffee; single serve; brews quickly; easy to read display; tea, coffee or hot chocolate; funCons: A bit more cost than conventional potsAfter going through many smaller coffee pots- and dumping out loads of unused coffee each day- we finally decided to listen to the hype and give the Keurig a try.We purchased it for a great price. It was super easy to set up and get started using it right away. The directions were clean and consise and the machine even came with a small sampler pack of K-cups. After rinsing/cleaning, we filled the tank up with water and after just a moment or so, it was ready to brew. Insert a K-cup and instanly you can hear it brewing and smell the delicious scent of a fresh cup of coffee.I love the abilty to choose your cup size and make as many cups as you need or want instead of a whole pot.There are so many varieties of K-cups out there and you can save money buying them in bulk once you find some favorite flavors. Note- you can also purchase an optional \"my k-cup\" which is a reusable cup you can fill up with any ground coffee."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; no more large pots of coffee; single serveCons: K-cups are expensive; a bit more expensive but worth it!We love this coffee maker - a keurig is definitely the way to go!  We had always been very happy with our Bunn- drip maker, but when we recieved the keurig as a gift it was no looking back!  We have since given it as a gift to others now as well.  The coffee tastes so fresh and delicious and it is  so easy to make a cup of coffee at any time!  For one or more! This is definitely cheaper than buying cups of coffee at your local coffee shop, but for others going from a drip maker to this, the cost is higher, which is one drawback.  We have found the make it yourself k-cups to work well.  They aren't as easy to use as the ready to go ones obviously, but if cost is a concern, that is a nice option to have!  To make those work best, we've found the grind of coffee to be very important.. usually the fine grind works well to give a deep, full flavor.  The keurig is fairly easy to clean as well and looks stylish.  You won't be sorry getting one of these!"}, {"rating": "5", "user": "the", "raw-text": "Pros: Durable; Stylish; Multiple Settings; Accommodates All Cup Sizes; Easy To UseAs a avid coffee drinker I demand a fresh cup every time. But with the conventional coffee makers you make a whole pot to get one cup of fresh coffee. After years of growing tired of wasting coffee and time to brew I set out to find the perfect solution. I will be honest when I found the Keurig I fell in love however I was put off by the price as most coffee makers are in the $40-$90 range. But I weighed the features and it was a winner. My wife and I love it, fresh coffee anytime. Brewing over ice for a iced coffee is priceless. Plus I know I am on to something when my companies coffee vendor replaced our Bunn with a Keurig."}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Accommodates All Cup Sizes; Stylish; Easy To UseCons: Hard To Clean; Long cleaning processLove the machine. However, after a few months the machine did not brew full cups, no matter what size and the cleaning process did not make a significant improvement."}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Multiple Settings; Accommodates All Cup Sizes; Durable; Easy To Use; FastCons: NoisySo many flavors, so little time. I use my Keurig everyday, sometimes 2 or 3 times a day."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to set up and useCons: funny taste, expensiveI love using mine. It's so fast and I love the 3 options for cup size. My only complaint is for the first little while there is a funny taste due to the filter or something. It does go away and makes a fantastic cup of coffee/tea or it's great for when you need a cup of hot water. Highly recommended!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to set up, great valueit's perfect. perfect coffee, and with the partnership of being able to use the reusable coffee filter; it's the perfect kitchen coffee maker."}, {"rating": "5", "user": "-", "raw-text": "Pros: Very fast heat time, no muss no fuss.The Keurig individual brewing unit has been a real plus for my family. Now we can choose our own individual likes of tea, coffee, cider, hot chocolate, etc. and even, if we choose, use our own mix with the filter assembly and quickly get a cup of 'whatever'.With over 200 varieties of K-cups on the market and wide availability, it is easy to find a per-cup bargain out there. The unit is fast, efficient, and easy to setup and use. Highly recommended."}, {"rating": "5", "user": "-", "raw-text": "I've had my Keurig for about one year now and I love it.Brew PerformanceBrews really quickly and gives me the option to select 6, 8, or 10 ounces of coffee.Ease of CleaningIt's pretty much maintenance free actually. Just wash and rinse out the water reservoir and that's about it. You're supposed to clarify the machine like once a month or so using white vinegar and that's kind of a pain. We have very hard water here so I actually ruined my previous Keurig by using tap water so it is important to clean it every few weeks with vinegar.Ease of Use"}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Multiple Settings; Fast; Easy To Use; Durable; Accommodates All Cup SizesWe use our keurig everyday. We have saved so much money by not going to the expensive coffee shops as much. We have fun buying different flavored coffee and different flavored creamers to fit our mood."}, {"rating": "5", "user": "-", "raw-text": "Pros: Durable; Accommodates All Cup Sizes; Fast; Easy To Use; Stylish; Multiple SettingsWe love our Keurig Special Edition. We received it as a wedding gift (registered for one after seeing how much my parents loved theirs!)and use it every day. It's very easy to use, easy to clean, and quick. I wouldn't ever go back to a traditional coffeemaker."}, {"rating": "5", "user": "drinker", "raw-text": "Pros: Timer; Fast; Easy To UseCons: Limited Cup SizesLove this machine. So quick and easy. Only wish it brewed a larger cup size. If it brewed a larger cup, I would give it 5 stars."}, {"rating": "5", "user": "-", "raw-text": "I am single... I swore I would never buy one of these machines. I happened to watch the show last week and this was a special deal and I got sucked into all the hype. After taking awhile to get out of the box and read directions....I had the best tasting cup of coffee.When I get up I turn on my computer and before my computer is booted up my coffee is ready to drink. It did come with My-Kcup and I just tried it and I had a wonderful cup of coffee. I would suggest if using My-Kcup be sure and change the brew size. Same with the hot chocolate...MERRY CHRISTMAS to me!"}, {"rating": "5", "user": "-", "raw-text": "If you love varity then this is the coffee maker for you!Brew Performanceso quick and easy!Ease of Cleaningsmall machine easy to clean!Ease of Use"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy To Use; Accommodates All Cup Sizes; Stylish; Multiple SettingsCons: FragileBest coffe brewer we've ever owned. Convenient, no wasted coffee. Only problem is that after about a month, the cup size starts dropping down to about half a cup for the 10 oz setting. This is our second one after the first was replaced by the retailer. This one is going back and we are going to try a B-70. BTW, we have a R/O water dispenser and that is what we use, so filters and calcification should not be the issue after onlu 30 days or so."}, {"rating": "5", "user": "-", "raw-text": "Buy K-cups when they are on sale and/or with coupons. Buy couple boxes at a time. So much fun buying the different varieties.Brew PerformanceBrews a cup of coffee, cup of tea, cup of hot chocolate or ice tea in less than a minute and perfect everytime.Ease of CleaningThe best part of all is there is nothing to clean. Wipe down the Keurig every so often. No more cleaning a coffee pot after every pot.Ease of Use"}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Fast; Easy To UseThis has been the answer to our prayers in the morning. We each have our own types of coffee we like. I like a cup in the afternoon when I come home from work. We bought it in August. So far...so good!!"}, {"rating": "5", "user": "-", "raw-text": "This Keurig coffee maker is great. First one up in the morning gets to push one button to heat the water; then, we pick out our desired taste and/or flavor from a multitude of K-Cup varieties. In less than a minute we are sipping hot delicious coffee at our breakfast table. I could not be without this machine ever. We think so highly of our Keurig that we bought a second one for a good friend; so, when we go to their place, we will have a cup of our beloved Keurig coffee. Our friends are captivated by it also. It is so easy to use and enjoy that anyone can enjoy these modern conveniences now; because, the cost is not prohibitive. They brew hot tea and hot chocolate as a bonus. These would make terrific Christmas gifts and/or the boxes of K-Cups for those that have the already have one. Good deals at O.Co."}, {"rating": "5", "user": "-", "raw-text": "i use to drink almost 2 pots of coffee a day thats \"24\" cups! but i decided to buy a keurig and it not only makes some very tasty coffee it is a easy clean up! i only now drink 2-3 cups a day not because i wanted to cut down or because of the price of k cups but because the coffee stays hot its fresh and is not sitting their all day so it gets the \"burnt\" taste. the only con is the fact that k-cups are a little pricy. one can purchace the interchangeable filter system as did i but it is not as \"convient\" as the k cups them selves. i would recomend this product to any one. what is also awesome about this is that you can fill a glass full of ice and if you have purchaced a \"strong brewed\" or a ice coffee k cup for those that like ice coffee it is brewed perfect and fresh! k cups come in many different brands of brewers and also comes in different flavors like the classic french vanilla and hazlenut. around the holidays they have come out with gingerbread and my personal favorite pumpkin spice. not only does the keurig brew coffee but it is excellent when it comes to brewing teas for your friend whom likes a cup of hot tea. for the fall i think that it is awesome the have k cups of cider for hot apple cider. also in the winter making hot cocoa (especially convient for those whom have little children) after playing out side its easy as pie to pop in a cocoa cup and brew some fresh hot cocoa. i know i have 2 boys and 4 kids in the neighbor hood that like to come over for hot cocoa"}, {"rating": "5", "user": "-", "raw-text": "I love this Keurig. It was silly to make a pot of coffee to drink only two cups. I feel like this is way better.It solved one of our problems. My husband always gets up a couple hours earlier than I do. By that time the coffee in the coffee pot was old and cooled. For us, it's a solution to that little annoying problem. Looks great in the kitchen, was easy to program and I have no worries, because O.Co always stands by their products. They know that if I have a problem with the cofee maker, that I'll be contacting them. And they are always happy to oblige. That my friends, is worth it's weight in gold! ..."}, {"rating": "5", "user": "Hartmans", "raw-text": "Pros: Durable; Stylish; Multiple Settings; Easy To Use; FastI absolutely love this keurig!! I have had the same one for 4 years and it hasn't skipped a beat. I drink at least 4 cups of coffee every day and it's still going strong. Most of my family has also switched over to the keurig. I will never ever go back to a regular coffee pot! One of the best purchases I've ever made. you should deffinately switch if you haven't already."}, {"rating": "5", "user": "-", "raw-text": "Be prepared to stock up in large amounts when the kcups go on sale or are a deal.Brew PerformanceGreat job with a perfect brew each time!Ease of CleaningWith hands full at work and at home I can enjoy my coffee without the hassle of a messEase of Use"}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Accommodates All Cup Sizes; Easy To Use; FastOh wow! I just bought this brewer and have never owned one before. Unbelievable! So easy to use and I bought the Chai Latte...taste to me is exactly as it is at Starbucks! cannot wait to try other flavors/coffee/tea's! This is my new best friend!"}, {"rating": "5", "user": "-", "raw-text": "I just purchased this Keurig on sale last week and absolutely love it, very easy to use, and love the different size cups you choose for brewing. You can easily see the water level and also tells you when the water level is low in case you forget to check!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: VERY easy to use, saves avid-coffee-drinkers money, saves time!Cons: Small water reservoirLIKES:*Delicious coffee: I've always enjoyed Caribou/Starbucks and other coffee-house coffees, but even when I buy their beans, my cups of coffee at home never tasted quite right! However, with the Keurig, I get THE perfect cup of coffee EVERY time. My boyfriend and I absolutely LOVE it!!!*Saves money: If you are an avid \"big name coffee-house\"-goer and are looking for ways to cut back on your budget, the Keurig is most definitely the way to go! It's a little spendy upfront, sure. But, I know I'm saving at least $100/month with this thing!*Variety: I like that there is such a huge selection of coffees to try (not even just what you find in the store, but ordering through Keurig).*Convenient/multiple uses: I like that you can even just brew a cup of hot water for any use (I specifically use it to use w/my tea that doesn't come in Keurig-variety)."}, {"rating": "5", "user": "-", "raw-text": "Pros: Accommodates All Cup Sizes; Stylish; Durable; Easy To Use; Multiple SettingsI love it so much that I took it with me on 2 local vacations!!! Suggestion: Make a small traveling size with a carrier bag that could be transported on planes!!??"}, {"rating": "5", "user": "-", "raw-text": "I yearned for a Keurig coffee maker, but given the recession and my trusty Mr. Coffee which was still making pretty good coffee, I just put it on a wish list for when Mr. Coffee blew a gasket.  He had already been through three pots and three filters so how much longer would he hold on?  Well, Mr. Coffee has been put on indefinite leave because I got a Keurig as a gift.  The Keurig makes excellent coffee.  There are numerous types of K-Cups and great reviews out there so you can pick the blend you like best.  Even Target and the grocery stores are now carrying K-cups.  I love that I can make 1 cup at a time and it is fresh.  I love the easy to fill water dispenser.  I love not washing the coffee pot.  I love being able to use the mini filter for my favorite flavored coffees.I could use some design revisons to make this coffee maker even better.There are three cup size settings.  They are unrealistic.  If you love a LARGE cup of coffee or are filling a travel mug you are going to have to run the system twice over and you are going to need to come up with the right size configuration so you don't overfill the cup.  A large cup of coffee ought to be more than 8 oz..  The smallest size option would not even fill a small china cup from my \"good\" dishes.Even removing the drip tray won't get a tall, reusable travel mug comfortably under the spout.  My husband has the coffee drip into a wide mouth measuring cup and then pours it into his mug.  This double step takes away"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to use; stylish; versatileI love the Keurig B60 machine!  It is easy and simple to use and looks very stylish as well.  We just recently purchased or Keurig and cannot wait to have friends or family over to try it as well.  There are so many choices of coffee, tea, cocoa, and even chai latte K-cups to use with it.  The K-cups can be a little expensive, however there are often sales and ways to get a good deal.  The my K-cup is another great option for people who enjoy a specific type of coffee or tea and want to use it in the Keurig.  I love having the seperate water reservoir which allows you to make several cups before refilling it.  I have read some reviews where it is noted as being a \"noisy\" machine, however it is not THAT noisy and does not bother me at all.  Most coffee makers make some noise anyway.  I highly recommend the Keurig to anyone who doesn't want to spend much time or hastle preparing a good cup of coffee."}, {"rating": "5", "user": "-", "raw-text": "I had an Keurig brewer for about 18 months. The last 6 months I had to finish heating the coffee in the microwave because it did not get hot enough. Then the cup size would change and I could not get a large cup out of it. Then after a power outage it would not work. It would not even ligh up. There was no reset switch on it. I saved it and someday I might try to fix it.I bought this brewer to replace the other one. Right off the bat the temp is not working right. Also the size of a cup is already small and can not be changed. When two cups of water are run thru it turns out two watery. I love the concept but with shipping and taxs etc.this one cost me $175.. Least I say I am not happy and if I could ever get one to work the way it is supposed to I would be happy. I have over $350 invested and nothing works right. The cost of the coffee cups is very expensive but because I am only one person it works best for me. The next single brewing system I buy will be something other than a Keurig."}, {"rating": "5", "user": "-", "raw-text": "The Keurig is the most simple to use coffee maker and it's fast. Very little clean up. Great value for someone who drinks coffee everyday. I would highly recommend this product and for anyone who has never used a Keurig, you won't regret purchasing it. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Clean and simple design. Consistent brewing which is it's #1 feature.Cons: The sound can be rather loud but really isn't a problem. K-cups are a bit pricey for a cup of coffee compared to buying ground or beans. You are somewhat limited in brands that make K-cups but most have good types to cater to most tastes. They still are not as good a your own fresh grind IMO.I have had mine now for a year and it is used as much as my stove. I absolutely love it and won't go back to another coffee maker. Mine came with an K- cup type insert that allows me to use my own grinds and that is the way to go if you want to get the absolute best cup of coffee. I haven't had a pre-packaged K-Cup that compares as of yet. The maker itself though is wonderful and is well worth the price."}, {"rating": "5", "user": "-", "raw-text": "Pros: Simple to use with no wasting coffee.Cons: Does not brew proper amount of coffee per size cup.Wanted this type of coffee maker for quite a while. Very disappointed that it does not brew the size cup it says in specs. I called customer support and they told me to run through three cycles each cup size to recalibrate, worked after that until next morning. Still brews about 3 oz. below the pecs for large cup. Have to run two cycles for each k-cup to get one."}, {"rating": "5", "user": "-", "raw-text": "This is the third Keurig B60 that I've purchased - the first for home, the second for my daughter, and this one for my office. Obviously I'm pleased with the product and the affordability is a bonus. I had the occasion to deal with the customer service department and found them to be EXTREMELY helpful, kind and knowledgeable. ..."}, {"rating": "5", "user": "Mike", "raw-text": "Pros: Fast; Accommodates All Cup Sizes; Easy To Use; Multiple Settings; Stylish; DurableWe went through 2 of the Elite model which failed after a few weeks. It wouldn't fill a cup after filling the reservoir. You had to unplug it and reboot it to get it to work. We upgraded to the Special Edition and have not had that problem since. One caution: We stopped removing the reservoir to refill it. Instead we use a separate pitcher. (We found a stylish glass one that we leave on the counter.)"}, {"rating": "5", "user": "-", "raw-text": "Pros: Fresh coffee for an avid coffee drinkerCons: Large cup sizes means weak coffeeThis coffee maker is what it is...A single brew coffee maker. That's great so you aren't making more than is neccessary but you could also make about 2-3 cups worth as well in a regular coffee maker for a fraction of the cost, doing about the same thing if not better and more to your liking. I say this because most travel cups are approx 12-16 ounces. 8 oz = 1 cup. Now this unit only goes up to 9.25 oz (Says 10 oz on the specs) which is supposed to be a Large Cup/Mug. My 'at home' mugs only fill to a little more than 2/3 cup with the large mug setting. Also the other cup sizes state 6 oz (actual 5.25 oz) and 8 oz (actual 7.25 oz). So if you want to fill that 16 oz travel cup and you selected the medium mug setting to be paired with the small mug setting (7.25+5.25=12.5 oz...otherwise the other combos will overfill your 16 oz mug especially when you add cream/sugar), you have to lift the handle and drop it again (after you already brewed a first time) to reset the unit (so it thinks you dropped another k-cup inside) and rerun the brew cycle with the previously used k-cup. Consequences become: you ending up with a not so strong, filled to the top, cup of coffee. It is somewhat irritating at first due to the price. I could've bought the next model up, but an extra $30 did not make two extra cup sizes seem all that important while I could conduct some simple math when brewing. A smaller (4 oz) cup size"}, {"rating": "5", "user": "B.", "raw-text": "Pros: Multiple Settings; Easy To Use; Fast; Accommodates All Cup Sizes; Durable; StylishPurchased my Keurig B60 in February 2011, have been very pleased. Use numerous times daily. The coffee is wonderful...quick and easy, especially in the mornings.My best purchase.Recently tried the ice tea..pretty good"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy To Use; Multiple Settings; Stylish; DurableCons: Limited Cup SizesWhen I read the box it stated that you could brew a travel mug. When I make the largest mug size (out of 3 choices) it fills my mug 3/4 of the way. It does not fill a travel mug. I wish I would have upgraded to the Platinum Model and that one offers 5 size choices and maybe it would fill a travel mug or even a regular sized mug completely. I tried adding a small cup size to fill the travel mug but it overflowed. So basically the large brew size doesn't fill it and I am a little disappointed in this.Also I should have received the K-cup converter where you could brew your own. I had to spend another $15.00 for this accessory. Oh well.....but I highly recommend the Platinum model over the Special Edition."}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Accommodates All Cup Sizes; Stylish; Durable; Easy To UseBoth my husband and I use our Keurig every day. We've had it for just over 1 year and love it. Before purchasing, I researched all the different single cup brewers and single cup brewers that allow for expresso, cappuccino, etc. on the market by reading online and reading the boxes at stores. We looked at ease of use, features, quality, value, coffee variety, convenience and practicality. We also did not want to be limited by a manufacturers pods and wanted good quality coffee. The Keurig machines seemed to fulfill all our requirements and I am happy to report that it has not let us down.The Keurig makes it so easy to have and serve coffee. Everyone drinking can have a different flavor if desired. I had guests over during the holidays and some wanted caffeine, some wanted decaf. I was able to fulfill everyone's coffee desires quickly w/o missing a beat.The Keurig is adapatable to non-K-Cup coffee by using the \"My K-Cup\" adapter. You can use regular coffee grounds in the Keurig machine with the adapter so you can enjoy other coffee you may already have on hand. Contrary to what others say, the adapter is so easy to clean. The adapter is much easier to clean than a traditional coffee maker. Just dump the grounds and rinse the 3 parts. How hard is that? You can compost the grounds by using it in your garden. My mom, who also has a Keurig, goes to the extent of opening up the used K-Cups and dumps the"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy To Use; Accommodates All Cup Sizes; Multiple SettingsMade 1-2 cups per day at most and have gone through 2 machines. The first died within 6 months which Keurig graciously and quickly replaced at no cost. However, that replacement machine only lasted exactly 13 months (one month over the cover warranty period); just completely stopped brewing like the last. Used only distilled water on both machines and descalded every 3-4 months regardless. I absolutely loved it while it worked, but am hestitant to invest in another considering history has proven it's not built to last. Disappointed to say the least."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; tea, coffee or hot chocolate; no clean-up; easyCons: a bit more expensive but worth it!Our family received this Keurig Brewing system as a wonderful christmas present last year and I am loving it. It is soooo easy to use, no more fussing with beans and big mugs, the k- cups are soo convienient and yummmy. This brewer looks complicated but it is 100% dummy proof, very easy to use and quite easy to fall in love with. the single serve is a wonderful thing because it is less wasteful. clean up is quick and easy. the unit and The k-cups are a tad on the expensive side but I would say that it is worth the price paid because the quality is that great. I would recommed to all coffee and hot cocoa lovers, it can be perfect for an office setting as well as at home, all the flavor choices are also great"}, {"rating": "5", "user": "-", "raw-text": "The Kerurig b60 Special edition brews on mean cup of coffee. I did a lot of research regarding exactly which coffee maker I wanted to buy with my limited amount of money. It was between the Keurig systems, Tassimo and Senso. I wanted something that not only worked well, but was sexy looking too. I went with this brand because it seemed more durable, powerful and overall better looking than the other brands. It also seemed to offer the largest varieties of drinks. One of the biggest advantages of this brand is customer service. What good is a product that has aweful customer service? I've only needed to call once, but they were there and ready to answer my questions. I found out later they are actually open 24/7 for customer support. How many home appliance companies can say that? While this isn't a cheap machine, in the long run you want to spend a bit more since you want the thing to last. The cups themselves are also rather pricey, but if you keep a look out for sales, you can usually pick them up cheap from Kohls."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great tasteCons: a bit more expensive but worth it!; expensiveThis thing is just godly! In the morning I'm like a grizzly bear before my coffee. My old coffee maker was a pain in the butt to get working, but the Keurig Brewing System is easy. Boom! Coffee is done in under a minute's time! It's in my cup and I'm walking out the door!It's easy to use and the coffee is great. The coffee serves single cups so it can be a bit annoying when you have a lot of guests over, but hey, it's probably less time than letting a whole pot warm up.Now this thing is really expensive. I've seen these things go anywhere from 129 to 150. I got it as a gift so I got to reap the benefits without breaking the bank. In my opinion, if you already have a coffee machine you're satisfied with, there's really no reason to run out to the bank to get this one. But if you're looking to buy your first coffee machine, go crazy, spend a little, and you'll see where that money went."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!; K-cups are expensiveMy wife bought this for me as a gift and I absolutely love this machine! The Keurig Special Edition Brewing System is so awesome. I love that I can make any type of drink I want in just a few seconds. This machine is so easy to use. Basically, you insert a KCup and push a button, what could be simpler? This is also a big help to my wife as she doesn't have to make me espresso with a complicated machine every morning any more. This is great because there are no messes to have to clean up. While this is an expensive machine, I believe it's totally worth the price. This machine offers so many options and will most definitely last a really long time. The K Cups are also a bit expensive, but occassionally my wife can find coupons, which helps. Overall, a great appliance!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!; K-cups are expensive; expensiveI am not a coffee person in general but I love the Keurig Special Edition Brewing System B60. My husband got it as a present last Christmas and we have been so happy with the Keurig Special Edition Brewing System B60. I don't have to brew whole big pots of coffee just have most of it go to waste. It is very easy to use and works quickly. The coffee taste so good that I even like it which is saying a lot. The cups are more expensive but worth it in my opinion. The Keurig Special Edition Brewing System B60 does cost more than traditional coffee pots but makes a great gift. I'm glad we didn't have to spend the money on the Keurig Special Edition Brewing System B60 but get to enjoy the benifits. I do wish you could use it more easily for things like hot chocolate or tea. All in all I am so glad we got the Keurig Special Edition Brewing System B60. I would buy the Keurig Special Edition Brewing System B60 again in a heartbeat if ours broke."}, {"rating": "5", "user": "-", "raw-text": "I got the Keurig for my husband to make the mornings a little bit easier. But, I think I use it more than him. I love it. It's very simple to use, and brews fairly quick. The K cups taste great, and they have a lot of variety. I haven't tried any of the Hot Cocoa but all my girl friends tell me they are horrid. The only down side is it's a bit expensive, I waited until it went on sale and I had a store coupon, or I probably wouldn't have bought it. Also the K-cups are a bit pricey as well, and they don't sell them at my local grocery, So I have to drive to a futher grocery store to get them. Other than the price, It's perfect. I would recommend it to any coffee fan, or if you need to save some time in the mornings. Great product!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy-to-use; your favorite coffee, in a k-cup!; inexpensive; Every cup is freshCons: have to rig it yourselfIf i had reviewed this the first time I used it, i would have given it a negative if that were possible. I have the Keurig special edition and apparently it was not meant to work with this machine. If it were not for the reusable filter, I would probably not use the machine because of the cost of the K-cups. When I would try to use it, water would go everywhere! I was so frustrated. So of course like I do with everything else I cannot figure out, I googled it, and apparently everyone has had this problem. So one person (who I consider a genius) figured maybe if I have something holding it up tight it would not leak. So they recommended using a hair tye like the ones women use to pull their hair in a ponytail and put it around the top which will cause it to be up more and seal it. So me thinking there is no way this is going to work, I tried it. And voila! Have never had a problem with leaking since. You would think Keurig could fix this problem, but of course they wont. I fill the eintire filter up with coffee grounds then brew the large size and the small size, and it makes a PERFECT cup of coffee for me. I seriously could not live without this!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!Okay, so these ARE a little more expensive than regular coffee makers and the k-cups to go with them are also a little pricier--however, both are WELL worth the money if you are trying to make a decision, go for it! The individual k-cups are sealed individually which gives each cup of coffee an amazing and really FRESH taste compared to a regular machine! The coffee also brews veryy quickly! I also love that you can make ONE cup and make it whatever size you would like as well. This particular machine has 3 size settings, however each model is a little different. I personally love that I can make just one cup and don't have to waste the rest of the pot as with a regular machine, because I only have one cup in the morning!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quicklyCons: small brew sizeI own two different Keurig machine. I own this one and the Keurig Mini Brewer machine. The B60 machine brews much faster and holds a decent sized water receptacle that will contain enough water for about 8-10 coffes. It's utilization and cleaning is simple and intuitive: raise the silver lever, put the cup in, drop the lever, brew, remove cup, start over. No more messing around with filters... it is so convenient!A couple downsides. First, this particular machines brews very small cups even when pressing the large cup button. It brews less coffee than my \"mini brewer\" using the same cups. Not sure why, and I've observed this on several B60 brewers. Second, you have to keep in mind that the convenience of k-cups is expensive..."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; brews quickly; great tasteCons: a bit more expensive but worth it!; K-cups are expensive; worsened my coffee addictionThe Keurig B60 is a great coffee maker for big coffee drinkers but maybe even better for people who don't drink an enormous amount of coffee. It's extremely easy to use; you turn it on, wait until the screen says \"ready to brew\", pop in your favorite k-cup, and pick which size coffee you want. It's great for my family as we only drink 1-2 cups a day so we don't have to make an entire pot and we still get fresh brewed coffee in every cup. We've had the brewer for about 4 or 5 months and it's been working well. There was a day or two where, for some reason, the top needle was tearing hole bigger than normal but after cleaning out the inside, it was fine. After about 3 months it seemed to start to short-cup for all the sizes but running a couple cycles without a k-cup seemed to fix that. Overall, this a great machine for anyone because you get a fresh cup of coffee everytime no matter how much coffee you drink."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quickCons: K-cups are expensive; A bit more cost than conventional pots; expensiveWe bought the Keurig Special Edition Brewing System B60 for my mom as a Mother's Day present. Little did we know that we would use it as much as her when we came to visit. The Keurig Special Edition Brewing System B60 is very easy to use and there is virtually no clean up when you are done. The drink goes right into your cup, so there is no transferring from a pot to a cup, lessening the clean up. The Keurig Special Edition Brewing System B60 is more pricey than a tradtional coffee pot, but it was worth the added cost. Mom like chi tea, and you can guy kcups for that, adding to the value in her eyes. This is a greta gift for someone who just drinks the occasional cup. The Keurig Special Edition Brewing System B60 is more than just hype - it's a great investment!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to useCons: a bit more expensive but worth it!This thing is absolutely amazing! It has saved me so much time in my mornings and is beyond convenient. It's like having my own little coffee shop in my kitchen. Not only is it convenient it is also very versatile. You may wonder how a coffee maker be versatile since it well, makes coffee. But with Keurig's seemingly millions of varieties of coffees and other drinks I can make anything that I desire to fulfill my beverage desire at the time. But this thing is SO fast and allows me those few extra precious minutes of sleep that I so desire in the morning since I can just pop a K-cup into this thing and magically my coffee or hot chocolate or whatever comes out steaming hot and delicious. The only issue I have with it though is that purchasing all those K-cups can pile up in cost."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; no more large pots of coffeeCons: worsened my coffee addiction; a bit more expensive but worth it!I just love the Keurig B60 Specail Edition coffee maker! This was the best birthday gift I have recieved in a very long time. I no longer have to clean dirty filters that i forgot to take out the day before or feel bad wasting a cup or two of left over coffee in the pot. The Keurig makes my rushing morning a little easier and because it is so easy and fast (if you leave it on), I don't have to worry about not getting my big cup of joe on my way out the door. Being able to just put my travel mug there, pop in a k-cup and go is a big time saver. Having all the different varieties of coffee and teas is a plus as well. When i have people over, it is a good feeling to be able to give my friends and family what they want. The Keurig offers something for everyone. I can't imagine not having one in my kitchen! Everyone who is a daily coffee or tea drinker, needs to get one. The only downside is that I feel that I am always filling the resevoir up with 'bottled' water. Small price to pay."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy To Use; Durable; Stylish; Multiple Settings; Accommodates All Cup SizesI have had mine for over two years now and it is still working perfectly. Makes a great cup of coffee. Everyone in the household enjoys it. So convenient."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy-to-use; your favorite coffee, in a k-cup!; inexpensive; Every cup is fresh; better for the environmentCons: frequent washing required; adjustment to brewer is necessaryI received a Keurig Elite brewer for Christmas and one of these reusable filters as a stocking stuffer! I have to admit that the first couple of times I tried to use it were definitely NOT successful. The brewer would spew water and coffee grounds all over my kitchen counter as well as into the cup. I, personally, am not into \"crunchy coffee\". There is nothing in the instructions for the brewer or the My K-cup to address this problem; however, I did some research by looking up other customer reviews and found the little secret. There is a rubber gasket inside the brewer that has to be slid down just a bit to accomodate the reusable filter cup and form a proper seal to prevent the water from getting out. I made this adjustment and have never had a problem since! It is definitely more cost effective to use this product with your own ground coffee rather than the disposable k-cups. I do think that Keurig should either make a design adjustment to the brewer or the My K-cup to correct this issue, though. I would also recommend to any that plan to use this frequently that you consider purchasing the 2 pack of additional filter baskets so that you are able to make multiple cups without having to clean the filter after each use."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; brews quickly; great tasteCons: a bit more expensive but worth it!; K-cups are expensiveThe Keurig B60 is a top-of-the-line system for coffee-making. Many people have had coffee makers in their lives, and I was one of the, but nothing really compares at all to the Keurig B60. It stands shoulders apart from any other coffee maker, even others in the Keurig line. First off, this coffee maker is extremely intuitive and easy to use. It brews your coffee evenly and quickly, and, most importantly, the coffee itself tastes absolutely great. The downsides really are the price and the single serving (although that's not a downside for everyone). You will have to shell out some money for the coffee maker and the K-Cups over time, but when you consider how much the same coffee would cost at any shop or cafe, you will be glad you did. I would definitely recommend this coffee maker - it is spectacular!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; great tasteCons: a bit more expensive but worth it!The Kuerig B60 is a device worth owning for coffee lovers. It is an easy to use, sleek, and high-quality device. It offers 1-cup coffee soultions for the early morning riser or the weekend sipper.If you haven't used a Kuerig before, it utilizes small coffee portion called \"K-cups\" (purchased seperately from Bed Bath and Beyond, Target, Kuerig's webiste etc) and creates a small (teacup size), medium, or large (12 oz cup) for each k-cup utlized. The K cups run about 50 cents each, depending on where you buy, and usually come in boxes of 18, 24, or even 50. Brands for k-cups include Green Mountain Coffee, Donut House, Gloria Jean's and other reputable coffee makers, and the k-cups branch out to not just coffee, but tea and cocoa as well.The Kuerig is very easy to set up and use- it takes less than 5 mins to set up. It requires a low amount of maintenance and you can accessorize it to increase it's efficiency. A novel product with many more pro than cons."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; great tasteOur dentist office was the first place I tried the Keurig Special Edition Brewing system. I have seen many Keurig systems advertised, but I feel in love while in the dentists waiting room. My only complaint regarding the Keurig brewing system, is the price, my family and I are on a tight budget, and so this very item is on the waiting list. If price is not an option I would purchase today. I am very budget consious, so I will continue to watch for a deal or rebate of the Keurig brewing system. The product made from the Keurig system is like HEAVEN in a cup, too bad this pleasure will come at the expensive of a dental visit, but even then it is worth it. I like the single serve, my favorite part is the first cup of coffee, it is the best."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; no more large pots of coffeeCons: a bit more expensive but worth it!i bought mine over a year ago,and although i love the convenience and overall ease of the machine..it is noisy. some mornings sounds like a jet engine about to take off. called customer service and even though i told them it had not been a year they would not offer anything in replacement. still love it, just wish it were quieter, apparently quieter models were made after mine."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quicklyCons: a bit more expensive but worth it!; K-cups are expensive; worsened my coffee addictionOur Keurig B40 broke down a couple of weeks ago, after 5 plus years! My family makes coffee, tea and hot chocolate at least 10 to 15 times aday. When we sat down and determined how many times a day we used our Keurig, we cannot believe it lasted as long as it did. We purchased a Keurig B60 this time around (the B70 was way out of our price range), and we couldn't be happier. The B60 has three cups levels instead of the B40's two. It also offered us the ability to determine the temperature of the brew. We still get the timer on, off, etc., but the temperature of the brew? This feature is beneficial if you have children in the house who wants to make their own tea or hot chocolate. You don't have to worry about them burning themselves with hot liquid. I do wish that this model came with a filter. You have to make sure you don't have hard water or well water when using this without the filter otherwise it will clog and will not work for long. This model is also quieter than the B40, you cannot hear it at all. If you are not looking at it when you push the button, you wouldn't even know it was working."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!I've always hated coffee. Even after working at a coffee shop, I couldn't stand to drink the stuff brewed at home. When my family bought the Keurig, I knew I had to give it a try. Let me just say, this machine has turned me into a coffee addict! It has the perfect taste and temperature every time. The flavor is phenomenal and it's so simple to use! I always look forward to my daily cup. I never go to fancy coffee shops anymore as I can get the same quality and taste in my home! I love that there are so many different flavors out there to choose from. It even makes a great cup of hot chocolate! It would be the perfect coffee maker for a college dorm. With it's simplicity and sleek design, you are sure to impress everyone who uses it."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeCons: Hot Cocoa kcups could be betterWe have had this exact system for over 4 years. We recently purchased a new one because our original one wasn't brewing the cups size correctly. It lasted us for 4 years though. The new one that we purchased a month ago seems to be mechanically different so I will base my review on the new one.This single cup brewer makes great coffee in very little time. Its easy to use (my 2 year old makes our coffee from putting the K-Cup in, closing it, to brewing it), very convenient, and multifunctional. It requires K-Cups (pre-packaged ground single serving coffee pods) but you can find them at almost any store now, and using coupons and buying in bulk makes the cost better.Not only do you get great hot coffee one cup at a time, but you can also use it to get hot water for oatmeal or stick in a bouillon cube and you have soup.You can also make iced tea with the tea K-Cups by brewing over a cup of ice. I have not tried this yet, but plan to this summer."}, {"rating": "5", "user": "-", "raw-text": "Pros: Speed of brewing, selection of coffees, quality of coffeeCons: costSince I'm the only coffee drinker and I wasn't happy with the smaller coffee makers, I figured I'd give the Keurig a shot. I knew I would be very critical of the unit given it's price but this has reinvented coffee for me. I leave the unit on and it prepares a cup quicker than I can decide on which type of coffee I want to have. The unit feels very solid and operates perfectly but I purchased the extended warranty just in case something messes up with it. The selection of coffee / tea is very extensive but fortunately my unit had a variety pack so I could try different ones without having to purchase a box that I might not like. I have found that some of the flavored coffees have the flavor either too weak or too strong depending on the cup size I select to brew. If you think the price of one of the units is too much, consider what you may be paying at a retail coffee store because the freshness / quality of the k-cups will make you think you have a $4 coffee in your hand. If you're thinking about getting one of these, go ahead and get it. You'll only kick yourself for not getting one sooner."}, {"rating": "5", "user": "in", "raw-text": "Pros: Multiple Settings; Easy To Use; StylishCons: Fragilehad it for 3 weeks started short cupping and barely dripping during brew. [...] upgraded to the B70. MUCH better unit. it's been a month now and the reviews of the 60 all say similar to this review. avoid this item at all costs. We had one in our conference room at work (the reason I bought my B60). it also went south after 2 months of light service. Light meaning only used when we had upper level meetings in the conference room. Oh and by the way. We only brew about 3 cups of coffee a day. The B70, so far, is a much more durable product. spend the extra 30.00 and get the better one if you are gonna buy a Keurig. Oh and the \"my K cup \" has a design flaw but if you put a rubber band around the cup just below the cap area, to lift it up slightly inthe holder, it works great. Keurig.......fix your products and fire your engineers who designed your current stuff. Specifically, the My K cup. the needle opening is milled too deep in the lid and that is why you hear so many complaints about it."}, {"rating": "5", "user": "-", "raw-text": "Pros: your favorite coffee, in a k-cup!; easy-to-use; inexpensive; Can have a different flavor every cup; Every cup is fresh; Not just for coffeeMy fiance just bought me the one cup Keruig coffee maker because that is usually what I drink on the weekends, one cup and making a whole pot is a waste. I did not want to spend the money on the single cup coffee so he bought this for my new coffee pot. I love it. It is great. Definitely lowers the cost of making coffee. It is very easy to use. The only drawback is trying to get the coffee grounds cleaned out of it each time, but that does not deter me from using it. I can use my favorite coffee without the added cost of the single user container, which I simply refused to spend the extra money on. My boyfriend saw this online and actually checked in several stores to find it for me. This filter is the only reason he purchased the coffee maker, so this was a great idea for Keurig to come up with. It is very easy to use, just place it in the container that comes with the filter and place it into the spot where you would normally use the single cup containers. Then clean out the old grinds and reuse. It is very sturdy."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quickCons: expensiveThe Keurig Special Edition Brewing System is a very convenient and fast way to brew a cup of coffee. It takes less time than a brewing an entire pot. And it is perfect if you only want one cup. It is also great if you want one kind and someone else wants another kind. Another thing I appreciate about the Keurig Special Edition Brewing System is the variety of coffees and teas that can be brewed. There is something for everyone, even those who don't like coffee.However, the Keurig is a bit pricey. The pods are quite a bit more expensive than brewing the old-fashioned way. That being said, the Keurig is much more economical than going to your local coffee shop. So I guess the price all depends on your point of reference. While the Keurig brews a cup of coffee as good as a regular coffee machine, it is not an espresso machine and does not make specialized cups of coffee. It doesn't steam milk, etc. If that is what you are going for, then your money would be better spent elsewhere."}, {"rating": "5", "user": "-", "raw-text": "i got this keurig special edition brewing system B60 for my office couple of month ago. just the name makes it sound good and fancy. so let me tell you things i think are important about this coffee maker. its single serving, easy to use, quick, will make your coffee taste great, no mess, makes tea, hot chocolate and oatmeal. it brews it very quickly and you wont need those super large and annoying large pots of coffee. its easy to clean up! you will love it!!! i know i do. its a time saver. its a little expensive but it will save you money. gas to go get the coffee and the price of the coffee it self, also the time your wasting. its a little loud and the k --cups are not very cheap. thats all the cons i have about this product. i recommend it to anyone with an office or a house. anyone who drinks lots of coffee or has people coming over for coffee often. i give this product a 4 out of 5"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffee; tea, coffee or hot chocolate; easy to read display; fun; always a fresh cup of coffee; Easy; can make hot water for instant soups; even makes tea & hot chocolate; Hot, fresh coffee, 1 cup at a time; Can use my own coffee; A wide variety of coffee flavors; So many flavors; can select cup size; famly friendly; no mess; Use your own coffee with the K-CUP; Brews great tasting coffee; Makes clean up easy; Perfection every time !; stylish; No more wasted coffee!; Wide selection of coffees and teas; you can use regular grind coffees; You'll LOVE it!!; brews quietly; can use large mugs; cheaper than Starbucks; choice of brewing a cup or a travel mug; different flavors to please all; easy to keep clean; Easy to use. No waste; fast!!!; good for tea and hot cocoa too!; Has a built in water filter; modern look; no clean up; variety; a hot cup of java; Auto on feature; can use your own coffee; Coffee in a FLASH!; delicious; fast; good for single serve; Many varities to choose from; No Waste; Provides variety; Stylist design; uses K cupsMy wife bought me a Kuerig two years ago for Christmas and I love it. It was the standard b40 model. It served me extremely well. However I really liked the extra brewing sizes, the capability to make iced coffee, the water filtration system and the cool blue display. So when I came accross an awesome deal at the holidays on a shopping channel I had to pounce on"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; brews quickly; great taste; no more large pots of coffeeI bought this because I do not need an entire pot of coffee or tea or hot chocolate, just one cup and that's exactly what I get with this! I love it! There is no waste, it does not take long to make, it tastes great, and they have so many options to choose from now too! It's super easy in the morning, no spilling when trying to pour myself a cup because I am tired... it's already in the cup! It's very \"stylish\" too. I can imagine it would look pretty great in any kitchen! I can imagine that it could be expensive but for me, I am saving money. I would NEVER use an entire pot of coffee and it would get wasted but there is no more waste. Plus you can buy them at Bed, Bath, & Beyond, use their 20% off coupon, and you get a pretty great deal! Also I have noticed Target now sells them. They had them on sale recently, so I just stock up when there is a sale or I have a 20% off coupon for B,B,&B. Unless I have guest over, I am not sure I will ever use my traditional coffee pot again!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeBought this Christmas time at a very good price. Fell in love with it immediatly. With all the wide range of teas and coffees you can get as well as hot cocoas and cidrs it has something for everyone."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!I was desperately looking to buy a new brewer for my kitchen and after doing a lot of research and checking out some of the brewers in the departmental store I came across the Keurig special Edition Brewing System B60. It is definitely the best option available today. It is a little pricey though so you will have to pay more than it's competition but let me tell you that it is well worth the extra price. Because here what you pay extra for is the great quality and service that Keurig provides you. You just cannot go wrong with this product and you will not regret buying it. It brews the coffee very fast so you don't have to wait long for it and it is so much easier to clean than having to wash out all the pots and pans that you use to make coffee. It is very simple to use so there is no learning curve required and it just works out of the box which is amazing. So if you are looking for a good quality brewer go for this and you will not be disappointed."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeCons: K-cups are expensive; Hot Cocoa kcups could be betterI bought this item about five months ago and it has been doing wonders for the family. We consume a lot of coffee each day, but do not like leftover so the coffee maker was not really economical for us. Not only does this machine provide perfect single servings, but it is also really easy to use. The K-cups come in a variety of flavors so everyone can enjoy what they want. However, I recommend buying the K-cup filter that lets you use your own ground coffee because it will cost a lot less, but still taste great. Cleaning is also not a hassle since there aren't any parts that really need to be cleaned except for emptying out the excess liquid collector once in a while. It heats up quickly and brew time is also fast. It's also nice to be able to set when the machine is on and off and the brew temperature. The only negative thing is that sometimes the coffee can be a little weak for those who like it strong. Nevertheless, this item is a must for coffee lovers."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; Enter your own tagCons: a bit more expensive but worth it!; K-cups are expensive; expensive; Enter your own tagReceived this brewing system for Valentine's Day this year and I am officially hooked! My biggest problem with conventional coffee makers is that I could never seem to get the proportion of water to coffee grounds right- it always ended up being too strong or too weak. Now with the K-cups all of the guesswork has been taken out of the equation. You simply drop in a Kcup and press the button corresponding to the size you want and it takes care of the rest. The coffee is ready in what feels like seconds.This model also has a clock and a timer so that you could set it up to brew your cup at a certain time, but I really don't know that I will ever use that function. The coffee is brewed so quickly that, for us, there really is no need to set a timer in advance to save time. (I do like the cool blue light that the clock display gives off, though)Included in the paperwork was some info on Keurig's coffee club and a really great discount code- buy 2 large boxes, get 2 free plus free shipping. I have taken advantage of that offer and it is really a great deal."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!If you like to drink coffee and appreciate a fresh brewed cup each time then this is an absolute must have product. I love coffee and can never drink a 'potted' cup ever again in my home. I caution, the syste mis not cheap and the replacement cups are fairly expensive too. the assortment of available flavors is very diverse. You can get not only the flavors but the strength or boldness. in other words, weak brews or expresso type strength tastes.There are assortment of teas / hot cocoa as well but this is definitely meant for coffee lovers. Teas and cocoa were okay nothing to write home about and certainly not worth the cost. It looks like a new age machine but it is so simple to use that my eight year old can make a cup. It brews rather quickly too. in th elong run , you may save money since there is no more throwing out 'old' coffee and brewing another big pot. this machine is easy to clean as well so low maintenance and no more breaking the silex pots. Just use your favorite coffee cup"}, {"rating": "5", "user": "-", "raw-text": "The other day I was looking for a good brewing system and eventually picked up the Keurig Special Edition Brewing system b60. What a great buy it was I must tell you. It is super easy to use and very easy to clean. It brews very quickly so you don't have to spend too much time waiting which is a great bonus. The coffee is great to taste and I don't think I will ever have to visit another coffee shop ever. This will take care of all the premium coffee I need. Gone are the days where I would have to take out all the pots to make a cup of coffee. It works just as advertised. The only drawback it probably has is its price. That was a kind of a problem for me but after reading about this brewer I decided to pay the price for quality. Because it is so easy to get coffee ready I do end up drinking so much more. But I guess that's a compliment for the brewer than something negative. I am very satisfied with it and have had no problems. I would definitely recommend it."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy-to-use; your favorite coffee, in a k-cup!; inexpensive; Can have a different flavor every cup; Every cup is freshCons: frequent washing required; Less convenient than Kcups; messy; a painI have mixed emotions about the \"KEURIG Reusable Filter\". I love it because it's very cost efficient, and works great. You can use your favorite coffee flavor and/or brand..all different flavors. Its very simple to use, as well. I hate it because its difficult to clean, it is sometimes quite an issue to get all of those little grounds out of the fine mesh..it seems like the coffee literally sticks to the filter and the filter needs to be cleaned everytime (of course) which can sometimes be a real pain. I would have to say, if you have the time to spare to clean the filter, and you really want and/or need to save the money by buying bags of coffee vs. the small throw away k-cups, and you drink alot of coffee (because the little disposable K-cups..at 6 per day..can get costly)..than the KEURIG Reusable Filter\" is a wongerful accoutrement to own for your KEURIG Coffee Maker. On the other hand..if you are a light weight coffee drinker (1-2 cups per day), and don't need the hassle of trying to clean all the coffee grounds out of the KEURIG Reusable Filter..you would be better off buying the disposible K-cups. Just my Opinion."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy-to-useCons: frequent washing required; Less convenient than Kcups; messy; a painThe My K-Cup for the Keurig is a great idea, but in actuality, I find that I don't use it all that much. The cost of it was affordable and I liked the idea of being able to brew store brand cheap coffee if I wanted. But after buying the filter and using it with the store brand ground coffee, I find that I much prefer using K-Cups. The cost is a bit higher per cup of coffee but it pays off in convenience. With this K-Cup you have to wash the filter after every cup of coffee. I also found that sometimes ground would sneak in to my cups. I don't think that they were permiating the netting so much as they were getting hung up in the machine somehow. The unit is easy to insert and remove, which was a plus. I'd say the benefit of having this is the ability to brew a cup of coffee on those sad days when you realize you are 100% out of K-Cups. It definitely beats having to get dressed and hit the grocery store early in the morning."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quicklyCons: a bit more expensive but worth it!; K-cups are expensive**Keurig Special Edition Brewing System **is a fabulous addition to my workplace. It is so easy to use for almost everyone, even the newbie coffee drinkers. The water receptacle is easy to fill. Then you just plug it in and wait for the machine to tell you it is ready, put in a k-cup press the size of cup and you are all set. There are so many various flavors available by lots of \"brand name\" coffee makers as well as hot chocolate and various brands of teas. I know that some people think that the k-cups are expensive, but if you think about how much people spend on coffee from a coffee shop every day, it's a bargain. I have a bigger coffee pot at home, which we use when we have big gatherings (having a big pot of coffee for that purpose is much easier than a single serve coffee maker). If you are single or the only coffee drinker in your household (or if you have it in a workplace), it's perfect. I know that many schools have one in the faculty rooms for teachers - so kcups are a great teacher gift!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; no more large pots of coffee; always a fresh cup of coffee; large variety of flavors; Easy; no clean-up; even makes tea & hot chocolate; Hot, fresh coffee, 1 cup at a time; Can use my own coffee; no mess; Brews great tasting coffee; Makes clean up easy; Perfection every time !; stylish; comes apart easy for washingCons: a bit more expensive but worth it!; worsened my coffee addiction; Not ideal for large groups; K-cups need a lot of storage space; Would like a larger water resevour.I have always been a lover of coffee, but did not think that the Keurig was going to be worth the money. I had a nice coffee pot and a nice stock pile of coffee beans and thought that the price of the Keurig along with the price of K-Cups could not be justified. My husband new I had secret desire for one and surprised me with the Keurig B-60 for Christmas. I was so surprised but I told him we should return it because we had a perfectly good coffee pot and shouldn't waste our money. He told me that it was my Christmas present and I should enjoy it. From the second I made my first cup of coffee from the Keurig and took my first sip, I was HOOKED! I absolutely love it and don't ever want to be without it. My opinion did a 180 degree turn!!! It is SO easy to make and there is virtually no clean up afterward. I don't have to empty my coffee pot and clean it or deal with dumping messy coffee grounds or wash 6 parts anymore!!! The best part: EVERY cup of"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffee; Compact; Stylish DesignCons: expensiveThis has been the best present I have ever gotten. I can make oatmeal, soup, hot chocolate, tea, coffee and who knows what else I can make with it. Being a new mom I need all the help I can get and this definetly feels like I have an extra set of hands in my kitchen. I like how quick it works and how compact it is. Plus it is very stylish and goes with my decor perfectly. I couldn't be happier with this fine coffee maker. I leave it on my counter all the time and use it every day. It is easy to clean and refill. I can use it with one hand meanwhile I carry my daughter in my other hand. It is perfect also when visit comes over each one can pick whatever flavor coffee they like and have it on the spot . This is definetly one kitchen item I would not like to live without. It is suited for everyone even if you do not like coffee like myself. In conclusion I hope it never breaks because it is too expensive for me to buy a new one."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffee; tea, coffee or hot chocolate; easy to read display; fun; always a fresh cup of coffee; large variety of flavors; can make hot water for instant soups; no clean-up; A wide variety of coffee flavors; So many flavors; and oatmeal; Can use my own coffee; ease of use; can select cup size; versatile; Perfection every time !; stylish; comes apart easy for washing; modern lookCons: a bit more expensive but worth it!; Most grocery stores don't carry kups; K-cups are a little pricey; not eco-friendlyI LOVE the Keurig Special Edition Brewing System B60! I'm the one who is the big coffee drinker in my family. With my previous system, I was making 1/4 to 1/8 pot of coffee and still needing to waste some of it. This machine is so great because you fill it up full of filtered water, and just use the k-cups as needed per coffee cup! The cleanup is amazing! I love that the holder for the water is easy to come out, and can be put in the dishwasher. I love that it has a timer so I can have hot coffee when I wake up. I love that my husband can have regular coffee, I can have vanilla, while my kids use the hot water for their oatmeal! I have not tried the hot cocoa k-cups, but my kids love to use the hot water for their cocoa as well! I love that you have an option to pick what size of cup you want to make! The K-cups can be a bit expensive and can be hard to find in some stores. But you can still"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; great tasteCons: a bit more expensive but worth it!I got one of these for Christmas and LOVE it. I use it every day. One of the lights under the buttons stopped working after a couple of days, but that hasn't affected the use of the machine, so that is the reason only 3 stars. I figured it wasn't worth sending in to get repaired for one light not turning on, but it it frustrating since it cost so much."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great tasteCons: a bit more expensive but worth it!Here we go. I first made a mistake and purchased the B-40. Then after 4 days, I sent it right back to Amazon, and ordered the B-60. By the way, My new B-70 is on the way as we speak from QVC, couldnt pass up the deal.!!! Here it is, its the best home brew coffee ive ever had. The machine is great, it has 3 different sizes for brewing, and the system is nice and smooth. Its quiet, smooth and a pleasure to use as your making your morning cup of Joe. y6the hting is, you dont have 5-7 minutes anymore. It brews the cup in less then a minute. So no more going to the driveway for the pper, or the the bathroom to shave, no time. Its quick, easy quiet, and ot. What more can you ask for?  i have had an issue with this unit. About 8 months into it, the coffee started to not brew. It seemed like the water would jam up, and only make about 1/4 cup of coffee. Come to find out the units must be cleaned with vinager ever 2 months or so to get the crystals out of the system that build up. I didnt have a clue aboput this. But i called CS, they walked me through it, and the machine has been great ever since. So just remember, if it starts going slow, or making less than you think, caLL THEM AND THEY WALK YOU THROUGH IT. bESIDES THAT, NOTHING BAD AT ALL, AND i LOOK FORWARD TO MY COFFEE EVERY MORNING AND WHEN i GET HOME!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: single serve; quick; brews quickly; great taste; large variety of flavors; A wide variety of coffee flavors; Can use my own coffee; can select cup sizeCons: No Starbucks coffee; K-cups need a lot of storage spaceReceived the Keurig B60 Brewing system for Christmas, and absolutely love it!  It has replaced my $4/day coffee habit at Starbucks...  I love the WIDE variety of K-cups that are available from numerous websites, including Keurig's.  They had a deal with a new coffee maker for 2 boxes of K-cups free when you ordered 2 boxes - really got my K-cup collection started, though they do take space to store.  I have my machine programmed to start up every morning, so that by the time I get to the kitchen, the water is hot and ready to brew.  Has made my morning coffee routine much quicker - choosing which k-cup to use takes the most time now.  I also bought a reusable k-cup filter, and can use any ground coffee that I want - which eliminates the problem of no starbucks k-cups being available.  You can also adjust the cup size that it brews, to get your coffee to your desired boldness.  Two of the \"small mug\" sizes brews just enough to fit in my travel mug, with enough room for cream.  And, the removable drip catcher allows my travel mug to fit right under the dispenser - I don't have to deal with pouring coffee from cup to mug.  Would recommend to anyone!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quickI bought Keurig coffeemaker after my company purchased one for their employees. After a week of using it for my daily commute and I see why my company bought it. There are more pros than cons. First off, Keurig has tea K-Cups available for quick use and in addition has a nice feature of heating water in less than 15 seconds if you ever decide to go with hot tea. If you want to go with your favorite coffee blend, you can buy a filter which will allow you to ground your own coffee beans in the machine. I had questions on how to operate the Keurig coffeemaker so I called Keurig operators which are available 24/7 and they were very infomative in answering all my questions. I had my coffeemaker registered over the phone so there was no need to mail in the warranty card. The design is very modern and stands out, especially the blue LED lights. A few problems I found with this coffeemaker is that I couldn't find the K-Cups to make coffee on the go. I sometimes had to take some from work just to feed my habit. I later found that amazon.com sell K-Cups super cheap so now that's where I buy all my coffee from. I recommend buying a variety of K-Cups since the come in bulk. I usually have 5 roommates who are on the go so I find Keurig coffeemaker makes coffee very quick and in large volumes."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to useCons: pre determined cup sizeIts nice having a fresh cup of coffee every time. Lots of options/flavors for coffee K-Cups, although I also purchased the My K-Cup as it seems like less waste being generated. I wish it had a larger brew size though. I use a larger coffee mug and have to use at least two small cups of coffee to get nearly a full mug of coffee.....All in all, a good buy though..."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; brews quickly; great taste; no more large pots of coffeelove this kuerig, except for the pump noise.. small price to pay for a great cup of coffee.  also own the pod filter so i can use my own cofee.  takes 30 seconds to brew a wonderful cup of coffee. now no wasted coffee and a fresh cup everytime"}, {"rating": "5", "user": "-", "raw-text": "Pros: your favorite coffee, in a k-cup!; easy-to-use; Can have a different flavor every cupWe just recently bought this K-cup for our small personal sized Keurig coffee maker. I think that this brings the Keurig coffee maker to a whole new level. The K-Cup allows you to use any coffee you'd like. Therefore, this becomes more affordable for anyone. I feel that this offers something for everyone and will allow the coffee maker to reacher a broad audience. This saves money and doesn't require you to purchase the flavors that are sold by Keurig. It makes the possibilities of this coffee maker endless and more budget friendly. The Keurig coffees can become expensive for many, but using this K-Cup you are able to buy any type of coffee. The K-cup is easy to use and rinses clean. It is very simple just like the coffee maker. I would recommend this to anyone who owns a Keurig coffee maker. I really look forward to experimenting with this K-cup and a wide variety of coffees. I think that with the K-Cup the possibilities are endless."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; great tasteCons: K-cups are expensive; expensiveI am not a coffee drinker. I don't like the taste of coffee in the slightest. On the other hand, my husband is a coffee fanatic! He could go through a couple pots in a day if it was sitting out. This machine has been perfect for the both of us.For me, they make hot chocolate, tea and apple cider k-cups. For my husband, there are so many different kinds of coffee available in k-cups that he has a hard time deciding what to order! Most of what he's tried so far he has liked.The value of this machine is definitely not in the k-cups, though. They can be pretty expensive, honestly. We bought a $15 filter that goes into the machine that my husband can fill with whatever kind of coffee he would like. The other benefit for me is that the machine will also fill my cup with very hot water so I can use it with my own packets of hot chocolate and it's a lot less mess than trying to microwave it. With this alteration it's a perfect machine for both of us to use."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!This is the best coffee maker I have ever owned.It is so convenient,you have a fresh hot cup every time and they have countless varieties of coffee tea and cocoa for the Keurig.You never have a wasted pot or worry about filters and everyone in the house can have their own custom cup of coffee tea or cocoa.Very simple to use easy to clean and so much fun for guests when they visit too."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; no more large pots of coffeeWhen I told my husband I wanted a Keurig for Christmas, he scoffed at the idea. \"Why would you want a kitchen appliance?\" he says. Guess what? Now he uses this just as often if not more than I do! Here goes: I happened to find a great deal on the Keurig b60 that I couldn't pass up, so rather than wait to see whether or not I would get it for Christmas, I went ahead and bought it and set it up pretty much as soon as I had gotten home. This unit is extremely use to use and no mess to clean up. I do wish that the large mug size would brew a little more coffee, but I think they take into consideration that you may be adding cream to your coffee and allow room in your mug for that. For those of you on the fence about buying this, it really depends on the cost factor. While this is definitely cheaper per cup vs going to a local donut shop, it is more expensive than using a traditional coffee machine. The thing that I found though (with me anyway) is that even though using a tradtional coffee machine was cheaper, I was still wasting money simply because I'd brew an entire pot and would end up tossing half of it, if neither me nor my husband drank the whole thing. With this system you brew 1 cup at a time, so there is no waste. No money is wasted on filters either, however, if you choose to use your favorite brand of ground coffee, you can purchase a k filter (mines happened to be included in my purchase) and go"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; no more large pots of coffeeCons: a bit more expensive but worth it!We have had a Keurig for about 4 months and I don't know how we survived without it.  It is easy to use and I love having such a great variety of k-cups to choose from.  I had a different single serve pod-style coffee maker before but there were very few choices for coffee.  The Keurig is so convenient.  I just turn it on whenever I feel like having a cup of coffee without worrying about a whole pot of coffee going to waste.  Another benefit is that my husband and I can each pick our own type of coffee.  Our taste in coffee is very different, so this is vital for us.  I can have my flavored coffee and he can have his bold coffee without much effort.  The keurig is a nice size and fits well on my countertop.  It brews coffee to a nice temp.  You can choose what size cup to brew.  There are even some k-cups that are made to be brewed over ice.  That is a very nice option to have, especially in the hot Texas summers."}, {"rating": "5", "user": "-", "raw-text": "Pros: your favorite coffee, in a k-cup!; easy-to-use; inexpensive; Can have a different flavor every cup; Every cup is freshCons: Less convenient than Kcups; a painI received this as a gift at the same time that I received my Keurig coffee maker.  I absolutely love this!!  With the price of the K-cups, it allows me to use my Keurig everyday.  Besides economical, the quality of the brewed coffee is equal to using a purchased K cup.  It is super easy to wash, I rinse it out after each use and pop it in the dishwasher about once a week.  Very simple to use.  The only complaint I have is that it is a pain to take out the K cup holder each time I use this, but it is well worth it.  I've never gotten any coffee grinds in my coffee, so you know that the filter works!  I have had my K cup filter for over a year and it still works as good as the day I got it (and that's with probably 5 uses a week!).  Very durable.  If you really want a Keurig coffee maker but are concerned about the price of the K cups, please consider purchasing this.  You won't regret it."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeCons: K-cups are expensiveThe Keurig Special Edition Brewing System B60 is the best brewer!  I recently received one of these systems through the rewards program through Discover Card.  I had never used one of these before nor had I drank any  coffee from this type of system.  Once I tried it, I really like it.  It is so easy to set up and extremely easy to use. The coffee tastes really good too.  I have only tried a few of the flavored coffees so far, but the ones I have tried are all good.  I love the fact that it is single serve and that you can set the size of the cup of coffee that you want, which then makes it also as strong/weak as you want it.  There are no more large pots of coffee going to waste and no messy grinds to throw out.  There is also a small single serve filter that you can purchase separately so that you may buy larger bags of coffee to use in this brewer also.  This will help if you feel that the K-cups are too expensive to purchase."}, {"rating": "5", "user": "-", "raw-text": "Pros: your favorite coffee, in a k-cup!; inexpensive; easy-to-use; Not just for coffeeCons: frequent washing required; Less convenient than KcupsI received a Keurig coffee system for Christmas.  While I definitely enjoy all the different varieties of prefilled k cups that are offered, they are simply too expensive for realistic everyday use.  On average, an 18 pack of prefilled k cups cost between $10-15.  Just too much for the avid coffee drinker!  I purchased the My K Cup at Kmart for approximately $18.00.  The instructions included are very easy to follow, and I was brewing a cup of coffee within minutes of removing it from the box!  Now I can buy whatever flavor of coffee I choose (Folgers) and buy it in bulk, just like I did with my regular coffee maker.  The directions state that use of tea is not recommended in this filter.  However, I bought some loose leaf Lipton tea at my local grocery store and I have been enjoying cups of hot tea as well!  I only gave the My K Cup 4 stars because it does not seem to seal down very well, so there is some minor leakage of water around the filter, but does not make a huge mess or hinder the machine's ability to make my favorite beverages!  A must have for any Keurig owner that doesn't want to spend a fortune to use their wonderful machine!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; great taste; brews quickly; Enter your own tagCons: a bit more expensive but worth it!; K-cups are expensive; Enter your own tagWe received the Keurig as a gift, but I had secretley been hoping for one.  I first tried the Keurig in my dentist's office.  I was shocked at how fresh and tasty the coffee was.  It is so easy to use!  My kids are able to make their own hot cocoa and use the fresh hot water to make oatmeal.If I had to mention something that doesn't thrill me, is the amount the k cups cost.  We drink a lot of coffee, so I am not sure how economical it will be."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; great taste; brews quickly; no more large pots of coffeeCons: a bit more expensive but worth it!; K-cups are expensiveI haven't had this system for very long maybe about three weeks.  I have to say I got an excellent deal on it just at my local grocery store.  They had the system as a Christmas special at the low, low price of $99!!!!  It gets better yet...they also had a coupon in-store to take an additional $10. Okay, enough about my fantastic deal.  I'm really not that much of a coffee person at least not the regular old coffee but boy am I developing a taste for all the different flavors.  I like the fact that you can adjust the size of cup, that you can brew coffee, tea, hot chocolate (my favorite).  The fact that you don't have the mess of a standard coffee maker or the waste of half a pot sitting all day that no one wants to drink.  My husband also loves the system and he, like me, really never drank a lot of coffee.  The only downfall is that I think the k-cups are a little on the expensive side but since like I say we don't drink a lot I can live with!  Ease of use...phenomenal."}, {"rating": "5", "user": "-", "raw-text": "After a few years of my son begging for a Keurig, we bought this one for him. He absolutely loves it. The design fits well in his kitchen. Uses it daily. One of the best things we've ever bought him he says.The best thing was when we ordered it it came with a mail in coupon to get 48 more Kcups for free. It's great because it gives him an opportunity to figure out which of the first 48 he liked the best.Great, Great deal..."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; great tasteCons: a bit more expensive but worth it!; K-cups are expensiveFor the most part, I love my Keurig B60.  It makes a cup of coffee so great that I really don't even like coffee from a regular coffee pot anymore!  It is easy to use, fairly efficient, looks great in my kitchen, and requires very little cleanup.  I de-scale this brewer (as recommended by the manufacturer) every 2-3 months, before the de-scale light even comes on because we have fairly hard water.  The brewer has 'slowed down' how quickly it brews in the last couple of months and still works well but it is noticeable.I would say that the Keurig B60 is a little bit more expensive to own than other coffee pots simply because of the cost of the single-serve pods, but having the convenience is well worth it so far.  There are a wide variety of K-cup flavors to choose from that are sure to satisfy any person's tastes.  Out of all that I've tried I've only come across one I do not like.I love the look of the B60 and the LCD screen is one of my favorite parts of it too.  It is nice to have everything on the machine digitized and I think this looks nice and makes it even easier to use."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serveI love this coffee maker!  My parents gave it to me as a gift and I actually gave away my old Cuisinart after receiving it.  I love the simplicity---my teenage son even makes me a cup of coffee when I ask for one without any problems!  The coffee is perfectly brewed and I love being able to choose a different flavor for every cup if I want.  It's great for company, everyone gets their own favorite cup of coffee and it's ready in an instant.  The K cups are easily available and make the perfect strength cup of coffee.  The coffee maker heats up in a minute or two and then you are ready to go. My kids love it because I can get their favorite K cups in hot cocoa and tea.  I do wish the water resevoir was larger---I have to fill it up again every three cups but it does heat up quickly once it's refilled. This is fantastic buy for the money. It's like having your own little coffee bar!  Watch out Starbucks!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; great taste; no more large pots of coffee; brews quickly; modern lookCons: none!This Christmas I decided to buy my husband a Keurig SPecial Edition Brewing System and It was a hit! He absolutely loves it! He loves that he can chose whatever flavor he is craving and make a mug of it, then later on have some hot cocoa or some of the tea he loves. This Keurig is working non stop in my house! My sons love the hot cocoa so much- its so easy to use too! Each time you pop a new little K-cup into it , the Keurig does all the work. The machine punctures a little hole into the K-cup and it brews a fresh cup of coffee for each person. What a wonder, No clean up!Who wouldnt love that?? Its so fast, It tastes wonderful and there is no longer coffee gounds messing up my sink or counter top. For the keeping the kitchen clean part alone, I was sold on it! It is a very modern looking appliance also- very unique looking. I love the look of black appliances also. There are so many flavors of coffee. Many flavors of tea and chocolatey cocoa for all."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; brews quicklyCons: a bit more expensive but worth it!; Hot Cocoa kcups could be betterI have been trying to get my wife to let me get one of these for months.  She kept saying they were not worth it and that she already had a coffee maker.  Christmas rolls around and she can't stop me from getting it for for (thank you Christmas spirit..)I bought it from Amazon and it was delivered a few days later.  When my wife came home from work I had a cup of French Vanillia Roast ready for her.  At first she was upset that I purchased it, then i told her it was her Christmas present and that she could not send it back.  I programmed it to turn on automatically at 6:30a.m. so she can walk in and make herself a cup before work.  It is also programmed to turn off after 2 hours of inactivity.Well, we have had it for little over 3 weeks now.  When we went to my parents Christmas party she could not stop talking about how much she loves it.  I keep teasing her that I will have to send it back since she did not want me to \"waste\" money on a new coffee maker to which she threatens to leave with it if i do..I think she likes it :)Now about the thing.."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; great taste; no more large pots of coffee; brews quicklyCons: K-cups are expensive; expensive; needle gets clogged; Poor Quality; Pricey especially if you use the K-cups.We bought our 1st Keurig brewer about 1.5 years ago.  Initially, it was fantastic - we had so many choices for brands and flavors of K-Cups and really enjoyed the special Holiday flavors!!  About 6 months after our purchase, the units started only brewing a 1/2 cup and would leak from the back of the unit.  I called customer service and they were nice enough to send out a replacement and included a free 18 K-Cup sampler.  We were very pleased with the customer service.   The new unit came and we tossed the old one.  About 5 months later - this new units started acting up.  It would turn off when trying to brew - would keep saying to de-scale - even when we had just finished de-scaling.  I was starting to get annoyed - I called the customer service dept and this time I was treated like I was trying to pull something over on them.  I said I didn't want them to send another unit out if I was going to have problems in another 5 to 6 months.  I would prefer a refund.  They couldn't issue a refund because I didn't buy the initial unit thru Keurig. It was purchased at Sam's Club. I then asked if they could send me a different model and I would be happy to pay the difference.  The girl told me she couldn't do that either.  I asked to speak to a supervisor and was"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; great taste; no more large pots of coffee; brews quickly; always a fresh cup of coffee; large variety of flavors; even makes tea & hot chocolate; Hot, fresh coffee, 1 cup at a time; No more wasted coffee!; Perfection every time !; Use your own coffee with the K-CUPCons: a bit more expensive but worth it!I have had my Keurig for over two years and use it every day!  When I first purchased it, one of the lights that shows the different cup sizes quit lighting up.  I called customer service, and after determining that it needed to be replaced, they sent me another one right out!  I was very impressed with their customer service the one time I have had to use it!  They were very nice and helpful.  I have not had any other problems since then!  I love how fast this machine makes a GREAT cup of coffee in the morning!  I have also enjoyed trying all different kinds of coffee--some that I never would have tried!  I also have the \"My K-cup\" where you can put in your own coffee to use in the machine instead of the K-cups that you purchase.  I haven't had as good of luck getting a good cup of coffee with that, but I like having the option of using it if I run out of K-cups.  I also like the fact that you can set this to turn on at a set time and stay on for a certain number of hours or shut off by a certain time.  It is so easy to use and easy to clean!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; great taste; brews quicklyCons: a bit more expensive but worth it!I have wanted one of these are quite some time now but haven't bought one until just recently, when my boss purchased himself the newest model, he brought his older one to the office to let us use.  Let's just say, right away, I was hooked.  i don't know where to begin.  It's so easy to use, just fill the reservior with water and presto, you're ready to go.  The hardest part is deciding which coffee to brew.  There are so many choices on coffees, as well as teas, and cocoas.  This will ensure that everyone has something for them.  next you just drop the K-cup in the machine, choose the level of drink you desire and out comes the coffee.  No cleanup, no more making a whole pot of coffee and it going to waste, it's quick, it's easy and it smells sooo good!  Nothing beats one person brewing Blueberry coffee and the next person brewing Hazelnut coffee within minutes of one another.  The K-cups equal out to an affordable price when you use Bed, Bath and Beyond coupons too.  Happy brewing."}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Easy To Use; Durable; Accommodates All Cup Sizes; StylishCons: Limited Cup SizesOk so I've also had my Kuerig for about 18 months. It started telling to that I needed to de-scale (not once but multiple times in a week). So I called and was told my water pump is going out. OK this machine is only 18 months old, not used every day and the water pump is going out? I was offered a machine at a discounted price but after reading the reviews here I'm worried as I see a few complaints like mine."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; Quick; single serve; great taste; no more large pots of coffee; brews quicklyCons: a bit more expensive but worth it!I received my Keurig as a gift from my mother.  After making one cup of coffee with my Keurig I had already packed away my old coffeepot.  I love that you can have fresh coffee by the cup all day, everyday!  My Keurig came with 60 K-cups and I was able to try a wide variety of coffees and decide wihich flavors I liked the most.  I especially like that you can pick your cup size and even brew coffee into travel mugs.  My son loves to make hot chocolate using the Keurig.  This is by far the best coffeemaker I have ever used.  I no longer stop at Starbucks or McDonalds for coffee, I bring my own from home!  It is super easy to use, easy to clean and the water tank is easy to remove and fill.  I also recieved a special offer from Keurig that if I ordered 2 boxes of coffee from Keurig.com I got 2 boxes free and with free shipping.  I would recommend this product to anyone looking for a new coffeemaker!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Accommodates All Cup Sizes; Multiple Settings; Stylish; Easy To UseI love my Keurig. I did just buy the B60. I had the B50 for just about 5 years. (not used everyday) It did just die on me this morning. So i went out and got this B60. I love it. I did read all these reviews and hope nothing happens to mine. BUT i do have to say I got it all set up and made coffee as my husband and 2 year old were sleeping.. I do not find it loud what so ever.. I love Keurig and we always stick to them!"}, {"rating": "5", "user": "-", "raw-text": "Pros: quickCons: K-cups are expensive; expensive; Noisy; Adaptor leaked; Machine would stop intermittentlyMy husband purchased a Keurig Special Edition coffee maker for me as a Christmas present, I loved it at first, but as I used it my joy slowly turned to frustration. The machine takes special K-Cups, only sold by Keurig, and these can be very costly. The hot cocoa K-Cups that I bought were very weak and not what I expected for the cost.If one K-Cup made a strong cup of coffee the cost per cup wouldn't have been too bad, but I had to use two K-Cups to get the strength of coffee I desired, making the cost per cup way too high! In order to keep the machine, which I really did like, I decided to buy the Keurig adaptor, so I could make my own cups from my own coffee. This worked okay, but now I had to fiddle with the round rubber gasket on the machine (near the needle that poked holes in the K-Cups).When using the adaptor, my machine leaked water everywhere. I called Keurig, who told me this was not unusual and that I needed to pull the gasket down - EACH TIME I used the adaptor! Not cool, and it became a nuisance for me.Next, the machine stopped working for me. It would drizzle some coffee into my cup and then stop. I called the store where I purchased it and the rep I spoke with told me this happened to her as well, and that I should run plain water through it to see if that helped. Well, it did, but it didn't solve the problem. And if I am paying $150"}, {"rating": "5", "user": "-", "raw-text": "Pros: Convenient, low maintenance, large variety of flavors.Cons: High cost per cup, not very ecologically friendly. WEAK coffee.If you're one of those who likes to be able to see through your coffee, this thing's for you! While there may be a wide variety of flavors I have yet to find one that can match brewed or traditional drip coffee for full, rich taste and aroma. Even when set to the smallest size and using the \"boldest\" varieties this one disappoints.The cups themselves aren't very friendly to the environment either. They can't be recycled without a lot of effort, only get used once, and require quite a bit of energy to manufacture compared to bulk ground coffee."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; brews quicklyCons: K-cups are expensiveCan we just all agree that this coffee maker is overpriced?  With that little tidbit out of the way, it's hard not to like this Keurig Special Edition Brewing System/coffee maker.  It's super convenient, you can buy a wide variety of coffees, teas, apple cider and hot chocolate brands on Amazon for less than you can in stores.  Yes, they are still expensive too, but I believe the cheapest you can buy the little pods is on Amazon (with free two day shipping no less).My first experience with this B60 Keurig model was at my brother and sister-in-law's house.  They have one at home and my brother has one in his office at work.  I was amazed at how easy this Keurig was to use and was impressed with the variety of pods to choose from.  I've tried hot chocolate, tea and coffee and enjoyed all of them.The benefit of this system over the mini version is that you can choose between 2 cup sizes.  With the mini version, you only get the smaller cup size which isn't a full coffee mug size.Overflow tray is removeable to clean up spills easier too!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; no more large pots of coffee; brews quickly; tea, coffee or hot chocolate; easy to read display; a hot cup of javaCons: a bit more expensive but worth it!; worsened my coffee addiction; Remember to descaleI purchased my Keurig B60 Coffee Maker over 4 years ago. Two of my friends had them, and they were both very happy. Both friends were so excited to be \"early adopters\" of this new brewing system and they each insisted on giving me a nice demonstration and coffee tasting session. It was very impressive, and in October 2006, I decided to invest in one of my own. We've been so happy with our Keurig, and even more so as the new varieties of K-Cups appeared on the market. We even purchased FOUR more Keurig B60's for friends and family for holiday gifts over the years. Everyone we have given it to has been so grateful, and the best part is we can give them future gifts of K-cups for birthdays and holidays. The Keurig is easy to use, the K-cups are readily available in grocery stores and on-line, and the coffee tastes terrific! It's saved my countless trips to Dunkin Donuts, with a cup that is just a delicious. There's no waste, since you don't need to brew a whole pot for just one or two cups. The coffee brews at a nice hot temperature, which can be adjusted to taste. You must remember to descale the Keurig every 6 months or so, or you could end up with a blocked water supply, like we did. A quick call to Keurig's toll-free number helped me correct the"}, {"rating": "5", "user": "mama", "raw-text": "Bought this Keurig and had trouble with the pump also. Called Keurig customer service and they were very helpful. Very nice to deal with and sent me out a new one with no problems..New one has been working great. I Love my Keurig."}, {"rating": "5", "user": "rigger", "raw-text": "Pros: Multiple Settings; Stylish; Easy To UseCons: LeaksLess than a year old and has started leaking. Come into the kitchen some mornings to find water all over the counter."}, {"rating": "5", "user": "from", "raw-text": "Pros: Easy To Use; Stylish; Accommodates All Cup Sizes; Multiple SettingsCons: NoisyI love our Keurig which we've had for several years. We bought it at [...] and buy Newman's Bold coffee. My only gripe is with the noise... oh, and recently it started not filling the cup completely. I've started using the small cup option and it works fine. Would definitely recommend one. Don't want to buy a new one with the \"quiet\" technology until this one gives out!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; single serve; brews quickly; tea, coffee or hot chocolate; funCons: a bit more expensive but worth it!We have owned this Keurig Brewer for about 2 years and we absolutely love it! It makes an amazing cup of coffee without any mess. Once warmed up, you can have a perfect cup of coffee in under 30 seconds.We are infamous for wanting coffee after dinner or in the middle of the day, so it's perfect for our 2 person family when we don't want to make a whole pot of coffee. We also love the variety that is available. We have sampled everything from tea, to hot chocolate, to exotic blends and haven't found anything we didn't really like.The drawback is that the k-cups can be a little pricey if you drink as much coffee as we do in our household. The best buy we have found is to order through amazon, and their subscribe & save program. This makes 50 kcups under 20 dollars. Usually you can by 18 kcups for 10.00 at Target, Bed Bath & Beyond etc.The personal k-cup is also a good investment to allow you to put your own blend into the k-cup. This is a little messy, and more difficult to dispose of, but a cost effective option."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; single serve; no more large pots of coffee; brews quicklyCons: K-cups are expensive; a bit more expensive but worth it!I got a Keurig B30 Mini coffee maker as a gift when I had my first child. It was great and served a purpose for the time being. Then I found that my mugs did not fit under it and I needed to upgrade. I just received the B60 as a gift (for the birth of my second child). I LOVE IT!!! It has 3 cup size settings and a huge water reservoir so there is no need to refill the water after every cup of water. This is a great coffee maker for entertaining as well. Your guests can choose what they want to drink, the cup size, and there is no need to keep filling the water tank until you have served 5 or more drinks! There are over 200 varieties of coffee and tea to choose from so there is something for everyone. I use it for Coffee, Tea, and even Iced tea. My husband uses it for Hot Cocoa. It is the perfect coffee maker for those families who don't all drink the same beverages. There is no wasting and entire pot of coffee."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; single serve; no more large pots of coffee; brews quickly; tea, coffee or hot chocolateCons: K-cups are expensive; a bit more expensive but worth it!I just purchased a new Keurig B60 Special Edition coffeemaker from BJs. This replaced my old B60-- which lasted over 5 years. I know most people do not think that is long-lasting-- but I use this EVERY DAY- at least 5 times per day. There is a Dunkin Donuts right across the street from me--where I used to spend $5-$6 per day on coffee-- so the Keurig really saves me a lot of money!The BJ's special package came with the B60, 60 K cups and a reusable filter. I always used the reusable filter with my old B60 because using your own coffee is less expensive-- those K cups can be pricey even with a coupon. It only takes a few more seconds to use your own coffee instead of the cups.This coffee maker is so easy to use- and so convenient. I am the only one in my household who drinks coffee- so making a cup at  time lets you have great tasting coffee- every time. I have purchased hot chocolate k-cups for the kids-- they love it and can even make their own."}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Accommodates All Cup Sizes; Easy To Use; StylishI bought my Keurig thinking since I was the only one to drink coffee a single cup brewer would be best. However, my whole family is enjoying it. I enjoy coffee and tea, my children enjoy the hot cocoa, and my husband enjoys his iced tea. You couldn't ask for a better beverage machine. It is quick, easy (my 8 year old makes his own cocoa) and so easy to clean up when finished. It looks great on my cabinet with the metal basket full of our favorite k-cups. All of my friends want one now!"}, {"rating": "5", "user": "-", "raw-text": "My daughter in law had been eying these and I surprised her with one for her birthday. I investigated and the B60 had 3 cup size settings. She loves it! My son is a Capt in the Marine Corps and when he deploys this is especially nice as she can do her coffee/tea/hot chocolate cup by needed cup! I would highly recommend. Price was very competitive and of course the O Club shipping was great! My mother gave her the coffee stand to match so all was very well received and got a big thumbs up!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Durable; Excellent Easy to use; Stylish; Easy To UseCons: Not terribly portable; None for meGreat machine. Easy to use. Easy to clean. Quick and easy and good coffee. Not terribly portable but I don't need to move it often. Would be great for office and home use. Impressive."}, {"rating": "5", "user": "-", "raw-text": "After debating for almost 1 year, I finally decided to give this a try. They seem to be doing well and hopefully the kcups will be around for awhile. I did purchase it elsewhere for the same price but it also included a kcup and samples. I like the side water chamber which is easy to remove without pulling the unit out from the corner counter underneath some cabinets. And the display is easily visible in the dark corner where we have it located. I find navigating the menu a little difficult but hopefully that will change with continued use. I normally don't register my devices, but this one came with an excellent offer for kcups and I highly recommend you go online to register yours just to get that offer. My husband and I get up a different times for work and this has allowed us both to have fresh coffee without the waste. The only reason I didn't give it 5 stars is due to the overall cost. It'd be nice if the kcups were just a little cheaper.Tully's Kona Blend coffee and Cafe Escapes Chai Tea Latte are my absolute favorites."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; no more large pots of coffee; single serve; brews quickly; easy to read display; tea, coffee or hot chocolate; funCons: K-cups are expensiveI have been in love with this machine since the day I got it 2 years ago. I found with a regular machine I would drink way to much coffee just because it was there. I also hated making coffee because I had to do so much. Like add the water, filter, coffee. Then clean it. Turn it off...With this I just drop in my coffee cup (looks like a large single serve creamer cup) push a button and I am done until the next time I want coffee. I now drink 1 cup in the morning and I am happy with that. I tack out the old coffee cup when I make my cup the next day. I have to fill it about once a week.It is also very easy to clean."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; no more large pots of coffee; single serve; brews quickly; easy to read display; tea, coffee or hot chocolate; funCons: K-cups are expensive; expensive to useI first used a Keurig coffee system at the place where my husband gets his hair cut, which caters to men. The self-serve coffee bar was interesting and fun to use. I am cost-conscious, so I was intrigued by the idea of making only one cup at a time, on demand. I also liked the speed - coffee in only 30 seconds, brewed fresh and steaming hot!I researched the various one-cup systems and kept seeing rave reviews for the Keurig. I priced them out and found the best deal at Costco, mainly because it included an extra-large supply of the individual servings, or \"K-cups.\" Brought it home, plugged it in, filled the reservoir with water, and read the instructions.Using the Keurig really is easy. You simply lift a handle to expose a place that holds one individual serving of coffee grounds, which Keurig calls \"K-cups.\" They are conveniently packaged in containers about twice as big, and almost the same shape as, those tiny Coffeemate creamer cups. Set the K-cup in the holder, lower the handle, and select your serving size (basically small, medium, or large). And make sure your coffee mug is in place to catch the hot coffee that steams out underneath. If you forget to place your coffee cup there, the coffee still comes out!There are several settings on this machine that make it even handier. You can set"}, {"rating": "5", "user": "-", "raw-text": "Pros: Durable; Stylish; Multiple Settings; Accommodates All Cup Sizes; Easy To Usemy wife gave to me for Christmas I love it. we also purchased the gourmet single cup . this works great for an added change and helps to keep the cost down."}, {"rating": "5", "user": "in", "raw-text": "Pros: Stylish; Durable; Easy To Use; Accommodates All Cup Sizes; Multiple SettingsI received my Keurig as a Christmas gift in 2007. By far and away the BEST gift I have ever received. I used to make a pot of coffee every morning and throw half the pot out, because on most days my husband would only have one cup. Also, I love flavored coffees and he is a half caff man..... Our children use it too... they were the talk of the town last winter.... talk about making fast hot chocolate..... I cannot say enough about this machine.... I am on the cafe' express and LOVE it too. I have given several Keurigs as gifts as well...... So, So worth it....and talk about the time and money savings of not paying $5 for a cup of coffee from the drive thru places......"}, {"rating": "5", "user": "-", "raw-text": "I had a Keurig machine at my office and got hooked on the convenience. Your cup of coffee is ready in less than 60 seconds.So I bought this machine for my home. My other half was a little skeptical at the cost at first, but now he loves it too. It saves a lot of money actually because since we got this, we stopped buying coffee at our local coffee shop. See, the problem with traditional coffee machines, besides wasting leftover coffee, is that he likes his coffee strong enough to put hairs on his chest, and I like mine more \"normal\"...like what you would get at a restaurant with breakfast.This machine allows him to make his coffee more concentrated and me to have mine how I like it...just with a one-touch button. The bottom tray comes off easily if you want to make coffee for your tall travel mug. And I bought (also from Macy's) a reuseable filter and cup insert, for lack of a better description, that actually allows you to use your own coffee at home rather than buy the K-Cups if you really want to see more savings! The K-Cups run about $10 - $12 for a box of 20. The reuseable filter is about $10 and you just wash it and its ready to go for the next batch of coffee.Pros: Quick, easy, inexpensive alternative to coffee shop coffee. Easy to use, versatile cup size/strength of brew. Optional reuseable filter (sold separately) is a must if you want to make coffee stronger/weaker and is less expensive than buying K-cups.Cons: Haven't figured how to take it apart to clean it (we"}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Accommodates All Cup Sizes; Easy To Use; Durable; Multiple SettingsBest way to drink coffee, HANDS DOWN!! Not only a fresh cup everytime, but variety is only moments away. When friends come over, my Keurig is the star of the show!! I have given 10 different people brewers as gifts and they all love them."}, {"rating": "5", "user": "convert", "raw-text": "Pros: Easy To Use; Accommodates All Cup Sizes; Multiple Settings; StylishI now have a new reason to get up in the morning! I find myself an earlier riser now that I have this. I was an instant coffee drinker (1 cup a day) until I went back east where my sister-in-law had a B60. After a great cup of French Roast I decided I would buy one as soon as I got back to California. I am NOT sorry!That was last month and now I drink two cups of regular and two cups of decaf every morning. I have bought a lot of samplers and am letting my taste buds dictate what I buy in bulk.As regards the noise, so what! It isn't nearly as bad as my kettle whistle which made the neighbor's dogs bark. As regards weak coffee, just match the right roast strength to the right brew size and you will get a full bodied drink. I like French Roast but the Dark Magic Extra bold is my favorite along with the decaf version.The auto on/auto off feature is great. I set the auto on to 4:30 a.m. and it is waiting for me to brew coffee when I get downstairs.I liked it so much I bought one for my best friend for Christmas."}, {"rating": "5", "user": "2", "raw-text": "Pros: Accommodates All Cup Sizes; Multiple Settings; Stylish; Easy To UseCons: Fragileeasy to set up and easy to use. makes great tasting coffee.a little concerned about how durable it is after reading some other reviews, but customer service seems good"}, {"rating": "5", "user": "S.", "raw-text": "Pros: Durable; Easy To Use; Stylish; Multiple SettingsChoose one of these to give as a wedding gift to some couple. Even if they aren't now coffee drinkers, they will be after they get one.I try to talk every one of my coffee drinking friends into buying these. A great great product!!!"}, {"rating": "5", "user": "Own", "raw-text": "Pros: Durable; Accommodates All Cup Sizes; Multiple Settings; Stylish; Easy To UseI have had my brewer since December of 2008. The only problem I have ever had was occasional grinds in my cup. I called Green Mountain and they explained that since I use the stronger coffee which contains more coffee per K-Cup, I needed to lower the handle a bit slower to let some of the air release before brewing. The solution worked perfectly. I've taken this brewer to my office because I have recently received the Platinum Brewer with quiet brew technology for my birthday. I also bought my BF the travel sized brewer. I use only bottled, filtered or reverse osmosis water in the brewer and I think it lends to it's longevity as well as being gentle with it. Diner coffee is not even drinkable to me at this point. What would I ever do without this wonderful invention?! Oh, and a tip. Since this brewer can be loud when pumping water into the resevoir, it may shimmy accross your counter occasionally. I thought my BF was moving it! I bought some rubber shelf liner at the store, cut it to fit under the brewer so it can't be seen and it stays put! An inexpensive solution. :)"}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Good coffee when it worksCons: Turns off randomly; Short cupsI got my original machine and it made the perfect coffee/tea. However after about 2 weeks it started short cupping me when it gave me water at all. I went through the whole cleaning thing with the tech support and nothing fixed it. They sent me a replacement and it again worked for 2 weeks or so and started doing the exact same thing. WHEN it works properly the coffee or tea is awesome. However It seems like I am getting 1 or 2 good cups for every 5 or 6 bad ones so it is very expensive and frusterating to get a cup of coffee."}, {"rating": "5", "user": "-", "raw-text": "I purchased the Keurig B-60 the end of June and have been loving it ever since.  I never thought I would spend this type of money on a coffeemaker; however, I was hooked on it since using one at a friend's home.  I love the convenience of making one cup since I am the only one in my household that drinks coffee.  Yes, the k-pods are a little pricey and averages about .50 cents a cup, but it is well worth it.  I love the 3 features to brew using different size coffee cups/mugs.  I combined my purchase when this was on sale at Kohl's and I had a 30% off coupon.  Also if you register your Keurig on line, I was able to purchase 4 boxes of pods for the price of 2 and received free shipping.  I will never go back to a regular coffee maker."}, {"rating": "5", "user": "the", "raw-text": "Pros: Easy To Use; Stylish; Multiple Settings; Accommodates All Cup Sizes; DurableMy brother got me into the Keurig machine....thanks for that!! I love the convenience of it...the quickness of it...the simple features and the cleanup...then you have all the coffee choices, hot chocolate or whatever you may like..I use it all day and nite..I even let my husband use it on the weekends but he has his own coffee pot during the week..this is a luxury for him on the weekends! ..Thanks so much for a great product and I recommend it to everyone I talk too...."}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Accommodates All Cup Sizes; Easy To UseCons: Refused to exchange; Expensive for 2 mos; Broken in monthsOur coffee machine began having problems with coming on in the middle of the night by itself. It started brewing the wrong size cup selected and made a mess. We called customer service on multiple occasions for help but they just keep saying to unplug it and try again. That was their only help. It has now been almost a year with constant difficulty and now it won't work at all!! I love the idea and am looking at another machine but am not sure if it is worth putting the money into it. I will definitely pick a different style."}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Easy To Use; Durable; Multiple Settings; Accommodates All Cup SizesThis brewer just came today. Absolutely love it. It is easy to program and it brews the coffee quicker than any classic coffee pot I've ever seen. Love that it accomadates the My K-cup as I have tons of ground coffee to use up. K-cups taste better though. I refuse to go back to a regular coffee pot."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great taste; no more large pots of coffee; single serve; fun; tea, coffee or hot chocolate; easy to read display; brews quicklyCons: A bit more cost than conventional pots; K-cups are expensiveI am a coffee addict and lover. I'm addicted first thing in the morning and love a few more cups throughout the day. I've struggled to get the perfectly brewed cup, and since I am the only coffee drinker in my household, I struggle with making a few cups instead of the entire 12 cups. I was skeptical about the Keurig single cup brewing system, because, let's face it, it sounds a lot like instant coffee!Each K-cup (and there are literally hundreds of origins and flavors to choose from) contains the perfect grind and measure in a little vacuum sealed container. The pamphlet recommends using filtered or bottled water - which tastes amazing, but tap water works just as well. You can customize the serving size, small, med, large, with the touch of one of three buttons.And that's it. Three buttons. Well, there is also the power button and settings button. So five total. Very simple and easy to use. The setting button allows you to set the time and even have an auto brew time. Although, I think this is unnecessary. It takes only seconds to choose your coffee, place it on the brewing machine, hit start, and have fresh coffee in your cup.The machine is a bit pricey, but it is amazing for single servings and time management. If you have a whole housefull of"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; brews quicklyCons: A bit more cost than conventional pots; expensive; high priced; k-cups are expensiveIm not a huge fan. I like that it is quick, I like that it is easy cleanup, there are reusable k-cups available. But i found the coffee to be not that strong. I like a nice dark cup of black coffee and this seemed a little week. I use two k-cups to make one cup of coffee and its still just ok....not great for a $100 peice of equipment....."}, {"rating": "5", "user": "about", "raw-text": "Pros: Stylish; Multiple Settings; Accommodates All Cup Sizes; Easy To Use; DurableWe love this coffee maker!! Had a platinum for a year and a half and used it constantly, even traveled with it to a family reunion, over the holidays, where it was a hit. Everyone loved it, including the kids, where hot chocolate was ready in seconds. We have now purchased the B60 and love it even more than the platinum, it is so quiet. I even purchased a mini, which my son is using while out of town. Coffee doesn't get any better!"}, {"rating": "5", "user": "-", "raw-text": "Pros: quick, efficient, simple to operate, and a good cup of coffeeCons: haven't found it yetI bought this coffee maker for convcenience and ability to make coffee when only one or two cups were wanted. This coffee maker is both convenient and produces a fine cup of coffee, tea, or hot chocolate. You pick the cup size and it does quite a good job of filling the appropriat cup.This is a quick operating machine, you can use the K-cup of many differ. companys or your own grounds with the optional attachment which I found works very well with little problem. I love this machine."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great to have a selection of coffees one cup at a time.Cons: Potential quality control issues with the coffee maker.I got this coffee maker in early January. I'm expecting a replacement at the moment. That means, 1) there were problems, but 2) Keuring promptly and considerately addressed them.Like many other on-line reviews have indicated, some units fail after only a few weeks. Mine became problematic after about five weeks of light duty.As indicated in other reviews, Keurig offered no resistance by offering to send a replacement. Their customer service agents are well trained--kudos to them.But, I wonder if the problem with my first unit will recur."}, {"rating": "5", "user": "-", "raw-text": "I love my new coffee maker. Easy to set up, easy to use.I usually drink one cup of coffee daily, so this is perfect for me. It's economical and now I don't have to leave my house early to buy coffee before I get to work!!! ..."}, {"rating": "5", "user": "in", "raw-text": "I have owned this Keurig brewer since December of 2008. I believe I purchased it as a TSV that year. I remember my husband wasn't too happy about my purchase, but I assured him it would save us money in the long run. My brewer has worked incredibly well for the past three years, and it is still going strong. I believe it has saved us money over the last three years.....not nearly as many trips to the coffee shops. I am now upgrading to the Cuisinart brewer and looking to pass my original one on to someone else. Other than having to descale the machine, there have been no problems to speak of. Thank you Keurig for the wonderful product."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to use, fast, hot, less expensive per cup than coffee shopCons: have to brew two k-cups to fill travel mug, cannot find flavor I love, pods can get spendy if not usedI bought this for myself to replace my Starbucks run each morning but so far, I'm still going to Starbucks. I just cannot find a flavor I like but I think that is just me since my husband loves the Keurig, especially trying out all the different flavors. I mostly just use it for hot water to mix in my Big Train Chai mix. I'm not a black coffee drinker so I think that's why I'm not finding a flavor I like. Is it so much to ask for a chai latte or cappuccino flavor that doesn't taste like sugar water?Pros:-Easy to use-Fast-Hot!-Less expensive per cup than coffee shop"}, {"rating": "5", "user": "-", "raw-text": "Pros: Programmable, holds 48oz of water at a timeCons: Only holds 48oz of water at a time.Very easy to set up the programming. Turns on fast ready in 2 mins! I would definitely recommend this to any Tea or Coffee drinker!"}, {"rating": "5", "user": "-", "raw-text": "Pros: GReat Coffee - FastCons: PriceI would recommend this product to anyone. I have one at work and just bought one for home. I love different types of coffee, my wife like to drink tea, and my daughter uses it to make hot chocolate.It\u0092s a little pricey, but that's the price of convenience."}, {"rating": "5", "user": "-", "raw-text": "Cons: Poor Quality; A bit more cost than conventional potsMy office decided to purchase a Keurig Special Edition brewing system as a gift for employees to start off 2010. We received our machine the last week of January and everyone loved it. About four weeks later we started having problems with the brewer. It would turn on, say 'not ready' for several mintues and then shut off. We called customer service and were told that our machine was part of a defective batch and they would send another one out in two weeks. We were finally able to have them send it via 2 day shipping so we didn't have to wait and got our new machine later that week.Five weeks later and we start having the same issue with the machine. We again call customer service and a tech walks us through a bunch of troubleshooting steps and decides that we once again were given a defective machine. We were then told that they made too many machines too quickly before the hoilday season and many of them have problems. They would send us another and are confident that this one is fine. On top of it all the customer service rep is rude and very unhelpful and pretty much just tells us to shut up and deal. Nice.Flash foward another 4 weeks and once again the machine is broken. Our third machine is now not working and we have run through the troubleshooting ourselves since we know all the steps. I once again call customer service and get a woman who is actually nice and embarassed at what we've gone through. As an"}, {"rating": "5", "user": "-", "raw-text": "I registered for this keurig because when I went to Macys to register the lady helping me offered me some coffee from this system. One sip and I was in LOVE!!! It was so easy to use and So many times I have just wanted one cup of coffee but did not want to make a whole pot. Not only because I did not want to waste but also because I hate clean up. This Is SO easy to use and all you have to do it remove the k cup and your cleaning is done!!Buy this and you won't be disappointed!!"}, {"rating": "5", "user": "-", "raw-text": "I got this as a Christmas gift for my sister and her husband. They were used to a machine that, on a timer, would grind coffee for and then make a nice pot of coffee. They LOVE the entire coffee process from making it to drinking the first cup to heating up more later on from this pot of coffee. Having heard great things about the Keurig, I was convinced they'd love not only the first cup of coffee....but also the third and fourth (of decaf!!!) that would be freshly brewed, not reheated in the microwave. It was VERY easy to set up. It was easy to use. The hubby loved it made for the largest cup. I could tell my sister was less than pleased. So I decided to \"play\" with the strength button. Voila!!!!! Made on the 'smallest cup\" setting, my sister got the strong cup of coffee she loves. It's nice that both she and her hubby can make the perfect strength coffee they each love on demand. It's also nice to be able to select which kind of coffee they each want to drink, having a great variety of the k-cups already made up. They even got ME to try a cup...and I'm not a coffee drinker/....and I loved it!! This one's a winner and I would buy it again. As a gift!!!! ..."}, {"rating": "5", "user": "-", "raw-text": "Funny, I was just planning on writing my review today when I got a call from my mom saying...it just stopped working!!! LOLShe contacted customer service and they went thru different steps but couldn't get it to start working again. Luckily we called Best Buy and even though she didn't have the receipt on her, they let her call me so I could provide the information over the phone. She's got a new one so we'll see if this one lasts more than a month! But overalll....she loves it!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to use; makes great coffeeCons: K-cups are expensive; probably not the most environmentally-friendly.I received the Keurig Coffee Maker for Christmas, so I've been using it for only a short time. I love the convenience of making a single cup of coffee. It's easy to use; I love the programmable features. This model lets you choose from 3 differenet cip sizes, which is a great feature."}, {"rating": "5", "user": "-", "raw-text": "Pros: Makes clean, great tasting coffee.Cons: The price!I bought this for my girlfriend as a Christmas gift and it has opened our eyes to a whole new world of premium coffee flavor. I would recommend also getting the My Reusable K-Cup since the K-Cups are quite expensive. You'll thank yourself later! Enjoy!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Hot delicious coffee in a minute, convenience and selection of K-cupsCons: K-cups tend to be pricey!I have owned this Keurig Special Edition for over 2 years now, and although I still have my 10 cup coffee maker, this one hits the spot for immediate on-the-go days, or just for a change of pace for a multitude of selection of Keurig coffees. The coffee and tea in the K-cups remain fresh and ready at a moments notice. This brewer has settings to dial in to make your cup-o'-joe at what temperature you like, to the size of cup you desire. My kids really liked mine, so I started the trend of getting them a Kuerig too, so now my older son really likes his Special Edition, because he just doesn't have time to make a full pot."}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Love choice of size cup; Stylish; Fast; Easy To Use; Accommodates All Cup SizesI enjoy a stronger coffee than my husband this way we can brew each cup the way we enjoy it. No messy coffee grounds to deal with anymore. I can enjoy my favored coffee while my husband prefers unfavored. The selection of choices is wonderful.Highly recommend."}, {"rating": "5", "user": "-", "raw-text": "This machine is so easy to use and I LOVE it!!! Be sure to read care instructions, only use filtered water and you shouldn't have any problems. I did read a few reviews about the noise, but I have had no issues with noise at all. Every morning @ 5:20am I use it, our bedroom is right next to our kitchen and even with the bedroom door wide open, you can't hear it. Highly recommend it! ..."}, {"rating": "5", "user": "Swede", "raw-text": "Pros: Easy To Use; Fast; DurableBought for small office about a year ago. Brew 5-15 cups per day without any problems. Rinse out parts with soapy water every week or so and keep getting great cups of coffee."}, {"rating": "5", "user": "-", "raw-text": "Really needed coffee this morning after a late night and my Keurig would not turn on. Tried everything, still not working. Bought is as TSV and got it the first week of dec 2010 so had it about 13 months.. it has always been temperamental like a lot of the other reviewers have stated. Since its over year long its not under warranty. I love the idea of making single cups but not if I have to buy a new $160 coffee maker every year..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Accommodates All Cup Sizes; Multiple Settings; Stylish; Easy To Use; DurableI love this machine. I drink 2 cups of coffee in the morning and tea or cocoa in the evening. This machine is so quiet. I love the timer setting. It is ready every morning when I get up. I'm having fun experimenting with all the great flavors of coffee, tea, and cocoa. Haven't found one that I don't like yet."}, {"rating": "5", "user": "-", "raw-text": "Pros: Hot, fresh coffee, 1 cup at a time; So many flavors; Easy to use. No wasteCons: K-cups are expensivePROS:Large water tank, so you don't have to fill up constantlyThree different brewing sizesRemovable drip tray, so even the tallest travel mug will fit under it"}, {"rating": "5", "user": "Venerable", "raw-text": "Pros: MAkes coffe, does what it says.Cons: Price per cup is VERY high (compared to buying a bag of coffee). Strength varies by the size of the cup you brew.While my understanding of coffee brewers might only be average, my understanding of a good cup of coffee is VERY high. This machine is in no way outstanding, If you put in good stuff you get out good stuff. If you use inferior stuff you get inferior coffee. Strength is fixed (depends on size of cup & sequence). I do NOT recommend this to my friends, I warn them NOT to buy one. The only truly outstanding aspect is the HIGH PRICE per cup. Available varities are limited at any price."}, {"rating": "5", "user": "-", "raw-text": "My sister and I have stopped going thru a fast-food drive thru in the morning ($$$$) and are making our \"to-go\" coffee and tea at home! It tastes better and is less costly. We also do not add to the landfill with styro cups to throw away! For it to be most cost effective we have the personal K-Cups (ordered several at another site) and have them ready and waiting in the morning. I doubt I will purchase many k-cups unless I find a really good deal!I love having the water hot and ready to go when I get up! I do not know why I waited so long to make this purchase -- I am so happy with it and cannot imagine going back to the \"old\" way!"}, {"rating": "5", "user": "-", "raw-text": "Oh my new bff how have I lived this long without you??? I purchased the Platinum Plus on black friday (which should have its name changed!!. ). Thank you QVC FOR YOUR AFTER THANKSGIVING WONDERFUL \"PLATINUM\" Friday Sale!!!! What a wonderful deal! I love it! Love it!!! And I received 62 kcups to try, to see which ones are my faves, plus a coupon for 2 boxes free from Keurig!! I dont know how I have lived this long without you, seriously!! Hot water right there, all the time! It saves energy & moneyand that cup of coffee is there instead of waiting forever for that gurgling pot of coffee to fill up only to waste most of it!!! It really saves money!! Energy!! and water!! Thank you Keurig and QVC!!!(Now I just have to purchase something to keep my kcups in!)"}, {"rating": "5", "user": "-", "raw-text": "We purchased the Keurig B60 a few weeks ago to replace another brand of pod-style coffee maker. We've been so happy with the switch. The timer function works great - we set the machine to \"wake up\" at 6:00, so whenever we come downstairs, the coffee is one button-push away. The 3 different cup size options work well for getting just the right strength brew, and the spout is tall enough to fit a large travel cup underneath. Definitely worth every penny to splurge on those extra features! ..."}, {"rating": "5", "user": "-", "raw-text": "I own this coffee maker myself and it is a blessing to my husband and me! We no longer have to throw out so much brewed coffee. All you do is make enough for one cup and it's ready in 30 secs....I love this thing!Brew PerformanceThe coffee is always hot. Taste is wonderful -- just like it was brewed from a full pot of coffee. Very quick brewing.Ease of CleaningVery simple cleaning...could get tedious cleaning the filter for each cup of coffee.Ease of Use"}, {"rating": "5", "user": "Lady", "raw-text": "Since my husband needs decaf due to heart and bp issues and my son loves full caffeine we bought this to save on discarded half posts of coffee. I found the tea to be the pleasant surprise. I normally keep 2 pitchers (half gallon size) of iced tea one regular and one decaf (for after 8 pm). Once I tried the Keurig iced and hot tea I was able to get rid of them and free up space in the frig. The iced tea is so fresh and even the southern sweet tea is not overwhelming. Now I have hot/iced decaf or reg any time of the day or night. We love love love our Keurig."}, {"rating": "5", "user": "-", "raw-text": "I had a problem, I needed a coffee maker that made single cups becasue I don't drink coffee often and I am picky about the coffee I drink. The B60 solved this issue for me. It uses a K-cup which is a mess free pre filled amount of coffee, just stick the cup in the maker and push the right cup size. It brews coffee in 30-45 seconds and its' hot and ready to go, plus it re-filles right away so someone else could use it right away. It stores about 45 oz. of water it a fill container on the side, no filling every time you want a cup. The K-cup comes in different types of coffee, tea, and hot chocolate, so if you have kids they could use this machine. It is worth every dollar and is built strong, and easy to use. I would recommend this to any coffee drinker out there.Clean, easy, fast, good value!!"}, {"rating": "5", "user": "-", "raw-text": "The Keurig My K-Cup Reusable Coffee Filter came with my Keurig Platinum Brewing Machine because I bought mine at Costco and it came with a ton of extras. Although I love the convenience of my Keurig, I was slightly disappointed with the strength of coffee and price of K-Cups, so I thought this reusable filter would fix all my problems. Well, as it turns out, I'd rather use K-Cups!The benefits of using a Keurig My K-Cup Reusable Coffee Filter are: you can use any type of coffee you want since you're not limited to K-Cups, and buying whole bean or ground coffee is cheaper than K-Cups.The downfall to the My K-Cup Reusable Coffee Filter is that it's a pain to use and clean. You have to pour your ground coffee into the little mesh filter, put the mesh filter into the plastic cone, and then put it in your Keurig. Sounds simple, but if you want to brew another cup, you have to remove the reusable filter, empty out the used grounds, wash the filter, add more ground coffee and do it all over again. If I wanted to do all that, I wouldn't have bought a Keurig in the first place. All the effort involved with the reusable filter negates the convenience and simplicity of the Keurig.The whole point of a Keurig is to make coffee super fast and that's why people buy them. If you want to mess around with ground coffee, save yourself some money and buy a traditional coffeemaker."}, {"rating": "5", "user": "-", "raw-text": "I started having problems with my Keurig just a few weeks after purchase. Just like in other reviews, it would not dispence the coffee. I eventually had to call Keurig's Customer Service and had to go thru troubleshooting all over again. It worked....for a few weeks. I called Keurig again this morning for the 3rd time with the same issue. Luckily, my Keurig is still under the 1 year warranty and they are sending me a new one. Odd though....they told me to send back the K-cup that came with the Keurig, but just \"THROW THE COFFEE MAKER OUT.\" Wow!!!!! Never expected to hear that. Two stars for concept only......finicky machine. Looks like they still need to get all the bugs out!"}, {"rating": "5", "user": "-", "raw-text": "I absolutely love not having the cost of wasted coffee from a pot. Seems we never drank all of it. I bought a Keurig and we love it. The first one shur down on me and I called the company and they replaced it within 5 days with a brand new one and re-started my warranty all over. Highly recommended."}, {"rating": "5", "user": "-", "raw-text": "If you like Keurig coffee this is a great machine. I set the machine to start heating the water a few minutes before my alarm goes off and it is ready to brew when I get up. The coffee cups are pretty expensive but that is the price you pay for convience."}, {"rating": "5", "user": "Fan", "raw-text": "Pros: Multiple Settings; Easy To Use; DurableThis piece of equipment is used in our office Mon-Fri from 6am to 6pm. I would estimate that we brew between 20-30 cups per day. Does a great job. Requires almost no maintenance. It's been on the job for over a year and still going strong."}, {"rating": "5", "user": "-", "raw-text": "We've had our B60 Keurig for at least two years, use everyday, and it still works like new. We only use filtered tap water (faucet type filter) because we have high mineral content. Occasionally I remove the water tank and drip pan for washing, and wipe the dispenser head, but that's the extent of maintenance.The k-cups are a bit expensive but so handy on a groggy morning. We've tried a couple of refillable k-cup gadgets with our own loose coffees. The ekobrew filter is my favorite, but they're all tricky to get the right grind--best flavor.I don't recommend brewing a second cup from the same k-cup because it tastes bitter. However, if you want a larger cup, brew twice (one large setting, then one small) in the same (huge) mug and stir. This tastes better than brewing the second cup separately.We use tea k-cups occasionally, but it's so simple to brew plain water and toss in a teabag."}, {"rating": "5", "user": "-", "raw-text": "I received this product 3 years ago, it worked well, though very noisy, for about 1 1/2 years, then it just quit. I emailed the manufacturer and the best I got was that they were sorry my product wasn't working and to call customer service if I needed more help...? I got very spoiled using this product and now I don't look forward to my morning coffee. Can someone set me in the right direction? I want my Keurig back!"}, {"rating": "5", "user": "-", "raw-text": "The best purchase I have made in a long time, it's perfect for me and my taste. I researched through several companies and this was the best price for the coffee maker. I absolutely adore it and it's very user friendly. ..."}, {"rating": "5", "user": "Grandma", "raw-text": "After wanting a Keurig for SO LONG---it took me that much longer to open my box upon arrival!!! But after opeing it, I was somewhat disappointed after its first use!!! Yes, it is a bit noisy, but very fast, BUT the coffee is not as hot as I like it--and I like my coffee HOT!!!! Also I had to go and buy the filter that holds your own brand of coffee. Can't figure out if I still need to purchase the special mini paper filters for it!!. Oh, yes, and one more thing I like a large cup of coffee and the three brew cup choices is still NOT big enough!! Suggestions on how to fill me cup? What I have been doing is selecting the middle cup size and going through ther cycle twice!!!??"}, {"rating": "5", "user": "-", "raw-text": "I absolutely love my new Keurig. I had the smaller one cup size and decided to buy the larger one for convenience. It is great to be able to have a larger cup if I decide."}, {"rating": "5", "user": "-", "raw-text": "Pros: Hot, fresh coffee, 1 cup at a time; Easy to use. No wasteCons: needs more variety of K-cupsWe have had a Keurig B60 in the house since Christmas. A family member received it as a gift. At first I was afraid to use it, new technology, you know, but my son patiently showed me several times how it worked and now I can use it myself.  It is easy to use, easy to clean and makes a great cup of coffee, tea or hot chocolate.  The other thing I like about it is that there is no mess to clean up, no annoying coffee grounds to get rid of.  You just throw the K-cup that you have used away.There is also a feature where you have a permanent cup you can use if you want to use just regular coffee grounds, your own favorite that isn't one of the Keurig K-cup varieties, that is also easy to use and made of hard plastic so it is durable.  This also makes a good cup of coffee if you use it correctly.  There are many varieties of coffee that we enjoy in the house that aren't included in the Keurig line so this feature makes the Keurig more versatile for us.I believe that once the price of the actual machine and the price of the K-cups come down some, this will be a popular device for any kitchen."}, {"rating": "5", "user": "Cat", "raw-text": "Once you have a Keurig, you will never be able to tolerate those old fashioned coffee makers again. I used to make a whole pot for one cup and throw the rest out. Now I have fresh brewed every time. I love the coffee, green tea and hot chocolate. All at the push of a button. The Keurig customer service is excellent if you have questions. My Husband likes to buy Dunkin Donuts coffee for Keurig. It's excellent! You can order coffee here or pick it up in the grocery store. I love it!"}, {"rating": "5", "user": "-", "raw-text": "It is upsetting to see all the negative reviews, you have no one but yourself to blame if you haven't tried to contact Keurig customer service. I love my machine, started having problems called customer service we went through some problem solving and when that did not work they said I would have a new one in a few days. So don't complain talk to them and you can experience the best cup of coffee, chai, or whatever your preference is. love love my keurig."}, {"rating": "5", "user": "-", "raw-text": "Pros: Convenient, easy and fast. Consistent cup of coffee every time I use it. Saves on wasting a pot for just one cup. Haven't been to DD's since - @ $2 per cup there, pretty good savings.Cons: Wish it could brew a LARGE cup. The largest setting fills a travel mug leaving room for cream - if you use it, otherwise it's an ok size.A bit noisey - but I guess that's part of the charm and warning you're brewing a cup.I have been using this for over a year and really enjoy the variety of coffee I can get.Average cost per cup is about $0.48 - pretty good considering it's perfect every time!"}, {"rating": "5", "user": "-", "raw-text": "I love my new Keurig. I live alone so making one cup of coffee at a time was the perfect solution for me. It's easy to use and a lot less cleanup than the typical coffeemaker. ..."}, {"rating": "5", "user": "drinker", "raw-text": "Pros: Accommodates All Cup Sizes; Easy To Use; StylishSo far I really like this coffee maker. Although the k-cups are a bit pricey, in the long run I am saving by not going to the local coffee shop every morning. I calculated that, by the end of the years, I will save about 200 dollars (even when I calculate the cost of the machine) by making my own coffee, and not going out to by it. Plus, I love not having to clean out the grounds from the coffee maker, or measuring coffee and getting it all over the counter. This coffee maker takes the mess and hassle out of making coffee. I have only had it for 2 months, so I can't speak to its durability. However, I can say that I am happy with it so far."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use, coffee is deliciousCons: small cups, pods are 1 useI really like the Keurig. I love all of the coffees I have bought and love using it every morning. I don't like the 3 sizes of cups: tea, coffee, and mug. But the mug size doesn't fill my car mug and the tea cup seems to be the size of a child's toy size tea cup. But I love it and I do recommend it!!!!"}, {"rating": "5", "user": "-", "raw-text": "Go get one, you will never regret it. I have no clue how I lived without mine. I begged for one for a gift and finally got it and now the whole family loves it. We use it for coffee, hot tea, cocoa and even hot apple cider, yes sider that is so yummy... I wait for fall just for it to come out and will stock up on it this year so we do not go through withdrawals. I woudl buy one for your home and for your office as well, because once you use it , it is so hard to use a regular pot, way too slow and if you are like me, you need coffee fast. How does under a minute sound for a fresh brewed , perfect cup of coffee, with no clean up other than the cup, awesome right?Brew PerformanceI love this, When I need coffee, trust me I need coffee. Even my grandkids will ask what cup I am on, because they know I do not function until I have had three,. this coffee maker makes the coffee in under a minute and is sooo hot and good. I love this because you can make anything in it form coffee to tea, hot chocolate and even a wonderful apple cider. I also bought the refillable cup , so I can use my own coffee blends andalso tea. I can make any kind of coofee known to man. And let me tell you a little about the iced coffee... before I got this I was totally addicted to a certain resturants iced coffee, stopped everyday and got a large. I am sure we all know how this can add up. One of the maon reason I asked for the Keurig is I kept being told how good the iced coffee was from the machine. I"}, {"rating": "5", "user": "-", "raw-text": "GREAT MACHINE If you do have a problem just call keurig customer service they will help. I did have a problem they told me different things to try it did the same thing I called them back and they sent me a new one. I have not had any more problems and its been over a year"}, {"rating": "5", "user": "-", "raw-text": "I am happy with this coffee maker. I had a one cup Keurig before but the coffee never seemed hot enough. This B60 has a temperature control so I can get coffee as hot as I want it to be. I am happy that I got it at Overstock's price which is the best price I saw out there. ..."}, {"rating": "5", "user": "-", "raw-text": "When our KitchenAid JavaStudio Programmable Coffee Maker with Thermal Carafe bit the dust, I wasn't surprised. It was used daily for many years. I seriously considered purchasing another KitchenAid coffee makes because our old one worked so well for so long. but after researching and reading reviews about the best coffee makers on the market, I changed my mind and decided to purchase a Keurig Special Edition Brewing System B60, instead. It cost a bit more than I had intended to spend when replacing our coffee maker, but the rave reviews I read convinced me that it would be the best bang for my buck, and I'm so glad I spent the extra money to buy this amazing brewing system!Brew PerformanceWow...this Keurig Special Edition Brewing System B60 brews extremely quickly! If you want a cup of coffee or tea, this machine can have you a freshly brewed cup in a about half a minute! Yes, that's hard to believe, but it is true and it is wonderful! It still amazes me how quickly this coffee maker brews a perfect cup of coffee or tea. I can't imagine another system having a faster or better brewing ability.Ease of CleaningWhat cleaning? The cleaning process for this product is almost non existent! The K-Cups that are used in the Keurig Special Edition Brewing System B60 mean no filters to empty and no coffee grounds spilling all over the place. It's not very hard to wash a coffee cup and wipe down the brewer once in awhile...and that's the only clean up you have when using this system!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Everything, simple to use. Makes great coffee in 30 secondsCons: nothing, exactly what we wantedMy whole experience with Bestbuy.com was great. They helped me with the shipping cost. The Coffee Maker came before it was suppose to. The Coffee Maker is just what we wanted & more. Thank You"}, {"rating": "5", "user": "in", "raw-text": "I see many people on here complaining about this product and blaming QVC for that. Yet, not one single person contacted KEURIG'S Customer Service to address their issues with the product. Both my sister and I have owned this machine and yes- we both experienced issues, although they were small concerns. However, we each contacted Keurig's CS line (a year apart) and each of us were immediately shipped not only a brand new machine, but an UPGRADED machine at no cost to us. They also included K-cups of our favorite flavors. We never asked for anything more than the part we needed to fix the machine ourselves, or advice on how to make it work better- and we were met with courtesy, quick resolution to our issues, and a very nice upgrade.People should stop blaming QVC for \"not selling a quality product\" if they haven't made any attempt to contact the MANUFACTURER to resolve their issues. The CS at Keurig was awesome and neither my sister or I have experienced a single issue with our new Keurig's- though if we did, we are both confident that one phone call to Keurig would quickly resolve any concerns immediately."}, {"rating": "5", "user": "-", "raw-text": "After more than a year of trying to decide, I FINALLY purchased this machine. Why, oh why did I wait so long? It's everything that we wanted and more. It's easy to operate - we had our first cup of coffee within 5 minutes of getting the machine. It's not noisy at all, and we're having so much fun trying all the different coffees. I realize that I have only had this machine for a few days, but I love it!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: tea, coffee or hot chocolate; Brews great tasting coffee; easy to read display; brews quickly; Easy; no clean-up; easy to use; great taste; no more large pots of coffee; single serve; A wide variety of coffee flavorsCons: there are noneI never would have purchased this, as it seemed like an expensive choice for a cup of coffee but....My husband received one for his 50th birthday as a group gift from some friends. They all knew he loves his coffee and several of them own one already. After only a few times of using it, we were hooked! Now he makes his coffee for himself every morning. It has a timer to turn on in the morning and it takes only seconds to brew a cup of great tasting coffee. Next to no clean up and while I thought it was pricey at about 35 to 50 cents a cup, he now does not pay for the $2 cup on the way to work and will even wait untilhe gets home for his second cup.We have tried many types of coffee and it you buy it at one of the big club stores like Sams or Costco, you can get the price down to  about 35 cents a cup.I own a bookstore so we upgraded to a little better model at home, moved the original there and now can make my customers a fresh cup one at a time instead of throwing out most of a pot each day."}, {"rating": "5", "user": "-", "raw-text": "I've had this machine for 3 YEARS and I've descaled it a couple of times, cleaned the needles out a few times and yes I've had to turn it off and let it rest. Other than the noise it makes when despensing it is a good value. My father has killed 5 different brands of 10/12 cup machines in the time we've successfully used our B60. When in doubt, read the book."}, {"rating": "5", "user": "-", "raw-text": "The Keurig B60 is just that....my new easy button! So simple, so delicious, so fast! I live by myself, so brewing a whole pot of coffee was so wasteful! This machine has actually saved me money! I don't have the waste I use to have! Yes, the machine is a bit pricy, I got mine at Kohl's when they had it on sale and I had gotten a 30% off coupon in the mail! The k-cups can get a bit overwhelming too. I have found 2 coffees that I'm in love with and one for hot tea. When Kohls has a sale, I whip out my coupon too and load up! I'm in love with this little beauty! I love the auto on and off feature. I set it to turn on right before my alarm goes off, get that first fresh brewed cup, then get on with my day. If my house were on fire, this would be one appliance that I would grab before I got out!Brew PerformanceFast, easy, so simple!Ease of CleaningWipe it down and you're good to go. The cup holder pops out for easy cleaning too!Ease of Use"}, {"rating": "5", "user": "-", "raw-text": "I purchased this in November 2010 as a TSV. Worked fine until about a month ago. Now it rarely makes a cup on the first push of the button. Usually have to turn off and on and even unplug and replug to get only a half cup. After repeating the on/off process several times it will start to brew and overrun the cup. We seldom use K cups, usually use the my K cup and our own coffee, so I doubt the needle is clogged. Have descaled and still no luck. Plan to call customer service, but according to other reviews I have read, it probably won't do any good. Not a good quality machine for being such an expensive machine. Will not be replacing with another one, just go back to a regular coffee maker."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy To UseCons: Poor electronicConvenience is great. The electronic is faulty.Will not dispense water and no way around it. If electronics doesn't function, it's useless."}, {"rating": "5", "user": "cleaner", "raw-text": "Pros: Stylish; Durable; Easy To Use; Accommodates All Cup SizesFor those still \"waiting on the fence\" about purchasing a Keurig... I've owned mine for 2 years now and its the best \"investment\" I have ever made!!! Saves me over $4.00 a day by not stopping at the Coffee shops to buy a cup of coffee so as a result, in the 2 years I've saved over $2400.00 by not stopping twice a day and spending $4.00 each trip!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast; Easy To Use; Multiple SettingsCons: Limited Cup SizesSo far this thing rocks!Love the idea I can choose different flavors! Hint: 1. shake your k-cup before brewing!to get best flavor! 2.I use a pitcher or bottle water to fill reservoir since it is kinda flimsy 3.(out of warranty) I have found if your getting less cups of coffee after brewing,Turn unit off,unplug, turn unit upside down,give it a good wack! on right side of unit,and try again! Hope this helps!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; great taste; quick; Saves us a ton of money!; funAnyone who knows me well enough to come over to my house, knows that I am addicted to my Keurig machine!  Now the funny part about that is I don't even drink coffee or tea!  However, my husband loves his coffee and tea and I was tired of seeing him spend money each day at the local coffee shop!  There is a huge difference in the price he was paying for his morning coffee and the price I can make it at home for him now.  The problem before our Keurig is that my husband is not one to drink an entire pot of coffee, likes it fresh brewed and wants to have choices in his flavors.  The Keurig has solved all of these issues!  I bought our machine for him 2 Christmas's ago and we figure that the savings have paid for the cost of the machine at least ten times over by now.  It is so simple to use and brews a fresh cup so quickly.  I enjoy the fact that I can also make hot cocoa with it.  And it is fun to use!  Everyone who comes to our home immediately gets offered a cup...mostly because I love making it!  Several of our friends now own their own machines as well.  I highly recommend this product!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Easy To UseCons: Limited Cup SizesI love the machine. However, it does not fill the cup and it takes too long to heat up for the second round."}, {"rating": "5", "user": "lover", "raw-text": "Pros: Easy To Use; Accommodates All Cup Sizes; Multiple Settings; StylishCons: NoneThis machine has saved me money. First off all we don't have to toss half a pot of coffee. I take my coffee to go! I leave before the sun gets up. So, my husband and I don't have to try and find an open coffee shop. We are ready to go. I find it also is a safety factor. Since, It saves me from having to feel nervous in a dark drive thru. Plus, you can have what type of coffee you want. I love the Cafe Mocha and my husband likes the Dark Coffee Blends. It's just perfect for my household. Thanks"}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Easy To Use; Fun coffee choices; FastWe have had this unit over 2 1/2 years - I've never had a coffee pot that lasted this long. We LOVE it as much now as we did at the beginning! We have the machine \"on\" 24/7 - it really gets a workout. K-cup pricing is comparable to purchasing premium beans and grinding them yourself, plus we have fun trying the different variaties.About 5 friends have purchased one after trying ours!"}, {"rating": "5", "user": "-", "raw-text": "I received this coffee pot for christmas and I love it alot. The convenience is great. you can either use kcups or you can buy a filter system to use your own coffee brand. I've used both and there both very easy to use. the nice thing is you brew one cup at a time which means no burnt coffee because it won;t sit for hours. If your like me I don;t make it through a pot of coffee before it gets burnt! I enjoy the 3 different cup sizes so you can choose what size cup, which strength of brew. they have a 3.5 oz cup for stronger brews, 8.5 oz cup for regular brews and 10 oz cup for travel size. I like to use the 3.5 oz cup because I like an extra strong cup of coffee. the ease of filling the water reservoir is great you can fill it with a cup or you can remove it and fill it under your faucet, and there is a blue light that flashes when you need to refill. everything is one touch and simple to use. Awesome machine I recommend it to everyone."}, {"rating": "5", "user": "loves", "raw-text": "Pros: Easy To Use; Stylish; Fast and cleanCons: Died after only one yearI loved this machine for about a week because it was a new toy. It served its purpose for my first cup of the morning fix. But after a year of use, it died [...] The coffee is not always consistent in taste of flavor - not sure if that's a problem with the K-cups or the machine. Its fast and easy to use - but I found myself falling out of love with it pretty quickly and hitting my favorite coffee bar on the way to work more often than not. I will replace this machine with a grinding brewer."}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Durable; Quick brewing; Easy To Use; Stylish; No MessCons: Noisy; Limited Cup SizesFirst off people talk about it being noisy. It is only noisy when drawing water from the resovoir, which isn't that loud. I do wish the 9.25 oz was the standard size that k cups were measured for as this size is closest to standard ceramic coffee cups.The B 60 is still a wonderfull machine. I use it everday and all day. I still keep my Capresso coffee maker for when several people are coming over. I have tried many of the coffee brands so far and prefer bold coffee as I use the 9.25oz setting. The best thing is getting out of bed and dropping a kcup in and in about 40 seconds my first cup of the day, which beats the standard coffee pot of preparing and making, which usually takes 10-15 minutes. I don't think it replaces freshly ground beans in the Capresso, but I wouldn't give up the B-60 for anything."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy-to-use; Can have a different flavor every cup; Every cup is fresh; your favorite coffee, in a k-cup!; inexpensive; Not just for coffeeCons: frequent washing requiredI am so glad that I discovered the My K-Cup Reusable filter for my Keurig coffee maker! I love the coffee maker - it's quick, convenient, and perfect for my fiance and I to use - but we weren't able to buy the K-Cups very often due to price. While shopping in Target one day, looking at the varieties of K-Cups, we noticed this. At first I didn't know what it was, but when I figured it out, i was so happy! This is extremely convenient. Rather than spend the ten dollars on a pack of 18 cups of coffee, we could spend just five more to get the reusable filter. We had some coffee grounds at home, and were excited to try it. It works wonderfully! The switch-out was easy. The My K-Cup filter is easy to use (you can just scoop up coffee grounds). It is also very easy to clean. (which I was super glad to find out!)I would definitely recommend this product to anyone who has the Keuring brewing system!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Very easy to use.Cons: Everything elseI bought this machine instead of the nespresso machine. What a deception. The machine itself is really easy to use, but the problem is the flavor of the coffee capsules available. All of them so far (and I tried a lot already) are very weak for those who really appreciate a good coffee.Do not recommend to anyone."}, {"rating": "5", "user": "-", "raw-text": "Pros: Hot, fresh coffee, 1 cup at a time; So many flavorsThis is the best coffee maker I have ever owned with it's beautiful finish and easy to work screen. There are so many delicious flavors to choose from. My favorite is the Hazelnut and the Caribbean brands. Its extremely quite in the mornings when nobody want to hear anything loud. The three brew sizes are perfect for me and the family. I like the eight o.z. size because its perfect for my husband's coffee thermos in the mornings. The forty eight o.z. removable  water reservoir is extremely convenient. It is so easy to clean and the blue backlight makes reading your measurements really easy.  Also, the LCD screen is extremely easy to read in the mornings. I also like how the screen delivers you simple messages and not confusing pictures. The font is a nice size and would be great for all ages. The shipping is great and it comes with twelve K-Cups. This is a amazing brewing station and it has been pure joy having one of these in my home."}, {"rating": "5", "user": "Green", "raw-text": "Pros: Durable; Easy To Use; StylishCons: Limited Cup SizesWhile visiting my cousin in CA, She had one and I fell in love with it. Since I'm the only coffee drinker in the house it is prefect for us. My wife uses it to make hot water for her tea and the kids use it for making hot coco. I really look forward to my coffee in the morning. Thanks"}, {"rating": "5", "user": "-", "raw-text": "I bought this for my parents as a gift last Christmas. They were intrigued and loved how easy it was to use and clean. It is easy to find great coffee to fit the machine. The bad part is that only certain cups can be used with the machine, because the eye can't read through darker mugs. Also the top you close over the K-cup has broken and won't stay closed. The machine is only used to make 3 cups a day. My sister's machine did the same thing. We will replace this and give the product another try as to the ease and convenient size of this machine."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; variety of beveragesCons: difficult to use portable mugs with iti bought this as a gift for my wife. she loves coffee and other hot beverages. so this was an ideal machine. so far it very quick and easy to use, easy to clean, and its decent size allowed it to easily fit into our kitchen counter set up. the three drink sizes are very convenient also. there is a large variety of K-cups which is great, but they can become expensive depending where you buy them. the only downfall is that the spout is kind of low for us to fit our portable mugs under, but that can easily be solved by using a mug that fits and then pouring it into the portable mug."}, {"rating": "5", "user": "-", "raw-text": "Pros: a time saver; Easy to use; stylish; versatile; varietyCons: a bit more expensive but worth it!I LOVE MY KEURIG!!! I have been telling all my friends who are coffee lovers to go and buy themselves a Keurig. I have reviewed every single-cup brew system and found Keurig to be the best on the market! The K cups offer a fresh cup every single time and you can make a hot cup of fresh coffee in seconds! If your unit is off, it only takes less then a minute to heat the water. The Keurig system is by far the most popular which means K cups are sold at every major retailer... you won't have to go searching for them or worry about only finding them at out of the way stores. The two best features, in my opinion, about the Keurig system: My K-cup and the Variety of K cups offered (even Caribou!!!). The My K-cup allows you to use any type of fine grind coffee so you are not limited to just using what the k cup line offers. That being said, the K cup line is AWESOME!!! There are so many different kinds and flavors, cocoas and teas... you can have something for everyone. A lot of people think it is expensive, however you can get the my k cup and use regular coffee and have k cups on hand too. Most of my friends are now proud owners and have stopped going to coffee shops because they can have their favorite drink at home... which is such a money saver! Definetly recommend!"}, {"rating": "5", "user": "-", "raw-text": "I really like this coffee maker...super easy to use. I only drink about a cup a day, so this is much more convenient than a big pot. Even if I turn it completely off, it takes less than 2 min to heat the water back up, then 1 min to brew in the morning. I'm happy I made this purchase. ..."}, {"rating": "5", "user": "-", "raw-text": "PROS: Ok I was looking for a coffee machine that was easy to use with no mess and with my high speed get up in the morning I'm ready to roll lifestyle I found it. Very easy to set up took 2 min's. Nice easy directions however you really don't need them its pretty self explanatory. Ok the CONS, I was trying to convince the wife to get rid of the nasty pot type coffee maker and get on board with this cleaner not have to look at that nasty stained glass pot model. Didn't work due to fact that she likes to fill one of those huge mugs in the morning to take with her for her 6 min ride to work. Even with this model having the 3 cup sizes the large cup size is still not very much coffee esp. for those insulated mug type coffee drinkers like my wife. All in all I love it we just agreed to disagree and now have two coffee makers on the counter top. Great product and looks very sharp also. Hope this helps"}, {"rating": "5", "user": "-", "raw-text": "Pros: Sturdy device that makes a means cup of joe... I bought one of these for my mom as a Christmas gift and she loves it. The special edition is a great choice because it looks fantastic EG. Real metal instead of chrome painted plastic. It also came with a K cup starter pack which was nice.Cons: Which it had a larger cup size option but this is limited by the ammount of cofee in the k cupgood purchase... newegg shipped it quick and cheap A+ as always"}, {"rating": "5", "user": "74", "raw-text": "I read the reviews before purchasing the B60 and most of them were good so I ordered one and I must say so far so Good! I love it! It was a challenge figuring out the right size cup but other than that I haven't had any problems. I always use bottled water and it has worked like a charm."}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast, great coffeeCons: PriceI've read several of the reviews but have not experienced any of the stated problems. I use the reusable filter and have great coffee with every cup. The only thing I can think that would make this coffee brewer better is a lower price."}, {"rating": "5", "user": "Pepper", "raw-text": "Pros: Easy To Use; Multiple Settings; Durable; Accommodates All Cup Sizes; StylishI love the variety of products available for this machine. You can never get bored with your coffee."}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Easy To Use; Accommodates All Cup Sizes; Multiple SettingsAt my last 2 work assignments, the clients used the Keurig coffee machine. After having a few cups, I really wanted to get rid of my old drip brewer and switch to a Keurig. This Christmas I received the B60 which comes with a 12-pack of sample coffee.The unit is quiet and easy to operate. I programmed the Auto On/Off feature to run from 7:00AM to 1:00PM which covers the time over the weekends I want to have coffee or tea while reading the paper or having breakfast. With my new stainless steel mug I brew 2 medium coffees before I go to work.I bought a box of Green Tea and Newman's Own Organic 2 days ago. I plan on picking up the Donut House this week for a little variety.The only bad thing I have to say is the free coffee at work does not compare to the coffee I get from the Keurig system."}, {"rating": "5", "user": "-", "raw-text": "I bought this coffeemaker 8 months ago. I am the only person in my household that drinks coffee and, I like my coffee \"fresh from the pot\". I was sure this coffeemaker was a perfect solution. HOWEVER, it is only a perfect solution when it works. My machine will work for about a month without fail, then ...it doesn't work at all. I try going through all the settings ,etc and have in the past been able to get it to work again. Today I am having no luck. The concept of this type of coffeemaker is great--the price and the inconvenience is not. Research other coffee machines before making your purchase!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Accommodates All Cup Sizes; Multiple SettingsCons: ComplicatedGreat price! Great brewer, lots of coffee brands available, QUIET, always on, but there is one con: It is not clear how you set it to \"Always On\", so it's ready to brew without having to heat up. You have to fool around with the Auto Off settings to get it to do this, which seems counter-intuitive. But you CAN do it. So, once the settings are \"set\", it's perfect."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!I had the B70 coffee brewer first and it died withing the first year. I replaced it with this brewer. I love it. No problems at all and use it each and everyday. No more running to the expensive coffe shops for coffee. Starbucks was a favorite of mine (Dark Magic) KCups tastes very much like Starbucks to me and not as expensive. Would purchase again for sure."}, {"rating": "5", "user": "-", "raw-text": "My second Keurig died today. It is only 9 months old. I love the concept of being able to make fresh coffee but for the price I believe the machine should last longer than it does. I am the only one in my house who drinks coffee so the machine did not receive excessive use. I am very disappointed and not sure what I am going to do for a coffee maker. I would definitely not recommend a Keurig to anyone at this point!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Availability of an extended warranty.Cons: General short life of this product.Our last Keurig coffee maker lasted a year before it died, which from reviews elsewhere is just short of miraculous. It seems that many people have problems within a month or two of purchase. We enjoyed the coffee maker a lot, and so decided to replace it, but only because we could get a 2-year extended warranty at Best Buy. Without that we would probably not have purchased another of these."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to use, love the timer featuresCons: cost of K-cups, power outage requires reset of clockWe love our new Keurig brewer. I have it setup to auto-turn on for heated water for a certain time every morning, and turn off at a reasonable time later in the morning. If we need it outside of that time frame, it is only a 2-3 minute warm-up time. It is extremely easy to use, and hubby and I can now have different cups of coffee without imposing our choice on the other!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Ease of use, convenience, and coffee brand selectionCons: Haven't found anything yet.My wife and I love this machine. It's very convenient for brewing personalized flavor without the waste. The one cup at a time is a great way everyone can have their coffee tailored to their likes without brewing a big pot and throwing out the unused portions. A bonus this machine has is three cup size selection and a clock timer in case you want to set everything up the night before and wake up to the smell. The unit even tells you when to refill the water and prevents you from brewing until you do. Being a guy whose job it is to test products I can tell you that preventing the user from damaging the product is a huge PLUS!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy-to-use; Can have a different flavor every cup; Every cup is fresh; your favorite coffee, in a k-cup!; inexpensive; Not just for coffeeThis is easily one of the best products I have purchased. When you purchase a Keurig coffee machine, you don't necessarily take into account that all the little k-cups you have to buy are expensive. They are easily 50cents per k-cup. You're trying to save money not spend it when buying an at home coffee maker. The benefit of this little wonderful device is that you can buy a huge bag of dunkin donuts ground coffee for a couple bucks then use this refillable k-cup over and over again.The product is easy to use and easy to clean. I have been able to fill my k-cup with all kinds of different flavorful coffee. Another benefit of this product is that you can use whatever coffee or tea you want (yes it brews tea too). Generally the prepackaged k-cups can be a little weak in taste so you can fill this k-cup up to the top and get a pretty solid cup of steaming hot coffee as bold and bitter as you like it."}, {"rating": "5", "user": "-", "raw-text": "Had been looking into purchasing a Keurig after being told how good they were, We are very happy, can't go back to other coffee makers. Cuts down on waste and is easy to use. If youre looking for a great coffee maker, look no further. Just my opinion, good luck, hope this helps. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Makes a single cup of coffee quickly and efficiently when you want it. Green Mountain Coffee has a K-cup subscription service with automatic delivery of fresh coffee with a discount. WeCons: I like strong coffee. Even at the smallest cup size setting (strongest brew), there are still only 2 types (Sumatran and Dark Magic) that satisfy me. Expensive per cup but less than throwing out the extra coffee in a normal pot that sits around going acid.I bought it for my wife when I had to give up caffeine for a year. Now we are both enjoying coffee but at different hours and I don't begrudge the extra cost at all. Ours has been used daily for 3.5 years and if it died I would pay for Fed Ex to get it replaced!"}, {"rating": "5", "user": "Girl", "raw-text": "Pros: Durable; Multiple Settings; Easy To Use; StylishCons: Limited Cup Sizesthe best! Don't hesitate to get one. Anytime of day i have a cup in just a few seconds. No problem with machine for close to year. easy to clean. hardly no maintence needed. gmc is the best! timothy is excellent too! avid coffee drinker."}, {"rating": "5", "user": "-", "raw-text": "Pros: Very Easy to use. Very addicting. My wife and I just love this machine. I recommend getting the special edition brewer instead of the lower priced one because the chrome handle is metal on the special edition and plastic on the lower priced one. Also can enjoy different flavors of coffee throughout the day/night, instead of one pot of the same.Cons: Very addicting. It is a little noisy, but your making coffee, all coffee pots are noisy.If you watch sales on the K-cups, you can get them for around .25 - .30 each. Also watch in stores for clearance (due to outdated) K-cups. They are sealed, so who cares if they are outdated. Usually get them for about 1/2 price. Also, once you register your machine on Keurig's site, you will get two free boxes of coffee if you buy two."}, {"rating": "5", "user": "-", "raw-text": "This is great because it is so fast, clean easy to use. In my house, I drink tea and hot chocolate, my dad drinks coffee, my mom drinks tea and coffee, and my brother just hot chocolate. This machine makes it easy to make drinks for everyone and it is stylish and the flavors are great. Now they have a special filter you can put any coffee/tea powder into so you can still have your special flavors.Great product, wish I had thought of it!"}, {"rating": "5", "user": "-", "raw-text": "BOUGHT A KEURIG FOR THE TSV. WORKED QUITE WELL FOR A WHILE BUT NOW THE CHOICE ON THE CUP SIZE DOESN'T WORK RIGHT AT ALL. SOMETIMES IT WILL BREW THE SIZE YOU CHOSE THEN OTHER TIMES IT MAY BREW HALF OF THE AMOUNT. I WOULD THINK FOR THE PRICE OF THESE MACHINES THIS WOULDN'T HAPPEN. WHAT HAPPEN TO A PRODUCT WELL MADE AND WORTH THE MONEY YOU PAID FOR IT?"}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Accommodates All Cup Sizes; Durable; Easy To Use; Multiple SettingsWe have had this model for two years and it works great! It is so nice always having a fresh cup, never having to throw out burnt coffee and it's great when we want different types of coffee. It is also working great with the cocoa. We will probably buy one for the office too."}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Accommodates All Cup Sizes; Durable; Easy To Use; Multiple SettingsThis coffee maker is perfect for the coffee making challenged. Pop a K cup into it, select the cup size, and in seconds you have a steaming cup of coffee. A bleary eyed non-morning person couldn't ask for a better way to get a cup of coffee!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy To Use; Stylish; Durable; Multiple Settings; ConvenientBought the B-60 for my husband for Christmas. He was not pleased....concerned about the cost per cup...so, I bought the K-Cup reusable filter and he would have one of the pre-packaged K-cup varieties and he would prepare a couple cups a day using his favorite ground coffee. That was January. We now have the carousel, stocked with a wonderful variety of coffees and we are loving it. I haven't heard a word about the cost per cup. All I hear is raves about what a great cup of coffee he has just experienced and when will I add a new variety to the carousel! Also, haven't noticed the re-usable filter being used all that much. We have a listing of the 170 variety of coffees and teas and are making our way through it, scoring each as we go. I have a friend who also has this machine, so, we share the varieties and are able to order more often. It is so much fun when we have guests over; they frequently take more time over their decision on which beverage to have than if they were ordering a 5 course meal! I wish I could get a commission on the machines I have \"sold\" to friends who have seen mine and already rushed out to buy one for themselves.I am planning on buying this machine for everyone I know for next Christmas....that is, if they don't go out and buy it for themselves beforehand.Coffee tastes like coffee; no plastic or metallic taste as with many coffee makers. Easy clean up. Actually, no clean up, just throw the K-cup away."}, {"rating": "5", "user": "-", "raw-text": "Pros: Durable; Versatile; Multiple Settings; Easy To Use; StylishWe first saw this machine at my Dr.'s waiting room. We were hooked. I have had mine for a week now and we are completely satisified. It served well for a dinner party for 9. One family member left our house with plans to get one of her own! We have used it for the K-cups, instant cocoas, instant coffee, instant soups, and hot water for recipes. The filter accessory works great to finish the bagged coffee I already have! I don't mind the noises one bit. Makes it feel like we're at a real coffee shop..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Easy To Use; Accommodates All Cup Sizes; DurableI purchased mine 4 months ago, after seeing it in action while visiting my in-laws. When I got home I got online and made my purchase. I absolutely love it and will never go back to a tradtional coffee maker again! It is so easy, fast and convenient. I love the many varieties of coffee, teas and hot chocolate. As a single Mom with 2 children and the only coffee drinker, I love having a fresh hot beveage when I am ready. My kids love the hot chocolate. I love the fact that it accomodates a travel mug. This has to be the best investment I've made...and I can't imagine life without one."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeI love this coffee maker. It is great for entertaining when only one person wants tea and the rest want coffee. I love it."}, {"rating": "5", "user": "coffee", "raw-text": "Pros: Easy To Use; Stylish; Durable; Multiple Settings; Accommodates All Cup SizesCons: Plastic tasteI have had a keurig machine for 3 years and it broke. The new machine is the same exact model but even after brewing over 20 cups of coffee the water/coffee still smells/tastes like plastic."}, {"rating": "5", "user": "-", "raw-text": "We L-O-V-E our Keurig B60! After reading lots of reviews online that said it would stop making the correct size cup after awhile, we bought not 1, but 3 of them! One for our home, one for a gift, and one for our cabin. I just adjust for the incorrect size by pushing a button and adding a smaller size cup to it. It's not perfect, but we still prefer that over a standard coffeemaker! The different flavors make a hit with company, and we enjoy the variety ourselves. Chocolate Glazed Donut and Nantucket Blend are our favorites. I would recommend this mostly to patient people who love coffee and can roll with the punches! LOL"}, {"rating": "5", "user": "-", "raw-text": "We L-O-V-E our Keurig B60! After reading lots of reviews online that said it would stop making the correct size cup after awhile, we bought not 1, but 3 of them! One for our home, one for a gift, and one for our cabin. I just adjust for the incorrect size by pushing a button and adding a smaller size cup to it. It's not perfect, but we still prefer that over a standard coffeemaker! The different flavors make a hit with company, and we enjoy the variety ourselves. Chocolate Glazed Donut and Nantucket Blend are our favorites. I would recommend this mostly to patient people who love coffee and can roll with the punches! LOL"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great tasteCons: a bit more expensive but worth it!I have used my Keurig coffee maker for almost two years - everyday at least two to three times a day. It has not failed or made a bad cup of coffee. I love that it is fast and doesn't drip.A Great Machine."}, {"rating": "5", "user": "-", "raw-text": "My sister has a Keurig.....but it is sooo loud! I hesitated to buy....not to worry, I can hardly hear this. Great instructions, great little books that describe the coffee, quick to set up & the perfect cup of coffee within about 5 minutes out of the box! Please offer more flavored varieties? I bought the K Cup so I can use my own favorite flavor but I miss the ease of the little prefilled cups. The company is great & goes the xtra mile in customer service. And stores are now offering them making it even easier to never run out. Thanks for the easy pay QVC. I turn mine off when I'm gone & overnight; leave it plugged in tho; flip the switch, wait 1-2 minutes, push the button and in 30 seconds am drinking perfection. You will never go back....what R you waiting for....buy this ASAP!"}, {"rating": "5", "user": "-", "raw-text": "Pros: inexpensiveCons: frequent washing required; Less convenient than Kcups; messy; a painI'm a keurig lover, but this on is just not what it's cut out to be. The coffee tastes burnt when brewed through mine, it's time consuming to make a cup and then of course there is the mess! You can't go from using this to a K cup without first switching out the little adapter. Over all it is just a very complicated item to use. I love starbucks coffee that you grind yourself, but by the time you grind the coffee, pack the cup, place the cup in it's special case place the case in the machine and then brew the cup, you could have just driven to starbucks. It would indeed cut down on the cost. If it were a paper filter of some kind, maybe it would taste better. I have to reccomend something like my Kcaps instead."}, {"rating": "5", "user": "-", "raw-text": "I bought this for my dad for father's day. He is elderly and I thought this would make it so for him to make coffe. However, no matter what size coffee I select the machine only spits out only a 1/2 cup. It's going back."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffee; tea, coffee or hot chocolate; easy to read display; always a fresh cup of coffee; no clean-up; can make hot water for instant soups; Can use my own coffee; even makes tea & hot chocolate; can select cup size; Use your own coffee with the K-CUP; Perfection every time !; stylish; cheaper than Starbucks; Has a built in water filter; Coffee in a FLASH!Cons: a bit more expensive but worth it!; A bit more cost than conventional potsI love this machine. It is the best coffee maker ever. I am not a huge coffee drinker but get spurts of when I would want it all through out the day. It makes my coffee in under a minute and tastes perfect everytime. I love that there are K-cups especially for cold drinks:) I live in the south and we need cold drinks to protect of from heat stroke in the summer. LOL. Love it!"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!My husband and I saw a demo for this at Macy's a year ago and had to have one. We use it everyday! I even make instantoatmeal every morning for my husband with it!! Great product!!"}, {"rating": "5", "user": "-", "raw-text": "I had seen and utilized this type of coffee maker first at a tire repair shop and was impressed that it could make such a great cup of tea (as I am not a coffee drinker). At the tire shop they had a variety of teas to choose from and I loved the individual servings. The only down side was when someone had a cup a coffee before me, I had to run the water through a couple of times to get the coffee taste out of the water. Anyway, since I only do a cup a day, I had been looking around for the Keurig coffee maker. I had seen it at Macy's and started pondering whether I really needed this as a tea kettle works just fine. My decision was made when it went on sale at a price I couldn't say \"no\" to and took home the Keurig B60 model. I have been very happy with it. I like this model as it can keep water hot an ready to go at any moment and make a hot cup of within a minute. This model comes with a box of different coffees to try, which will come in handy for any coffee drinking guests I might have. My only drawback is the lack of decaf teas and variety of teas available. For the teas you have to order on-line as Macy's seems to think that only coffee drinkers buy this and therefore do not have any on their shelves to sell. With this being said, I was able to buy an attachment that allows one to use their own tea leaves (or coffee grounds) instead of the pre-packaged containers. When I bought this, I also bought a box of the Hot Chocolate containers. It should be noted that you must"}, {"rating": "5", "user": "Dogs", "raw-text": "Pros: Stylish; Multiple Settings; Easy To UseCons: Limited Cup SizesYour K-cup coffees are excellent. The My K-Cup accessory lets me enjoy my coffee varieties with the \"best ever\" coffee maker."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great coffee , simple magicCons: No water filter included for freeEasy to setup, simple to use, perfect gift to my wife. No hassle and with my k cup accessorie you can use your own grounds if you don't want to buy k cups."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; brews quickly; great taste; no more large pots of coffeeCons: K-cups are expensive; A bit more cost than conventional potsI love my Keurig and have saved so much coffee and money since receiving this as a recent birthday present. I love the size options as well as the different types of coffee to choose from. It is great and I have no complaints!!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Durable; Stylish; Easy To Use; Makes Great Coffee; Multiple SettingsLove it's convenience and ease of use. After purchasing it, many family member went out and bought one as well."}, {"rating": "5", "user": "-", "raw-text": "Pros: always a fresh cup of coffee; easy; even makes tea & hot chocolate; large variety of flavors; quickCons: recycling the cups is work...I don't consider myself a coffee snob, but I do enjoy a good cup of joe.  I did the Gevalia mail order grind your own for years with their 4 cup brewer.  And it was good coffee, but hated the work involved, finding out someone else used the last filter....  Then about three years ago, my office installed a Keurig Small Office system, and I was hooked.  I made that my Christmas present to myself that year (The Special Edition that has the 3 brewing sizes), locked into Green Mountain's auto shipment plan and have never looked back.  The next year I bought another as a gift along with a Green Mtn subscription service.Both of these have had years of service, I use only gallon spring or distilled water since I have high mineral content house water.  Follow the process to clean it with it asks you two by cycling vinegar through it (buy a gallon container, and don't dump it down the drain, i've reused the same vinegar for several cycles).The only thing bad is every once in a while, it has a seizure and forgets what size cup you selected, so you usually get shorted, and the next cup over flows.  It will clear itself if you unplug it from the wall and let it set for several minutes.  And every once in a while, the water pump in it is loud.  Sounds like one of those long Australian Aboriginal instruments.Don't fear the cost of the"}, {"rating": "5", "user": "-", "raw-text": "Love it, as soon as we got it we made coffee with the sample k-cups that came with it. AWESOME, so glad I finally gave in and bought it. The price was right too."}, {"rating": "5", "user": "-", "raw-text": "Pros: Loads of choices between different coffee flavors and strangths as well as teas and hot chocolate. Quick, easy and NO MESS! Has a timer on and off if you like to set it, also has a setting for shutting the machine off incase you forget on the manual setting. Coffee quality the best I've tasted from a singer brewing unit, really can't tell the difference between this and a regular coffee maker.Cons: Cost. The k-cups are a bit expensive but that's what you get for convenience. It would be nice if there was a setting to ajdust the quantity of water for each cup size.While the cup sizes could be better, if you use large coffee cups as I do you can always brew one on large and run another threw on small. If the cup can't quite hold both I just move another cup under to catch the remaining amount. I would recommend the stronger coffee for doing this as the medium blends tend to be too week for doing this. I bleleive the B70 model has more setting for coffiee sizes but I don't believe the cost is worth it, certainly up to the cosumer."}, {"rating": "5", "user": "-", "raw-text": "Pros: Multiple Settings; Accommodates All Cup Sizes; Easy To Use; Stylish; DurableLove the everyday use and especially when entertaining. Offering multiple flavors makes everyone happy!"}, {"rating": "5", "user": "-", "raw-text": "I would not recommend this coffeemaker or any Keurig product. Our coffeemaker vibrates so badly that our kitchen window rattles and it is so loud that it wakes our guests up in the morning. I have descaled it with no improvement. Kuerig suggested that I put a mouse pad under it. I had already tried this, but it did not work at all. Keurig customer service was not helpful at all and, in fact they were very defensive. I will not recommend Keurig to anyone."}, {"rating": "5", "user": "-", "raw-text": "We love our Keurig - makes coffeehouse quality coffee in about 30 seconds. This product has made mornings significantly better in my house! K-cups are easy to find in stores and come in many delicious coffee and tea flavors."}, {"rating": "5", "user": "-", "raw-text": "I've had the Keurig Special Edition Gourment Single Serve Coffee Maker for about two years now.  You can set the timer to be ready to brew and you're out the door in minutes.  It can brew a variety of things: coffee, tea, hot chocolate; you also have the option of using your own tea leaves in the handy filter basket that is provided.  A simple solution for people who only want to make one cup at a time, or different flavors for a group of people in one setting.  Easy to clean and easy to maintain- fill the water reservoir and you're good to go.  Feel like a bigger cup one day and a smaller one the next, just choose your size: 6 oz, 8 oz, or 12 oz.  Cup pedestal removes easily to fit a travel mug; and should your cup overflow, the cup pedestal will actually hold a full 12 ounces of liquid.  Two years and going strong, if anything were to happen to my Keurig I would be at the store to get another one!"}, {"rating": "5", "user": "-", "raw-text": "This has been one of the best purchases we have made in a long time. It has broken my \"buy a cup of coffee even though we have a coffee maker at home\" habit. My husband and I can brew exactly what we each like at the strength we each like. No more wasted coffee, messy measuring, or cleaning out that darned coffee pot. It's easy to use and fun to have a selection of different varieties available to try. I recommend purchasing the carousel to store/display the pods. Highly recommended."}, {"rating": "5", "user": "-", "raw-text": "Pros: Stylish; Accommodates All Cup Sizes; Multiple Settings; Easy To UseThis is a great coffee maker. I first used this 8 years ago while in college at an internship, since then a couple of employers have had this coffee maker available for employees (Office Verison). My wife isn't the biggest coffee drinker but I am, she likes her tea. So we bought a \"pod\" maker a year+, it made ok coffee but didn't make sizes. This coffee maker was a gift from my in-laws (THANK GOD)....I have never seen my wife drink so much coffee, she loves her Ice Coffee in the Summer from a Chain, while now she LOVES her coffee at home hot or cold since we have started using this coffee maker. I have read some of the reviews that state, \"It doesn't fill my cup\"...Well some of the \"cups\" out there are no longer cups, I have found a variety of mixes to use depending on the coffee I am drinking. When using my travel mug I do a Large brew followed by a small brew, WITH THE SAME K-CUP...I have also done this the other way, a small followed by a large. It makes a great cup/mug...So my advice, don't use 2 K-Cups, play with different size brews you will find it makes a great cup/mug with just one K-Cup. [...]"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; single serve; brews quickly; great taste; no more large pots of coffee; Enter your own tagi have this keurig coffee machine and it works great the measurements are just right easy to clean and just a great varities of coffees, teas,and hot chocalate also it mahes great ice teas your kids can make there own hot choc. when company comes over its easy to satifiy all of them without making sepate pots of coffee try you will like it."}, {"rating": "5", "user": "-", "raw-text": "Pros: Accommodates All Cup Sizes; Stylish; Easy To UseCons: Will It Improve; Bad Flavor at Break-inTerrible after-taste (plastic)during break-in. Cannot get past it."}, {"rating": "5", "user": "-", "raw-text": "Let's face it, you're not going to like the same type of coffee as your roommate or spouse. And all of your guests are not going to necessarily like that pot of Starbucks, Dunkin Donuts or Folgers. So let them choose the strength or flavor of their coffee. Its easy to use, doesnt take up that much space, is modern looking, quick, etc. I love that it has 3 different options for ounce size which allows you to further determine the strength of your coffee. (The single serve machines do not have this option.) But you definitely DO NOT need to get the B70/Platinum one. Its not worth the money for a bigger water tank. These machines all brew the same cup of coffee so it a waste of money to get anything bigger, 'better' than this model."}, {"rating": "5", "user": "-", "raw-text": "Pros: This coffee maker makes the perfect cup of coffee every time. It takes less than 30 seconds for it to heat the water, you press the size cup you want, make sure you have the coffee module in it and your set. Perfect coffee every time. one after the other over and over and when you have had enough turn it off. It will even come on at a certain time for you if you set it. This is my second one and I will buy a third one if I have to. You cannot beat the coffee at any price.Cons: pump is loud. Sounds like the first note you hear on the Pink Floyd song, Comfortably Numb. If your a fan you may find your self singing Hello.. Hello.. Is there anybody in there...Coffee cup per serving price is about 33 cents a serving but it will beat Starbucks 2.00 and up coffee in a lot less time and money.If you dont mind the initial cost of this machine. Get it. You will love the coffee and so will everyone who comes to visit you. The Tea is great too. If you like hot tea."}, {"rating": "5", "user": "on", "raw-text": "Pros: Durable; Accommodates All Cup Sizes; Multiple Settings; Easy To Use; StylishI LOVE this coffee maker. It is so easy to use and you get a great cup of coffee every time. Take the time to try all different kinds of coffees. There is surely one to please all. If you are trying to decide on which one of the models to go with get the B60 so you have all 3 cup size options. You will not be dissapointed."}, {"rating": "5", "user": "-", "raw-text": "Pros: single serve; tea, coffee or hot chocolate; quick; no more large pots of coffee; fun; easy to read display; no clean-up; choice of brewing a cup or a travel mug; brews quickly; Easy; A wide variety of coffee flavors; easy to useCons: Every cup brewed tastes like plasticWe bought the Keurig B-60 coffee maker, followed the directions in setting it up, washed the water reservoir thoroughly, yet no matter what type of cup is brewed (cocoa, coffee, tea) every cup has the taste of plastic.  Has anyone else had this problem and does anyone have  any suggestions in getting rid of the plastic taste.  Other than this, I love the concept of the coffee maker, it's convenient, practical, and easy to use plus it offers 200 varieties to brew.  I especially like the fact that it takes less than 60 seconds to brew each cup of coffee.  Because we were able to buy it on sale at a great price, we also bought one for our son who is heading off to college soon and will be living in the dorms.  He couldn't wait for move in day, he set it up as soon as we brought it home.   He loves the ease of use and it's practicality.  If each brewed cup did not taste like plastic I would have given it five stars."}, {"rating": "5", "user": "-", "raw-text": "Pros: Durable; Multiple Settings; Stylish; Can Brew Quickly; Works Great; Easy To UseCons: 1 more brew size 12 ozWe have had this model for quite a while now. It get quite a workout every day. It brews between 10 and 20 cups some days for home use. Yes we drink a lot of coffee some times. That said, it has handled everything we have thrown at it. I just wish it had a larger cup size say a 12 oz. That way we could give her a break. I would like to see an actual espresso cup mix at some point from you folks. That would be a huge boon for your business. Something like they have on the tasimmo, a two stage cup, one for the coffee, one for the steamed milk. that would make my day! Come on GMCR you can do it!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Accommodates All Cup Sizes; Easy To Use; Stylish; Multiple Settings; DurableI love this Keurig coffee maker, it has become a part of my life. It truly is a \"great investment\". I look forward to start my day, its awesome."}, {"rating": "5", "user": "-", "raw-text": "I work for a tech startup and many of us love have fresh coffee. We all have different schedules when we like to have our coffee so brewing a whole pot and having it sit in the kitchen was not ideal, while brewing just one cup is very time consuming, so we decided to try the Keurig brewing system. This system works well if you want fresh coffee and want it quick. It's very easy to use and you are in and out within minutes. The best part about this device is that there is very little cleaning that needs to be done, which is perfect for an office or a lazy person at home. The knock I have against it is that you are limited to the selection of coffee offered in K-Cups which are lot more pricier. They do have an adaptor that allows you to use your own coffee grounds but then that is defeating the purpose of using this system for it's simplicity. Overall, this is a great system for easy of use, but again that simplicity comes with a pice tag. It's not for everyone, but works well in certain environments."}, {"rating": "5", "user": "-", "raw-text": "I got this coffee brewer as a birthday present from one of my closest friends because he knows that I love making my own cup of joe in the morning. This coffee brewer is really easy to use especially if you like to make hand crafted coffees. It can be used straight out of the box and it is pretty quick at what it does. Since it is single serve, you don't end up making more than you drink and then letting the coffee sit there to cool and then having to throw it out later. Since you aren't making coffee for so many people, it is that much faster. In terms of taste, that would have to be more on your decision of what beans you purchase but I would say it has a pretty good taste though how it brews. It is more on the bulky side but you can find a nice place to put it."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quickI bought a Keurig after falling in love with one at my office. It is the best coffe maker out there! Period. If you have done any sort of research on this machine, you'll see that people love it, and with good reason. It is very versatile as you can not only find K Cups for any kind of coffee that you could imagine, but they have tea, cocoa, and a filter where you can use your own coffee just as you would in a traditional machine. I haven't seen a great selection of K cups in the stores, but you can find anything you want online, especially on amazon. It's super easy to use and maintain. You never have to buy filters. It isn't too large and doesn't take up much space in my small kitchen. But really the best thing is that you can have a hot, fresh cup of coffee whenever you little heart desires. In about 20 seconds. You can't beat that, even if you have all the patience in the world, which I don't."}, {"rating": "5", "user": "-", "raw-text": "Pros: single serve; great tasteCons: K-cups are expensive; Poor function, design flawsI have owned this model Keurig for approximately one year. This is my second unit in that time, as I had to return the first one after about a month. The unit would not function or allow any manipulation of the electronic controls. After returning the unit, the replacement functioned for about another month before exhibiting the same problems. As it turned out, there seems to be a faulty design in the water pump, and I can get the unit to function by shaking the entire unit; I have to do this once every couple of weeks. Additionally, the brewer does not always brew the full cup, and I have to cycle it again to complete it. All in all, this model has been very disappointing, and I will not purchase it again, and I will recommend that others not purchase it as well."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeCons: K-cups are expensiveThis is agreat coffee maker, fast and convenient for busy people. Love how the portions are set for this machine, easy to use and even easier to clean. This is for sure a coffee machine for singles or an office."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; quick; great tasteCons: K-cups are expensiveKeurig Special Edition Brewing System B60 is one of the best coffee makers. To summarize the main features it has a 48oz water reservoir, 3 brewing sizes, 5.25oz, 7.25oz or 9.25oz, temp selection, uses k-cups and pours in less than a minute. Operation is very simple and anyone can use it. The programmable on and off function is a nice touch. There are a high number of quality grinds found in their k cup line , though the k-cups are costly. They are convenient but you don't have to use the k cups, you can use your own coffee. But if you factor in less waste by not wasting any as opposed to how others dumping bad tasting coffee or even pots of coffee that have sat there for hours then its not so bad. Love it great performer, great tasting coffee, worth the added expenses in my opinion."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use; single serve; quick; brews quickly; great taste; no more large pots of coffeeCons: a bit more expensive but worth it!; K-cups are expensive; A bit more cost than conventional pots; expensiveI worked in a medium office (30 of us) and we had a **Keurig Special Edition Brewing System B60. **My boss bought us all of the different tea, coffee, and hot chocolate selection and at first I was a kettle snob. I love tea, I run a tea blog, so when I heard of this \"instant tea\" I was a little disgusted. The machine grew on me though, I tried some hot chocolate and flavored coffee at first, and I would drink them daily. 30 of us all using this machine in the morning, on breaks, at lunch and at the end of the day, and it never gave out on us. I worked in the office for a year, and we NEVER had a Keurig issue.Also, I finally tried the tea (I had an earl grey) and I loved it! It still weirds me out that tea can come out of a plastic cup, but that didn't make the tea aste any worse.The only \"issue\" I have is the price. YIKES! Between the cost of the machine and the cost of the cups, this isn't something I would own in my own home, but I loved it in the office.****"}, {"rating": "5", "user": "-", "raw-text": "Cons: a bit more expensive but worth it!; K-cups are expensive; expensivei had an Keurig Special Edition Brewing System B60 for about 1 month and i did not like it. 1st it was expensive to buy, there are other cheaper brands out there. the k-cup are expensive also, and the pots are more. the **Keurig Special Edition Brewing System B60 also only makes one cup of coffee at a time and if you drink a pot a day like I do, It is always running. the taste from the Keurig Special Edition Brewing System B60 was not bad but not better than the other brands. the **Keurig Special Edition Brewing System B60 is small so it is easy to clean. it i easy to store also. i would not recommend the **Keurig Special Edition Brewing System B60 for anyone. It is expensive and the parts are expensive to get. ******"}]