[{"rating": "5", "user": "-", "raw-text": "Prior to that, do not use the device of the manufacturer. The main thing that drew attention to the purchase - the application of protection class ip67. At a depth of half an hour meter phone is not dipped, but a couple of minutes under running tap water, he stood, the moisture indicator under the hood is not flushed. The display is bright, the sun fades a bit, with good resolution and nice colors. Touch fulfills perfectly, even through the film. The speaker is calling does not sound very loud, but very clean and without wheeze"}, {"rating": "5", "user": "-", "raw-text": "Pros: EVERYTHINGCons: BATTERY LIFEI love this phone,coming from Verizon Moto droid x to T-mobile Moto defy its very similar, its like a mini droid x very easy to use just follow the instructions and its done. This phone works very well in my area and the sound quality is awesome and very loud. To me, the best part is the plan I switched to with unlimited everything. T-mobile definitely is more bang for the buck especially with unlimited text and data plans. Verizon had unlimited text and web but now charges a la cart now and for me that sucks. The battery life is the only thing I can complain about, I will be looking into an extended life battery."}, {"rating": "5", "user": "-", "raw-text": "Pros: Water and scratch resistent.Cons: Internet connection.The phone seems to be ideal for the active teenager. Only issues we have seen so far is it seems to have trouble connecting to internet at times, even when there is tower and at other times no tower when other Tmobile cell phones in same location have tower. Easy set up of applications, very easy texting and compact size makes it very user friendly for the teens."}, {"rating": "5", "user": "-", "raw-text": "Pros: The small apps and textingCons: Signal strength for music apps, etc.I got this phone after the Motorola E73 and this was my first droid. I wanted to return it the next day. The signal strength is always weak no matter what. I try and download different apps and there was always a problem. So I walked around with a brand new phone that had issues from the start. The battery got warm until I let it run down completely before recharging it..after listening to the FM radio that is installed for 4 hours or more the switch over when a call came in did not work....so a complete shut down and restart was required. Don't buy it unless you really have the time to work with the issues."}, {"rating": "5", "user": "-", "raw-text": "That mobile phone is my first android device and it´s amazing! I love to spend time customising something and I had one great week oţ downloading and testing apps from market. It´s the best choice for it´s money (especially in Russia, where everything costs 1.5 times more than here). Unfortunately I have model with a defect of speaker (it´s fixed in new ones) and the shop assistant I wrote to didn´t check the date of production as I asked him. And the screen keeps fingerprints (healed with a slick)."}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast, easy, blurCons: no hard buttons for scoroling...First things first, it has moto blur... love it or hate it, I love it, it is something you will have to get through, once you get that set up, it is a great phone. Easy to use fast, have not had any drop calls, no process hang ups/crashes, it is great.Moto blur, those that hate it, let me say this, my old phone got trashed, after I logged in my new phone (both had blur) EVERYTHING (less programs) ported over, all my contacts, my calander, my email accounts, photos, everything except the add on programs.I love Blur and I like this phone."}, {"rating": "5", "user": "-", "raw-text": "The model has a distinct character, this unit a pleasure to use, and unlike the usual Android abound. As a user of HTC Desire I can say that I was comfortable DEFY."}, {"rating": "5", "user": "-", "raw-text": "Pros: Small size, long battery life, water proof!, good value for money ... Cons: Software needs to be upgraded(rooted) to gets full potential, needs a good charger If you…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Everything Cons: Battery life I love this phone,coming from Verizon Moto droid x to T-mobile Moto defy its very similar, its like a mini droid x very…"}, {"rating": "5", "user": "-", "raw-text": "Very good phone for its price. Good screen. Battery keeps it alive in 1-2 days."}, {"rating": "4", "user": "-", "raw-text": "Pros:: Water and scratch resistent. Cons: Internet connection. The phone seems to be ideal for the active teenager. Only issues we have seen so far is it seems…"}, {"rating": "4", "user": "-", "raw-text": "Pros:: The small apps and texting Cons: Etc.,, Signal strength for music apps I got this phone after the Motorola E73 and this was my first droid. I wanted to…"}, {"rating": "4", "user": "-", "raw-text": "Pros:: Easy to use,, Great features,, Lightweight Cons: Drops calls,, Freezes up,, Power off by itself,, Short battery life,, Weak signal It drop calls alot and…"}, {"rating": "4", "user": "user", "raw-text": "Pros:: Great features,, Lightweight,, Strong signal Love this phone"}, {"rating": "4", "user": "-", "raw-text": "Very good price!"}, {"rating": "4", "user": "-", "raw-text": "One of the best phones for its price!"}, {"rating": "4", "user": "-", "raw-text": "Pros:: Blur,, Easy,, Fast Cons: No hard buttons for scoroling... First things first, it has moto blur... love it or hate it, I love it, it is something you will…"}, {"rating": "4", "user": "-", "raw-text": "Very nice phone, decent price/quality proportion."}, {"rating": "4", "user": "-", "raw-text": "Pros:: Durable,, Easy to use,, Great features,, Lightweight,, Strong signal Cons: App depress difficult,, Short battery life It is my primary electronic device…"}, {"rating": "4", "user": "-", "raw-text": "Very beautiful and powerful phone. I like it very much!"}, {"rating": "5", "user": "WARRIORsuper", "raw-text": "Pros:: Attractive,, Big buttons,, Brilliant display,, Easy navigation,, Good interface w/email,, Great os,, Qwerty keypad Cons: Short battery life everything so…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Durable,, Easy to use,, Great features,, Lightweight,, Simple controls,, Strong signal Cons: Short battery life great phone ..love all the…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Durable I'm sending it back because it just doesn't do what a phone in meant to that and that is to be able to listen to the other person on the line..I…"}, {"rating": "5", "user": "-", "raw-text": "The BEST of the best!!!!!!!!!!! ^_^"}, {"rating": "5", "user": "-", "raw-text": "The best phone!!"}]