[{"rating": "5", "user": "-", "raw-text": "Pros: CPU, Memory.Cons: Lots, read my review.I have had Artix 4G for about 3 weeks. The phone is very fastand has a nice amount of memory. There are plenty of people who mention good things about the phone, so no need to discuss it again.However, here are the things that I do not like about the phone:1. Can't get good reception on H+ in my home. If I am not hanging out the window of my apartment, I am not talking. Scoured the boards and the only solution that I have found was to turn off H+ and only use the Edge network. If I do this, I have reception in most of my house.If you have the same issue, open up the dialer and type in:"}, {"rating": "5", "user": "-", "raw-text": "I've day this phone since day 1 of it's release. It's a very fast and powerful phone! Where's the lag? Ha I laugh in the face of lag. Overall I've had a lot of phones, because I sell them! I came from a Samsung Captivate to this Atrix. I miss the screen on the Captivate. Thus giving the Atrix 4.5. I also have a Motorola droid X. The screen on the X seems to look more vibrant. The camera on the Atrix is best used in well lite areas such as outside in the day. However, I have just recently used it at a play. When setting it on night mode the camera performed very well for a cell phone. I would have to say that the HTC Inspire performs a bite better for camera use. The Atrix front facing camera is a bit grainy, but with less pixels in the front facing camera you can talk face to face with other front facing android users with less lag. Thus becoming independent from wifi for face to face chat. The Iphone's front facing camera is much nicer but useless outside of wifi. And the Atrix out performs the HTC Inspire's front facing camera due to the lack there of. lol Pros: FAST! Did I mention fast?! Powerful! Switching from one app to another while running music, surfing the net, editing excel spreadsheets, and talking on the phone at the same time. No problem. Might have something to do with the 1 GHz dual-core Nvidia Tegra processor, and the 1 GB of ram! Moto blur. I liked the widgets and how well they work on this phone. Battery! With all that Motorola has put into this phone, the battery last"}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast! No annoying Captivate quirks and lots of DOES over iOS Doesn'ts.Cons: Takes a little polish to get the most out of it. \"4g\" is LOL@ (a tleast in my area)First off, I have used extensively an iPhone 3g and 4, a Captivate, and this Atrix.The build quality is fairly good. Gorilla glass is awesome, no need for cheesy, inhibiting screen protectors! The only thing I felt kind of cheap was the thin plastic battery cover. But a good case (Like Otterbox) will handle that.The phone is CRAZY fast. Yes, Motoblur (like Touchwiz on the Captivate) is laggy and annoying. Simply downloading the FREE LancherPro and setting it up really helps and you can truely customize it the way Android was ment to be. Using Ttitanium Backup to freeze and/or delete bloatware is easy and also frees space and speed things up more. After taking a few minutes to do this, I had everything set up how I wanted and was running lag free.The camera takes fairly good pictures and video, even in low light. The Captivate struggles with low light situations without a flash. The front camera works great for video chat like Tango, and in my tests worked as good as \"Facetime\"."}, {"rating": "5", "user": "-", "raw-text": "Coming from an Iphone 3gs (1.5 years old), it was time for an upgrade. I was willing and excited to try a new OS and when this went on sale, I got the phone. After three days of evaluation- max amount of days ATT&T will allow you to keep the phone without getting charged a upgrade fee. Pros: Fast processor. Lightweight. Expandable/Swappable memory card slot. Fast download speeds. Loud speakerphone. Fingerprint reader. LDNA Cons: Recorded videos are grainy. Battery does not last more than 3-4 hours with light/moderate use. No built in \"screenshot\" capability. Must buy an app that does this. When pausing a recorded video, the pause button and progress bar would not \"disappear\"-leaving a clean screen of the image. No option to disable the haptic feedback completely--uses more battery juice. No option to available turn on/unlock screen on the front of the phone. Android market limited in apps. Games are not as crisp/rich in colors as Iphone--the demo game (NFShift?) game that came with the phone had crappy graphics. Low resolution on front facing camera. Need a business type data plan in order to use multimedia dock--More $ to carrier suck out of you to use this feature. The HDMI video will not output Youtube or what is on your screen--Only your pictures and recorded videos. Often times when selectiing typing a text/email on the keyboard, the wrong key/letter is inserted. The \"select all...\" options screen kept popping up when trying to move the cursor to the middle of a word to"}, {"rating": "5", "user": "-", "raw-text": "Price: $499.99Had to buy at full retail price since I am not eligible for an upgrade. BestBuy was selling it at $599 but price matched the local AT&T corporate store price of $499 for me. $499 is typically an Average price for a top of the line, full retail/out of contract phone.Positives:I am an experienced smartphone user, been using them for years. I\u0092ve had the Atrix for about a week. This phone is by far the most powerful phone I have ever worked with. The dual core processor and 1 GB ram make this phone one impressive device! This phone is fast. I never experience any bit of lag when running multiple apps and programs. The phone starts up and loads in seconds. Sound quality is great. Reception is better than any other phone I\u0092ve had. Camera is very good. The display is rich and sharp. I have always used Windows Mobile Phones before so I was hesitant on moving to Android. I am very happy with Android. The amount of customization and available apps for this phone is awesome. A lot of reviews I see are negative towards the MotoBlur UI, I personally really like it and think it\u0092s very smooth.Negatives: There\u0092s only a few things I find negative with this phone.The fingerprint scanner takes a little getting used to but it\u0092s growing on me. And if you don\u0092t like it, there\u0092s other already installed unlock options available (pin code & dot pattern).Touch Input: As I stated above I\u0092ve been using smartphones for years now. I\u0092ve always had the option to use a"}, {"rating": "5", "user": "old", "raw-text": "I switched to AT&T planning on continuing to use my Nexus One. When I saw the Atrix I was really impressed with the specs and decided to lay down the $100 and try it. I gotta be fair and say that I've only had it less than a week but I'm really having a hard time getting my arms around it. I've used my Nexus One for 2 years now and thought it was better than sliced bread. This one has advantages like the dual core processor which makes it fly. The screen size is a little bigger and that's nice. Organizing pictures and creating MP3 ringtones SUCKS!!!! I haven't found a way to organize pictures in individual folders, it dumps all the pics on one screen and that is a pain to deal with. The feel of the phone is cheap compared to the N-1 or for that matter any of the HTC smartphones. The back cover snaps on and as you are taking it off you gotta bend it. I would think for a $600 phone Motorola would have made it more solid. I'm really trying to like it but I'm not getting that warm, fuzzy feeling I have for the N-1. PROS: Fast, nice screen, decent battery life CONS: cheap plastic construction. Folders?? (may be me) OVERALL: good phone but not the best"}, {"rating": "5", "user": "-", "raw-text": "Pros: Call quality, battery, silly fast processorCons: laptop dock is expensiveAfter using over a dozen smartphones in the last 12 months including the iP4 and several Android devices this is the one.Call quality is stellar on this phone with active noise cancelling that can be triggered on or off.Speaker is killer for watching video or listening to music. Also has eq settings and sounds great through headphones.Screen is absolutely gorgeous and I can't see pixels even up very close.Camera is not quite as good as iP4, but I find it has more accurate colors. Video recording is really, really great. I used it at a concert when I was in the second row and connected to my hdtv is looks fantastic.Connectivity is insane. hdmi out allows you to connect to your tv and has an interface to bring up pics and videos.Navigation is excellent. I also have the Atrix powered car dock and it's pretty much the best thing ever. Besides powering your phone it automatically brings up a car mode with large icons that can be customized. Sound for nav is excellent."}, {"rating": "5", "user": "-", "raw-text": "Pros: HardwareCons: Software1. Highest Res Android phone w/ 24-bit color TFT LCD Screen and Corning Glass. I compared this screen to Captivate it is much, much clearer w/ the Qhd resolution. Also whites are actually white and colors are much more accurate (not oversaturated like OLED). Get the phones together and compare some web pages/text/pics for yourself. Don't rely on fanboys telling you otherwise.2. The Nvidia Tegra-2 Dual-Core 1GHz is something to behold. Everything loads instantly. No lag like Captivate, or other android phones.3. Highest amount of RAM and the only DDR2 android phone. All others are DDR and about half or less the amount of RAM.4. Upto 48GB of storage... 16GB built in, and upto 32GB microSD.5. HDMI output6. Docks with Car Dock, HDMI media Dock, Laptop Dock that turns phone into laptop w/ webtop OS.7. Front and Rear facing Camera"}, {"rating": "5", "user": "-", "raw-text": "In the past, I've had the iPhone, Nexus One, Samsung Captivate, and now the Motorola Atrix. The Atrix is a great phone BUT:1 - You can't get rid of MotoBlur. Not sure why Motorola thinks this is a good thing.2 - You can root the phone, but you can't replace the ROM. Hampers innovation, and locks you down to, again, what Motorola thinks is good for you.3 - Battery life is not great. Checking email 4 or 5 times during the day, maybe overall use of 1 hour throughout the day - drained the battery down to 40% by 5pm from 7am.4 - If the phone is faster than other Android devices, it doesn't show it. Most likely because there aren't any apps that take advantage of dual-core processors right now. This will change, but right now, not a big deal.5 - The laptop dock is $500. That's expensive for a full featured web browser, and not much more.6 - 4G - This is really a joke. Nobody has 4G service in the US at present. 4G service has specifications of 100mbit download speed. I ran a speedtest on the phone, and was not able to break 1mbit. You can barely call it 3G. AT&T did not upgrade or update anything on their network in order to get this device to work. I had the HSPA on my Nexus One for over a year now.7 - In comparison, the AMOLED screen on the Samsung Captivate is brighter and has richer color.8 - The resolution used on the phone is not native. Android apps are written to support 854 x 480 max, while the Atrix offers a 960 x 540 screen. It is larger, but doesn't benefit the phone. Icons"}, {"rating": "5", "user": "-", "raw-text": "Coming from the iPhone 4 I figured this would be the phone for me. The Atrix 4G was replace 3 different times for various reasons listed in Pro/Cons. The 3 phones had the same problem the only difference is how many times the things happened. PRO: Light Weight. Able to remove battery when phone freezes. Able to use media card. Speed. CON: Feels like cheap plastic. Phone Freezes for no reason. Random Restarts. Shutting off all by itself without warning. Screen hard to read outdoors or in bright lights. Screen not as clear as iphone 4. Drop calls when incoming text, emails, and other phones calls. (AT&T, Dallas, Texas). Disconnects for the network and is always having to search for network. Battery life. Cannot use photos for home screen. Cannot remove extra home screens."}, {"rating": "5", "user": "-", "raw-text": "This is my second Android device, replacing my Xperia X10 with OS 2. I maybe the only person who doesn't go \"eww Motoblur\", but I am beginning to actually like Motoblur. Pros: Excellent reception Sound quality loud and clear Fast Stellar battery life for a SmartPhone - easy 14 hours for me. GPS quick and accurate WiFi, BT work well Camera and flash quite reasonable for a phone Cons: A slight lag switching between screens. Video could be better."}, {"rating": "5", "user": "-", "raw-text": "I have had the motorola atrix for several days now and i can honestly say its a pretty cool phone. It does have its drawbacks however. Here are my pros and cons Pros- - Great speed while surfing the web. I ran a speed test and clocked it at 6 mbps download while on wifi and 3 mbps download on 3g. -screen resolution is top notch - Fingerprint scanner actually works! -sound quality while on a phone call is really good Cons- - battery life is not that good, you would want to download the task killer app to turn off all running background apps. - there is no other button sounds other than an annoying typewriter sound while you are composing a text or an email. -motorola blur - screen size is not as big as i thought. all in all the atrix is a pretty solid phone, definitley one of the best android phones that att has."}, {"rating": "5", "user": "-", "raw-text": "Pros: All of the games and other apps, and the size of the screen!!Cons: The life of the battery!!I really love this phone and would have given it 5 stars except for the battery. I love playing games on it and even watching videos on it but it seems like the battery doesn't stay charged very long. I have to recharge my phone at least once a day sometimes twice a day!!"}, {"rating": "5", "user": "-", "raw-text": "Android 2.3.4No docking hardwareIncipio caseLight userDesignMaterial and construction are ok, not fantastic but definitely acceptable. Addition of the soft touch Incipio case improves the impression of the phone without adding a significant amount of bulk.The size and weight of the phone are reasonable. It fits well in the pocket without being obtrusive. One key design feature I never thought of until I read it in another review: the edges and corners are rounded. This makes it very easy to insert and remove from your pocket and prevents the phone from creating wear marks in your clothes. It also fits well in your hand whether you\u0092re talking, texting or surfing.Interface"}, {"rating": "5", "user": "-", "raw-text": "I have owned 3 other android devices and use my phones for e-mail (corporate & gmail), web browsing, navigation (google maps), rss updates (google reader), and scheduling. I do not use any social networking apps or widgets. I bought the Atrix 4g when it first came out this year (2011) and have, overall, been pleased with it. It does disappoint in a few areas, but overall is a decent device. Price was way too high for the first few months, but now more in line with what it can do. Pros: Fast, runs multiple apps smoothly (multi-tasking is excellent), beautiful display, gorilla glass is scratch resistant, decent camera, good call connectivity (voice over earpiece is great), nice speaker phone, like the fingerprint / power button combination, battery lasts a full day and then some. Cons: Motoblur (horrible UI, IMHO), lots of plastic makes it feel cheap (though build is not too bad), camera flash not consistent for photos (it is hard to take good photos with this phone without plenty of practice), not easy to root / flash custom ROMs, terrible selection of ring tones from Motorola. Latest Android Gingerbread with Motoblur remains terrible (you can't remove the Motoblur bits separately). Other thoughts: It is possible to root the phone, unlock it, and flash CyanogenMod 7.1 (Beta) on the device (Thank you CyanogenMod!). It makes using the device SO MUCH better than Motoblur which slows the phone down terribly! The device is much faster with this software installed and has many more"}, {"rating": "5", "user": "-", "raw-text": "Pros: Speed and Flexibility.Cons: Screen sometimes locks up. Must lock/unlock to get it back.Got Motorola Atrix at Best Buy a month ago. The BB agent transferred all my Samsung phone contacts into my new phone with the SIM card. It has taken some get acquainted time, and I am delighted with its performance. I pressed a button and to my surprise all my Facebook friends appeared in my phone contacts list. I checked help and learned to link my contacts together and now the duplicates are linked and only appear once! The Facebook pics also showed up for each contact! I enjoy getting my email on my mobile phone, and the ease and speed of using the internet browser, especially when within range of Wi-Fi with this phone! It runs faster than through the cell phone network. I recommend this smart phone to everyone I know!Minor problem is that the touch screen sometimes quits working, and I have to lock and unlock the screen to get it back again. But this may be caused by the screen film I had BB install to protect my screen surface."}, {"rating": "5", "user": "-", "raw-text": "Pros: speed, good picture quality, front camera, perfect size, SD expansion, USB charging, HD videoCons: gets warm when using, case kind of hard to grip, doesn't have good IM appI bought this phone to replace an Iphone 3GS since the form factor was nearly the same with the Atrix having a slightly larger screen. It was my first experience with and Android phone and at first the switch from iOS had be a bit flustered but as I learned all of the features of the phone and OS I am quite impressed. I can now count on one hand the number of things I miss from the Iphone, with visual voice mail being on the top, but there are many more things this phone does better. I also like the MotoBlur social networking integration, even though it's not perfect.The Atrix is fast, takes great pics and videos, and can use external storage! The only knocks so far are that it gets warm during only moderate use and the case is kinda slippery, which a good case can fix.Also, note that the Motorola dock accessories are charge only, no PC sync.Also, the price just dropped to $49, which is an absolute steal!!!"}, {"rating": "5", "user": "-", "raw-text": "Best phone out when it launched and as I been tracking upcoming phones it looks like it will hold its own weight against those also. With a ton of features and a CPU comparable to a Boss 429 engine in the 70s, this thing is my best phone purchase so far. Pros: Processor speed. Not too big, 4\" is perfect for me. Touch scrren highly responsive. 1GB DDR2 ram Battery Life, I went 11 hours of moderate use. Cons: Build could be stronger with some metal or harder plastics. Camera should have been AT least 8 MP."}, {"rating": "5", "user": "-", "raw-text": "I want to start off by saying that I am happy to see Motorola through all their troubles, come out with an industry changing device. I am coming from every iPhone ever made,Samsung captivate, and HTC inspire. I love this phone. Signal: AT&T Michigan Motorola have been one of the best signal providers for at&t since the razr. This Phone although 4G is not in Michigan yet. who cares. The signal is very very impressive. Better than all the smartphones I have used. Screen: I wasn't too sure what qHD was but, I love the clarity and responsiveness. Very easy on the eyes and looks great. Sure not Super AMOLED but very very fine and crisp, colors are accurate. BATTERY LIFE: I want to start by saying that Android Rocks, sure they have a few things to hammer down on and grow. But I love Android. everyone who wants to multi-task and does should know that a Task Manager is essential. With the Atrix you get a built in task manager designed by motorola to work the BEST with the phone, however, you need to go into it and set up your AUTO-END list but this works great. From 7am I get about until 9pm. Which is GREAT you cannot get an Android phone to work more than a day. Period. unless you do not use it. I do, email, face book, online banking. All of it, so it is great. Speed: The Phone is quick and I mean Quick. Dual core is very fast, there is some speculation that the 2nd core is disabled. I don't know, but the phone menus and multi tasking leaves me not lagging one bit. I have used other"}, {"rating": "5", "user": "-", "raw-text": "Pros: Great price, android functions, very easy to set up.Cons: Battery could be betterGreat phone! Really, if you are not too meticulous and really need a phone for calls, texting, surfing the web, and checking emails...this is the phone for you. Almost did not purchase based on a very few bad reviews. However, I found far more good reviews than bad ones. Battery life was in question. After a few weeks, I learned how to preserve the battery life a little better. Also, plan to buy a car charger, which will solve the battery life issue for me. I am very pleased with the look and feel of this phone. Very slim, not heavy, only had one freeze over the last 3 months. This is a great phone!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Price, easy to use (once you get used to Android), battery lifeCons: Not found anything so farI got this phone for my wife as her first smartphone. At the time it was free with contract. So far it has been an excellent performer. It is fast and the voice quality on the phone is excellent. The screen is a good size and easy to read. If you are in the market for an Android based phone, but do not want to pay a lot, this is a great choice. Will be an even better bargain if it will be upgradeable to Ice Cream Sandwich (Android 4.0)."}, {"rating": "5", "user": "-", "raw-text": "Pros: great price at $49.99This is my first \"smart phone\" and I am thrilled with the choice. I am not a heavy user so I find battery life to be adequate. I use a golf app that people said would drain the battery: hasn't happened. I have a little trouble negotiating the web but feel that is my lack of knowledge of the nuances of he device. It has all the features I believe I would ever be interested in."}, {"rating": "5", "user": "-", "raw-text": "Pros: Everything!Cons: nothingI've owned this phone for only 2 days now and i already love it! Motoblur works great and backs up your contacts if you lose your contacts. Its dual core processor works great and doesn't freeze. The Mp3 works pretty well it includes 3d stereoscopic, home theater, and live stage audio effects, also extreme bass boost and more. The dual core runs beautifully and makes the phone extremely responsive. another thing is the fingerprint reader, it works perfectly and i would recommend This for teenagers because then no-one can get into your phone to delete that funny photo or video u took of them. Front facing camera is clear when in well lighted areas. The back facing camera is pretty good not like my moms 18 megapixel but its definitely an excellent camera. Tons of storage, Fast, Clear beautiful graphics, 4g, and crystal clear 720p HDMI output. Highly recommended for a teen who wants a first smartphone."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great price. . .easy set up. . .Best Buy did it all for me!Cons: Touch screen freezes up sometimes.I'm still in the learning stages. I have had the phone for a little over a month now. Mostly wanted it for the apps/games. Love that most apps are free. . .only downfall is the adverstisements attached. I am very happy with the phone and just need to take more time to learn all of its features. I personally didn't care for the update feature that sincs all your contacts up with your facebook friends. Now I have 300 contacts that I didn't want on my phone. On occasion the touch screen feature tends to freeze up. I will be looking into that. Otherwise. . .great phone. . . great camera/picture quality. Great price!"}, {"rating": "5", "user": "-", "raw-text": "Pros: capabilityCons: bugsThis phone is amazing, blazing fast, excellent multi-tasking ability.One small problem that Motorola needs to fix.The phone has frozen on me about 5-7x now. All of which require the battery to be pulled to get it out of its frozen mode. Pressing/holding the power button does nothing.this phone would be 5 stars... when they fix this glitch. I'm sure its a software issue. I've looked into it a bit and I'm not the only person experiencing these problems."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to learn about all the various things it can do.Cons: Doesn't always fit into dock properly and need to take out and replace several times before the signal is sent.I got a wonderful deal with the purchase of both the Atrix and the keyboard dock. I have been using it everyday and have had no troubles at all. The memory is small so you have to make sure you don't have to many programs running at one time. Lots of free applications available. Able to use the keyboard or mouse to direct applications. Extremely easy to use."}, {"rating": "5", "user": "-", "raw-text": "This is one amazing phone, just upgraded to Gingerbread and its working beautiful, so smooth, battery is much better,Gingerbread is a BIG improvment, this phone is FAST, the dual core processor is the reason along with 16 gigs of memory.If you want an all around nice phone this is the one. Pros, too many to list Dual core Lots of memory Front facing camera Great battery life with huge battery Beautiful bright screen easily seen outdoors. Gingerbread update is great,is much better then 2.2 Froyo Negatives None i can think of"}, {"rating": "5", "user": "-", "raw-text": "Pros: 1) Speed of processor 2) front facing cameraCons: 1) Battery, 2) getting heated 3) not allowing untrusted adroid app.Nice feature with great price.Dual core porcessor, Front facing camera"}, {"rating": "5", "user": "1", "raw-text": "I'm new to the smart phone but have messed with my brothers HTC. I bought the Atrix (AT&T) and love it. My biggest complaint with any phone is poor reception especially with a samsung. I have always had good luck with Motorola and this phone gets reception even way out where I live in the middle of nowhere. The Wifi works perfect and this phone is way faster than the lap top computer I have. The sound quality is great, I can hear phone conversations easily and have had no complaints of the sound quality from the people I have called. The battery seems to last all day and, I'm on the phone messing around all day so no complaints with battery life. The camera seems to take a great picture for a cell phone. I have very high quality cameras if I want to take a real important pictures. I'm still amazed at everything this phone does and how well it does it. I mean, it's a damn cell phone. Whats next breakfast in bed? This thing is awesome. I'm on it more than my laptop now."}, {"rating": "5", "user": "-", "raw-text": "Pros: First off, I did not buy this phone through NewEgg but from AT&T.-Dual core; phone is extremely responsive and multi-tasks like a breeze, only time you'll see it lag for a millisecond is when it is first booting up and loading apps-Android 2.2 with promise of 2.3 later in the year-Front facing camera-16gb internal memory and expandable to to a total of 48gb. - way better than iphone and more cost effective, cost $100 more for 32gb over 16gb, can find a 32gb msdhc card for $70.-Large battery capacity compared to other phones and still light weightCons: -Anroid has it's bugs as all OS do. Issues I have discovered include:-syncing a new playlist from WMP to the device has left all other playlists empty before. Make sure the sync option is set for WMP and check your playlists before thinking your done.-after clearing browsing history, it doesn't clear it sometimes until you reboot"}, {"rating": "5", "user": "-", "raw-text": "Would give it a 10 star rating if possible. Blazing fast speeds love the flash support actually just upgraded to adobe 10.2 amazing got the first firmware upgrade this morning via wifi download was fast about under 2 minutes. Finger scanner is amazing love it for maximum security. Umm what else theirs so many good things apps tho for att purposes they need to stop blocking third party app support. Other then that the phone is an epic win on Motorola's part nice going keep up the good work. Pros: Fast internet speeds on 4g and 3g flash support is amazing. speakerphone is loud and clear. no software issues Cons:I know their was just a firmware update this morning and suppose to fix the battery life since the update so far so good will post more on battery in following week."}, {"rating": "5", "user": "-", "raw-text": "Pros: faster than you can say beast and the screen is made out of gorilla glass. battery isnt embedded like other phones also.Cons: connection over wifi disputes with its 4gthis phone is one of the fastest phone i have used. I had an iphone previously and the atrix is like 4 times faster, no exaggeration. this phone is dual core and has an 8 core gpu processor. despite have those features, the battery life is very excellent. my only complaint i have is that the phone has a connection issue. when i connect to the android store it seems like there is a dispute among the 4g and wifi connection. it seems to decide whether it should used 4g or wifi to download the app. this is only when i am connected to a wifi at any location i am at, although it works fine when connected to 4g. the issue is the internet lose connection and intermits often, but only when i am browsing the android store. browsing the web works just fine.however, i think an update should correct the issue it is having. other than that, this phone is a beast litterally and is getting high tech games made especially for its nvidia gpu processor."}, {"rating": "5", "user": "-", "raw-text": "OK I'll start this off by saying, I've had pretty much all of the top phones on AT&T and T-mobile. This phone android wise is the fastest overall device I've played with. Although I would prefer the HTC Inspires build with the specs of this phone. I'll say when it's finally updated to 2.3 or 3.0 this phone will show its true colors. Pros: Screen Camera Dual Core Processors Tegra 2 in general Finger print scanner (that works) Front Camera Speaker quality Build quality although I don't care of the plastic design. It looks nice. Fastness HDMI out Media entertainment while using HDMI Call quality Game graphics Video playback on TV is great. And gaming too. Cons: MotoBlur sucks 2.2 Lag at times (Not horrible but you'll notice it at times) AT&T's lack of 4G coverage Screen (even though I said it's a pro. It's like 3rd behind the Super Amoled, & Retina."}, {"rating": "5", "user": "-", "raw-text": "Coming from an Iphone / NexusOne,I've been testing phones for the last 5 months looking for a place to land.this is it. I'm not a fan of MotoBlur, so I down loaded launcher Pro. It gave me the interface I wanted & lets me create my own desktop look. The Phone is fast, the calls very clear & data works great. I use the phone a lot & my battery life(especially when compared to other smart phones)seems to be good. The accessories, multimedia dock, will let me connect to my Computer(Desktop or Laptop)the way I would like to connected. Conn The phone feels is a little plastic & the back cover is slippery. ATT high speed is there but is not yet turned on in this phone. I understand that will come in the form of an software upgrade in the next month or 2 to allow it to see & run 4g up / downloads. This could be the only deal breaker!!!"}, {"rating": "5", "user": "-", "raw-text": "Got the phone 2 days ago. It's pretty snappy. I feel like the casing is pretty cheap feeling. Also is there any way to turn off vibrate when tapping on the home, menu, back or search buttons? I've got all tactile feedback turned off but can't find where to shut those off. Battery is ok. I've turned off a lot of the background data refreshing but still draws on it. Even lowered the screen brightness too. Not sure if it's a keeper yet."}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast processor, fingerprint reader, integration with social networskCons: Terrible screen quality, average built quality, motorblurPicked up the phone twice at BestBuy today after ordering it online.First phone was dead on arrival. Phone just didn't boot up even when the bestbuy associate had it charging, so I got a replacement.Here are my thoughts after playing with it for the whole day.I have owned the Nexus one, iPhone 4, Samsung Captivate and HTC EVO before.Pros:"}, {"rating": "5", "user": "-", "raw-text": "Pros: First real android phone for attCons: Docks are the best just yetQuick review. Great phone, blazing fast, AMAZING VIDEO AND PICS, beautiful screen, great battery life."}, {"rating": "5", "user": "-", "raw-text": "Pros: GPSCons: Wish it had a way to attach a tether.My first Android. Compared this with other ATT Androids including wife's Samsung Captivate. Works well. Has nice features like easily accessible silent mode toggle and off/on switch that doesn't fall under your finger every time you pick it up. GPS picks up signal while sitting in cup holder between car seats. Far better than the Samsung. Nice thing is it's size. Newer models are getting much too big. Rocketfish car holder works well, but accessorygeeks.com has bigger selection of cases. Get a task manager if you use google tasks and subscribe to soocial to sync Windows live and Google contacts. Plan to download ski map program for offline access to gps functiion on next western ski trip. Moderate use does not exceed $15.00/200mb monthly quota.I wish new phones had a way to attach a tether. I see lots of people dropping their phones off ski lifts. That's an \"Uh oh, goodbye\" moment"}, {"rating": "5", "user": "-", "raw-text": "Pros: Screen size, battery life (for a smartphone), Android OS, front facing cameraCons: No complaintsI absolutely love this phone since it has been upgraded to Android 2.3.4 some time ago. It now allows me to video chat through Google Talk along with Skype. The battery life is superb for a smartphone. I usually have it off the charger by 7am and back on about 10pm and I am rarely below 40%. It definitely outdoes my wifes iPhone 4. I wouldn't say I'm a heavy user but I do use my phone a fair amount throughout the day and it's even more impressive considering at work I am in and out of service. The camera takes well enough pictures. It's no SLR but more than does the job. As long as it gets upgraded to Android 4.0 ICS I plan on keeping this well beyond my contract is up."}, {"rating": "5", "user": "-", "raw-text": "Pros: HD/High Res CameraCons: There's no keg spout.I left the world of Apple for Android and have never been happier. It takes a little getting used to but it was absolutely a good move. The phone works well. It takes an extra minute to boot up when you restart the device but it is a dual core computer after all. The speed is awesome but sometimes the fingerprint reader takes about half a second to respond. Other than that, no complaints or worries. His resolution front and rear cameras (use Tango instead of Facetime and you can talk to anyone on any phone), outstanding capacitive touch screen (not inhibited by a screen protector), LED flash... the battery life is slightly shorter than an iPhone 3GS but this box is doing more processing power so it's a trade off, not very noticeable. The first few run throughs of the battery cycle will seem shorter but it gets better by the third run through. Highly recommended. BUY A CASE THOUGH!! Protect your investment for crying out loud. I dropped mine once and it's fine except for a few scratches, but why risk it?"}, {"rating": "5", "user": "-", "raw-text": "Pros: Almost everything before the 2.3 updateCons: Texting multiple people, fwding texts, downloading pictures sent in texts, updating anything about a contact from FBI got this phone before the major upgrade to the operating system and I had no problems. It automatically loaded my facebook friends into my contacts list where I could then add phone numbers or other missing information. i didn't have much of an issue with the speed of the phone although sometimes the screen changing from vertical to horizontal would lag a bit. Overall the phone would have gotten 4 stars but the Gingerbread update ruined the phone. Now it blocks me from adding phone numbers to new facebook friends forcing me to manually put in all the information instead of just waiting for my contacts list to update from facebook then updating the phone number. I also cant send a single text message to multiple recipients anymore unless I select some combination of the three choices it gives me(won't let me search or otherwise access my contacts list when creating a new text). I also cant save pictures sent to me in text messages to my phone or forward them to other people. On the bright side, I get a nice flashy graphic when I lock my phone that is similar to a old tube TV shutting off..."}, {"rating": "5", "user": "-", "raw-text": "This phone isn't lacking anything when it comes to power! Awesome battery life and beautiful display! Pros: Dual Core 1GHZ Tegra 2! Screen Resolution! Very Loud! Dual Flash! Very Responsive! 4G!(HSDPA/HSPA+) Finger Print Scanner! Gingerbread! Battery Life is really good! Flash! Cons: Higher resolution camera would have been great! Battery seems to get a little warm at times. Blur! Need I say more! * I come from the iPhone world and I must say that both phones have their spotlights! I love iOS! I am absolutely insane about Android! I've never had a phone with this much power! Flash works great and it just out performs them all so far!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Speed, memory, capabilities.Cons: Battery life.This Android phone is the best that AT&T has to offer right now. It's dual-core processor is lightning fast, and there is plenty of storage available. It also has an SD card slot to upgrade the memory if you go over 16 gb. The finger print reader is also great, so you don't have to type in a password or choose an unlock pattern. Qik and Tango work great between 2 Atrix phones, but is much slower when I have chatted with people that have other slower phones. It also has rear & forward facing cameras which some of the newest phones still don't have for some reason.My main complaint is battery life, I get between 12-18 hours on a charge before I have to plug it in. This is slightly less than my other smart phones. I have minimal apps/widgets running but I still dies fairly quickly. Also, I have problems when I am talking on the phone where the screen will turn on and I will either hit numbers with my cheek or hang up on people. Otherwise great phone, best I have owned."}, {"rating": "5", "user": "-", "raw-text": "Pros: We got it for free!!! It was also easy to set up!!Cons: Would like to see options for a few more things.My husband and I got got this phone when we upgraded. This is a nice phone and we are enjoying the Android market! The phone has great clarity during conversations - even on speaker phone. It is easy to use/learn for those of us that have just upgraded to this type of phone. Cons are few, but there are a few. The notification light can either be ON or OFF but there is only one \"speed\" to see that tiny little flashing light every few seconds. There should be an option to have it blink or stay constant so that you don't have to stare at the phone to know if you have a message. The icons are a little small and so it the lettering when you type a message. Wish there was a way to make all fo that just a little larger. The batter life is great if you are not on the phone all day. When you use it to download, the battery goes very fast - I think that is with most phones like this though.All in all, we are happy with this phone!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Battery, very fast, Sync-ing with Google AppsCons: Doesn't Sync with Outlook (at least not easily), MotoBLUR account isn't usefulI got this phone in August of 2011 and I am really happy I didn't get lured into getting an iPhone 4. The ATRIX is an excellent phone, all capabilities of the smart phone and beyond. It has an excellent battery 1950 mAhr which is almost 150% of the capacity of any regular smart phone battery.The ATRIX is my first android, I have to say that I\"m very impressed with the Android Market and all the available Apps (both Free and non-Free). It comes with a dual-core processor which makes it extremely fast.Above all that, it syncs with your Google Apps so you don't need to import any contacts or calendars if your GMail and Google Calendar have all the needed information. In addition to all that, it has an excellent Camera for both still shots and video recording.I believe that this product could very very efficient with minimal additions. Most important, adding more options of the MotoBLUR account."}, {"rating": "5", "user": "-", "raw-text": "I've been an iphone user for 3 yrs, so I wasn't open for change. I tried using the Samsung Captivate a few months back and was ready to run it over with my car...way to slow and battery life sucked!! Because I use alot of apps, SPEED is really important to me. I must say, the Atrix has stepped up to the plate!! Pros: The battery is amazing!!! fast, fast, fast! Android has a ton of free apps love the finger print swipe to unlock phone.. front facing camera better call usage in areas that my iphone wouldn't perform well. cons: front facing camera is a bit granny :( doesn't charge as quick as the iphone ... This is phone is definently worth trying out. Enjoy!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast, great resolution, easy to useFrom a dedicated Apple user, I switched to the Atrix. It has 4G, which makes it very fast. The ease in downloading apps makes it user friendly. The icons on the main screen allow the user to check for updated email, text, facebook, temperatures, etc... messages at a glance."}, {"rating": "5", "user": "-", "raw-text": "Pros: Very fast and responsive and lots of apps available for itCons: Average camera, battery life so-soAll in all, the Atrix is a great phone. Although I don't think they should call it a 4g phone because it's really a faster 3g connection phone, but I digress. It is a very powerful phone and it runs mostly smooth with a slight hiccup here and there, but still an excellent phone.Pros- Fast phone, and smooth runningIt's Android. Nothing against iPhones or their users, but I preferAndroid.Cons- Battery life is so-so. It's not horrible, but I wish it would lastlonger.Camera is average, not a real complaint on this either but I was"}, {"rating": "5", "user": "-", "raw-text": "Pros: Future proof, price, Gingerbread update soon, fast, screen, fingerprintCons: not as smooth as HTC, MotoBlur, default apps, power button takes some getting used toI was split between the Atrix and iPhone, and having an iOS device since its launch, I wanted to try out Android. I am a heavy data user and I make some calls but the battery is able to last me all day. It also comes with nice accessories and the setup with Bestbuy Mobile was fast and easy. However, I recommend ditching MotoBlur, although not bad but still subpar, and install LauncherPro instead. The stock music app is also bad, but PlayerPro works like a charm. Android took some time getting used to and I even considered jumping back to the iPhone ship, but I learned to love this phone. The fingerprint reader also never fails to make my friends jealous.If this came with HTC Sense or Stock Gingerbread, this phone will absolutely be the best."}, {"rating": "5", "user": "-", "raw-text": "Pros: Display, Design, Processor, AT&T, 4G, Cameras, Laptop DockCons: NothingggThe nvidia dual core processor is blazing fast. Its quadrant bechmark averages around 2,650 which is really good. The qHD display is gorgeous, and the front facing and back facing camera take good pictures, and record nice. This phone has many gadgets such as the laptop dock that may be useful to most people."}, {"rating": "5", "user": "-", "raw-text": "Pros: Nice price on sale for $99.00Cons: fonts appear to be smaller than other 4\" screensPriced at $99 I thought was the time to buy, turns out I don't know if I want to take it back or keep it. It is hard to read fonts on facebook or weather channel but on HTC Inspire it is clear to read and do not need the reading glasses. Bought it May 2nd and still reviewing. Battery life is better than most smartphones. Snaps great pictures and has good features about the phone that does not come with others."}, {"rating": "5", "user": "-", "raw-text": "I really love this phone. I still think the iPhone4 reigns supreme as a everyday phone, but the Atrix offer so much more for the road warrior. I use both the car navigation dock and the lapdock (using now). This is what sets it apart from everything else. You can have a tiny lapdock that extends your phone to more than just a phone. I can access Google docs and do documents. This dock is more functional than any netbook because it is super-portable. Back to the phone...The phone is smoothest Android I have seen yet (and I have seen them all because I have been in the business for a decade). The styling is clean, but not pretty. I do wish like others that it had a metal back (similar to e71 and e62 from Nokia) to be more durable. The flash renders well on all websites. It's just an innovative phone from Motorola, and I think we will see more products like this in the futre. Maybe Apple will create a wireless environment similar to Atrix and lapdock with the iPhone and iPad."}, {"rating": "5", "user": "-", "raw-text": "Got the phone the other day. Was using a Nexus One.This phone is blazing fast. Makes the Nexus One seem slow. Motorola Atrix has a much better speaker phone then the HTC Nexus One. A little too much bloatware for my tastes but I guess that's too be expected for a branded phone. The one thing I noticed when you send a text is the additional android smiley's are not there. My friend has the Motorola Droid 2 Global and it has that feature. I hope I can add that feature. Pro: Excellent call quality(New York region) Nice camera Solid build quality Great screen resolution Silly fast Con: Motoblur(prefer the android skin) Lack of additional android smiley's Just an FYI. I have been with AT&T a long time . Always bought unlocked and unbranded phones. When I upgraded too this phone the AT&T rep noticed I was using an old Cingular sim card. Replaced it with the AT&T sim. Said I would get better call quality. I can definitely say it is much better. The people I am calling said I sound much better on there end. Hope this info is useful to any other AT&T customers."}, {"rating": "5", "user": "-", "raw-text": "Got mine in yesterday and I love it. Runs extremely fast, has a lot of great options, and, of course, has flash!!! I don't mind moto blur too much but I will say that it needs to be updated to at least LOOK better. Maybe some better functionality but aside from an out dated feel to motoblur, the phone is phenomenal. One of the things that sucks though is that AT&T hasn't turned on 4G in my area. Yeah, that whole \"100%\" of our network is 4G stuff is BS Pros: Camera is very clean and fast Extremely fast processing Gorgeous screen UI functions quite well Android 2.2 is much nicer then 2.1 Flash AWESOME Accessories!!! Cons: Motoblur feels outdated No 4G in my area. That is AT&T's fault, not the phone's Overall, I say get it. It's the most potent thing on the market right now and has some of the most useful accessories around. Fantastic phone"}, {"rating": "5", "user": "-", "raw-text": "Pros: The style and how thin it is..Cons: The battery life is not so greatThis phone is very slim the call quality is good.. :) I was not sure if AT&T was going to be good but have not had any provblems thus far."}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast and easy to use.Cons: Make sure you pack your charger if you are gone more than a day.Good phone, and Best Buy gave me what I thought was very helpful advice. This is my first smart phone and Best Buy was very patient and helpful in getting me up and running prior to leaving the store. The downloaded manual is somewhat cryptic, but most of the phone's features are intuitive, so I have not had any problems with the applications I have needed so far. It comes with an App that allows you to open office documents, but it does not have an App pre-loaded that allows you to open Zipped or Compressed files. Battery life could be a little better, but I use it quite a bit so I have to recharge it at least every other day.All in all, the phone delivers as promised and I am satisfied with the performance. The dual core processor is a nice feature. Voice recognition also works very well. I think it is a keeper."}, {"rating": "5", "user": "-", "raw-text": "Pros: Ease of useCons: could use better browser controlsThe Atrix was my first smart phone. The easy of use is wonderful. If you are on wi-fi it ignores your mobile data plan. It has been really easy to find and download apps."}, {"rating": "5", "user": "-", "raw-text": "Pros: Size, durability, weight.Cons: background data usage, unexplained shutdownsThe phone is great. I really enjoy it. The reason I gave it a 4 is two fold. First the Data Usage, if you leave the background data on it racks up your data usage. In 2 days with watching only 2 movies I hit my data usage of 4 gb. The second issue is if you leave the data usage on at night, it can sometimes shut the phone off. This can be a real inconvenience if you have an alarm set and it doesn't go off in the morning or you miss an important phone call. Apart from those 2 things. The phone is a good buy. It's sturdy and can take a little bit of abuse. I'd recommend it in comparison to some other phones I'd seen. Always look at the reviews before you buy a phone. That's what I did."}, {"rating": "5", "user": "Mesa", "raw-text": "This phone can do it all. If you look at the features listed in the phone you'll notice that phonescoop doesn't say it can do data tethering, mobile hotspotting, PC sync, etc. But the fact is it can. i just compared this phone side by side with the new iphone 4s, and the only thing that iphone beats it in is the camera by 3 megapixles, and the display 540x960 vs 640x960.The atrix is nearing a year of release and its still my choice over the droid bionic and the iphone 4s. and the fact that the processor in the atrix is made by Nvidia is always icing on that cake"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to textCons: text on messages are small and hard to readNew to smart phones but this phone was everything it was billed as. Have had no problems and does everything that is asked of it. Only isue is that I wish I could change the size of the text messages so that I can read them without reading glasses. But no biggy."}, {"rating": "5", "user": "-", "raw-text": "Pros: Love the ease of learning it.Cons: Dimmed screen in the sun, does not have an auto adjust that I have found yet.I love this phone and wondered how I stayed faithful to the BB for so long.... I love it. Also the swype to text is the best thing since slice bread!"}, {"rating": "5", "user": "-", "raw-text": "Cons: keyboardthe phone gets really hot when it's under a heavy load. that can be due to the dual core processor. im only worried about the battery. heat decreases the battery's lifespan."}, {"rating": "5", "user": "-", "raw-text": "Pros: Blazing fast, easy to use, good camera, great battery lifeCons: Terrible call quality. Unable to update to Android 2.3This is by far the fastest Android phone I have ever used and owned. unfortunately that blazing speed will not do you much good if you can't make good calls. I have been using this phone heavily for three weeks, and everyone I have called on every carrier has been unable to hear me except when I hold the mic close to my mouth and raise my voice significantly. Not good."}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast and feature rich.Cons: Battery life, but that's expected.It is one of the fastest and easy to use phone, as long as you do not get a defective piece. My first atrix used to hang a lot. But since my wife's atrix works perfectly, I exchanged it for another one. This one is perfect. Lots of great apps available for the android. Call quality is great.I plan to buy a multimedia dock next."}, {"rating": "5", "user": "-", "raw-text": "Pros: Best phone ive ever hadCons: nothingBest phone ive ever had, very fast, beautiful resolution, and I dont mind the battery life, i think its fine... its a big battery which is needed to power its dual-core processor..."}, {"rating": "5", "user": "-", "raw-text": "I love this phone and all the features. In the beginning I had a problem with the finger print sensor, but I think an update fixed it, but then the update took away addresses from the address book. I am still working on finding what they did to the contact list but as of now I have yet to find it. The battery life is long, but possibly not as long as advertised if you are using the navigate (the free google navigate which is a great addition). Overall, I like this phone and I am still learning about it even after having it for 30 days."}, {"rating": "5", "user": "-", "raw-text": "Pros: Fast, multitasks well, nice games availableCons: data not much faster than 3G phonesI recently bought this phone because I found my old phone a little sluggish at times. I figured the dual-cores and extra RAM would speed things up. I was right. My previous phone was no slouch, but the Atrix is noticeably faster. I can have several things running at the same time without problems, and it also runs games much better. I certainly think it's worth a look if you want a powerful android phone. I haven't noticed a huge increase in data speeds coming from 3G to 4G, but it's still a great phone."}, {"rating": "5", "user": "-", "raw-text": "Pros: gingerbread, cpu, ram, graphicsCons: battery life, at&tThe phone is great and fast. However AT&T's 4G service is horrible making calls bad and texts slow. This phone has no 3G so your stuck between 4G and edge. The apps and web are fast and flawless. This is almost the only phone on AT&T with 2.3 Gingerbread. Yes, it has gingerbread even though some sites say 2.2"}, {"rating": "5", "user": "-", "raw-text": "Pros: unlocked, dual core, great battery, great screen, lots of mem and storageCons: There were a couple things, but they have been remedied.The bootloader has been unlocked and the custom roms/themes/kernels are being created. I am using them now and this phone is now 100% complete to me. This phone flies, its stable, and the battery life is GREAT. I have had more then one instance of well over 24 hours in a single charge. I am a power user, but with some tweaking, it really lasts. I love everything about this phone and I recommend it to anyone who wants a future-proof phone that really performs, tweaked or not."}, {"rating": "5", "user": "-", "raw-text": "Pros: Android 2.3, fingerprint scanner, bright screen, dual coreCons: short battery life when using a lot of widgets/servicesI got this phone after extensive research and after having an iPhone 3GS. I love it and will never go back to iOS. I am a total convert to android. This phone is extremely fast with its dual core processor. The fingerprint scanner on the back takes a little getting used to but once you do, it is so much faster than typing in a passcode. I have to have my phone secured since I get work email on it so this feature really helps. I love the motoblur widgets even though they do take up a lot of battery. Speaking of battery, that is one of the drawbacks. Although since the upgrade to gingerbread they just realised, the battery life has increased, it is still a little lacking."}, {"rating": "5", "user": "-", "raw-text": "Did not like phone when 1st played with @ AT&T store. Then they had upgrade to Android 2.2.1, which helped considerably. They've had another upgrade that actually hurt the usage of the fingerprint scanner, so I no longer use it,(no biggie). The Tegra 2 is fast & smooth. Of course vidio is excellent. Has the clearest & loudest sound of any phone I've had, from iphone to Captivate. GPS works flawlessly & Google keeps upgrading & makes it even better. Cons; Only ones I can come up with screen is not as bright & crisp as Captivate.(No phones are). Cannot turn 3/4G off when unnecessary to conserve batt. like iphones. Which means batt. bearly last a whole day. Conclusion: Excellent High Powered phone. Also nice to have Android 2.3.4 now."}, {"rating": "5", "user": "-", "raw-text": "Pros: dual core, android, hd video, hd screen.. etc..Cons: Some atrix handsets have microphone issues.This phone is amazing.. Its fast and powerful. Yes HTC has SENSE... but they dont have dual core processing... this phone is in its own category right now. Buy it."}, {"rating": "5", "user": "-", "raw-text": "I switched from the iphone 4 to the atrix and i must say that i am happy with my decision. Atrix tops iphone in so many ways and can do things iphone cant even do when it is jailbroken. Only thing that apple has on this phone is the selection of games and slightly better battery life. Pros: *Screen-with it being bigger then the iphone 4's the retina display doesn't look better *Speed-this thing fly's through websites uploading things very fast *Size- This phone is very slim to pack so much inside im impressed *Finger Print reader- a great feature to insure nobody can unlock your phone but you no longer a need to hide you pattern unlock from prying eyes *Speaker- loud ringtones and speaker volume talking on speaker is a pleasure *Camera- picture quality is great and it has a double flash for night time photos *Memory- This phone already has 16GB of storage without a card and if you add one it opens up the possibility to have up to a total of 48GB of memory with a 32 GB Card. Great for movies or big music libraries *Dual Cores for fast processing programs open up fast and web pages are rendered without many hickups *HDMI PORT *Gorilla Glass Screen *BIG BATTERY *SD CARD position- you can swap them without taking out battery *Light Weight but solid feel CONS *ONLY DECENT BATTERY LIFE not great but not bad *Slippery when not in a case *Lags at times for a sec *only using software 2.2 not 2.3 *If you dont like blur this is a CON *Android market is good but not as vast as APPLES APP"}, {"rating": "5", "user": "-", "raw-text": "Pros: Hardware specs, bluetooth, camera, performanceCons: Software customizations and restrictions from Motorola, no 4G service on this 4G phone, color saturation and accuracyAnother reviewer stated it clearly regarding the locked bootloader on this phone. I've returned mine. In about 1 year when this phone is obsolete, and a few years after that, when support from Motorola stops for this device, if you've paid the full price as I did, and essentially own this hardware, it's running on an open source operating system that Motorola has locked down. Imagine purchasing a laptop that restricted you to one version of Windows, and you could not remove the \"extra\" factory software or install any other Operating System of your choosing. In the same way with this phone you cannot load a new ROM or customize it with a locked bootloader. I will gladly reconsider re-purchasing this phone when Motorola allows the removal of its software customizations, and gives the users of this device the ability to run PURE ANDROID.Otherwise, the accessories are great, battery life is great.. this is a hardware plaftorm to be proud of. Unfortunately, the software is the other half of this equation, and it fails.Also worth noting is the 4G advertising surrounding this phone. You cannot currently obtain anywhere near 4G speeds, much less 3G on this device at the time this review is written. This phone in-fact downloads slower than 3G when compared to other phones from the same carrier."}, {"rating": "5", "user": "-", "raw-text": "This kills my old Htc Evo. The menus are fast! My Evo would take 10-15 seconds to open up one txt mesg. This phone clocks in around 2-3 seconds. Everything is just way faster. They battery life on its great. I would go through 2-4 batteries a day on my Evo. I can make it all day on the Atrix."}, {"rating": "5", "user": "-", "raw-text": "Pros: Zippy processorCons: Screen is somewhat less than I was used to but quite adequateThe only negative that comes to mind is that the screen is not as sharp and bright as my Samsung Captivate was and it seems somewhat smaller. The phone does not shut down by itself and rarely freezes like my Captivate did. It also runs a lot faster. The screen differences can be easily overlooked with much better phone operation."}, {"rating": "5", "user": "-", "raw-text": "Pros: Internet accessCons: so far nothingI got this to replace a cheaper phone that I had. My place of work has lousy computer system, and could not access hardly any of the sites I needed. Using this phone, i can find anything I need."}, {"rating": "5", "user": "-", "raw-text": "Pros: Speed and ease of useCons: Some small features and battery life is ok for typePhone itself is powerful and quite useful..Android OS works well..a few minor complaints about user friendliness and had phone restart on me and not pick up data network..otherwise runs flawlessly..pictures and video are pretty good..storage is comparable to other leading phones..I think it's worth the money. Battery life is ok..nothing to brag about"}, {"rating": "5", "user": "-", "raw-text": "I have had it since 02/23/11 . I had no problem with it . since the gingerbread it been even faster and nicer. call quality is good ,battery life for a smart phone is good unlike the Evo. easy operation. Love the new gallery and face book features that evo does not have as well able to make groups for your apps if you do not want them on the screen . I like the fingerprint scanner don't know why they took it off the next generation atrix and photon for sprint. Don't know why when u make a call it stays on with no way to erase it that I found in the favorite section . Over all a good phone not a perfect one . The gingerbread improve the phone a lot . Motorola has a hit final . it no Iphone killer but close . there is not like the other androids the same this is really a step up ."}, {"rating": "5", "user": "-", "raw-text": "Pros: case design, size, expandabilityCons: short battery lifeThe thing I like the most is the cheap plastic backing combined with the gorilla glass on the front. It seems like it should last a long time, and the backing should be easy to replace if damaged.It was just upgraded to Android 2.3.4.I like have the infrastructure of docks, so that I don't have to always use cords to plug it into things.I wish the battery lasted longer. Depending on how I use it during the day, sometimes by dinner time it's down to 15% battery life."}, {"rating": "5", "user": "-", "raw-text": "Pros: SpeedCons: NothingThis is my first smart phone and I love it. I know some reviews were bad because it is not as open as other smartphones, but I think it is fine even with the motoblur. I love all the apps and the speed and fluidity of the controls. Wish I had 4G to get the full speed but that is not because of the phone. Overall I cannot complain about anything and I am very satisfied."}, {"rating": "5", "user": "-", "raw-text": "I really wanted to like this phone, I really did and I do for the most part but for some reason, it's unreliable with Outlook 2007. I noticed that some appointments sync, others don't. I don't have this problem with my iPhone 3GS and I didn't have this problem with the HTC Inspire 4G when I tested that. The missing appointments were not missing on either of those phones. Seems rather odd to me but it happened and if I can't rely on my smartphone to keep me organized, I can't use it. I can't trash this phone because it's truly beautiful. The UI isn't the greatest but I can live with it if I had to. Other than that one flaw, this phone is one powerful piece of equipment."}, {"rating": "5", "user": "-", "raw-text": "Pros: download speed, ease of learning the phoneCons: battery lifefor several years i had the blackberry devices ... android OS is nothing compared to blackberry hands down ! This device runs flawlessly thru apps and downloads very fast. Couldnt ask for a better phone but the battery life can be a little bit better."}, {"rating": "5", "user": "-", "raw-text": "I bought this phone after returning the samsung captivate. The samsung was a little easier to use however the sheer power of this device is unmatched. If you're not tech saavy get the samsung or inspire for android or the iphone 4, but if you are willing to spend a couple hours to have the best phone possible then get the atrix."}, {"rating": "5", "user": "-", "raw-text": "Pros: extremely fast, dual core and it has a nvidia GPU! 4\" screen is much nicer to type on than my ip4's 3.5\" screen, widgetsCons: All the apps I used on iphone are on android, but some don't look as nice, just as functional though!I was able to score an iphone4 without extending my contract, but having owned an iphone since the 3g I just got bored with the OS. It was revolutionary a few years ago, but I feel the competition is passing them up! Well I decided to bite and I wanted to stick with ATT, so I did some research and to my surprise I find this phone which won the best of CES and it was coming to ATT!! I guess ATT needed something now that they aren't the exclusive iphone carrier. Well it was the best decision I ever made. I was a little worried that it was going to be too hard to use, but I think I found out why people say this misconception. There is so much more you can do with this OS than the iphone could ever do. It is endless, I never see myself getting bored because I can change whatever I want. I don't think it is anymore confusing than the iphone, because if you don't want to dive into all the OS can do you don't have to, it is only as difficult as you want it to be. The phone has an awesome video tutorial when you turn it on that helps tremendously. The phone has absolutely zero lag whatsoever just like my iphone which is always what I was worried about. All of the apps I used on my iphone have an android counterpart which was nice, not all of them look as"}, {"rating": "5", "user": "-", "raw-text": "Pros: The freedom that comes with the Android OS, and the horsepower under the hood.Cons: Battery life isn't great, and I miss some of the apps on my iphone.Besides the not so great battery life, i'm very happy with this phone."}, {"rating": "5", "user": "-", "raw-text": "Pros: speed, ease of useCons: att, the teathering fee is pure greedi just bought this for my wife, after buying her an iphone 4 for valentines day.....the iphone had bluetooth issues and we were unable to customize ringtones...so we exchanged it for the atrix....it was one hundred dollars less, and should have been a hundred more. the phone is thinner than i thought it would be after reading the reviews, very comfortable t hold, though i would recommend a case. the screen is great, responsive without being too touchy, the speed is fantastic, the memory is good allowing you to remove and add by sd card is great . call quality is superb, and the bluetooh works great!!! we had custom ring tones downloaded from itunes, with the isyncer app, from a mac, in no time....this phone is better than the iphone 4, and believe me im sorry to say that, i really wanted the iphone 4...it just didnt cut it fo us"}, {"rating": "5", "user": "-", "raw-text": "Had the phone a few days and noticed the battery drains rather quickly even when there is not a big load on the phone. Has anyone else noticed this? At the rate it drains, I have to charge the phone a couple of times a day."}, {"rating": "5", "user": "-", "raw-text": "Pros: 1ghz dual core CPU, 1 GB of ram, 720p recordingCons: body seems like it will not survive a few drops. AT&TI just picked this phone up earlier and have been playing with it ever since. I just came from the iPhone 4 so i am just getting used to android. I love the look and feel of my iphone, the atrix 4g feels more plastic-ky and less durable but it still has the hardware to back it up. it is the most powerful phone out right now, but its kind of not needed at the moment. hopefully with further updates and me actually getting used to android OS, this phone can be a 5 star rating. Just if i cant get a ROM in it when rooting, it is a shame."}, {"rating": "5", "user": "-", "raw-text": "the look and feel rivals the samsung Nexus S.Pros:-Swipe keyboard with microphone-Dual core makes things snappy-Better resolution screen-Awsome finger print reader-I thought Motoblur would suck, but its nice and simple, plus adjusting sizes for widgets is a plus.-Social network integration for facebook and twitter is great.Cons:"}, {"rating": "5", "user": "-", "raw-text": "Pros: Duo core. Nivida Tegra 2, Front facing camera,Cons: Not as many apps as IOS.Ive used Iphone since 2007. Used Blackberry os6, windows 7, Palm OS. Ive even used couple different android phones. (Inspire 4g, Nexus one)Atrix 4G by far the best snappiest phone I have ever used!Ive always said that nothing would convert me to a hardcore android user... till the Atrix. Very fluid everything is fast and smooth. Only draw back is that doesnt have as much apps as Apple."}, {"rating": "5", "user": "-", "raw-text": "Pros: fingerprint power buttonCons: pwr on indicator and 3rd party VoIP/SIP functionalityPretty decent phone, and I especially like the fingerprint power button.One annoyance is you can't tell if the phone is off or on, and the only way to activate the screen to verify that it is off is with the power button which turns on the phone if it was off.THE MAJOR FLAW: Many applications like Ooma HD Mobile don't work with this phone. So if you use VoIP or specifically SIP applications please beware. After 9 months on the problem ticket I've given up that it will ever be fixed. Oh well maybe a Samsung next time around........................"}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to useCons: short battery lifegreat phone, have always considered myself technology challenged but i,ve been able to figure out how to use quite easily, used online support a few times to help, but would highly reccommend this phone."}, {"rating": "5", "user": "-", "raw-text": "Cons: I am learning!The kids have this phone - and I wanted one, too. So, since my contract was up with my old phone - I went and got this one. My son-in-law is figuring out hoe to use the associated lap-top and will teach me this weekend."}, {"rating": "5", "user": "-", "raw-text": "Pros: Very powerful phoneCons: no problems yetVery powerful phone, much better than my wife's iPhone 4. The dual core processor and 1 gig of ram makes everything much better. By this and you will not be sorry."}, {"rating": "5", "user": "-", "raw-text": "Pros: easy to use and awesome screenCons: short battery life and get really warmThis is my first Smart Phone really easy to use and set personal settings internet navigation is simple apps are awesome. Battery life is horrible but i was told that when i purchased, it also gets very hot and then shuts off and have to power cycle to restore, even when i am not using and its hot outside this happens... gonna have that looked into. Other then that i love it and even have some of my iphone friends really liking it."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to use and lots of neat gadgets.Cons: Not sure yet.I have had this phone for about a month and still love it. I am daily finding new things this phone will do. It still amazes me. I love it!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: fast and funCons: keyboard still a struggle for old fingersThis is my first \"smart phone\".I have been having a ball doing all kinds of new stuff on my phone, like finding new apps, playing Angry Birds etc."}, {"rating": "5", "user": "-", "raw-text": "Pros: fun to useCons: needs charged all the timeI was always afraid of a smart phone, but I took to this one right away. It is fun to use, and I wonder why I waited so long!"}, {"rating": "5", "user": "-", "raw-text": "This is my first smart phone. When I was comparing phones, everyone I talked to told me to get the iphone because it would be easier for a beginner. Obviously I did not take their advice.I love the fact I can customize it. I also love the fingerprint reader.I've had the phone for a month and I haven't found anything I dislike yet."}, {"rating": "5", "user": "-", "raw-text": "the atrix 4g is a great fast phone i have had the iphone 3g the iphone 3gs and the iphone 4g i got the atrix 4g 5 days ago and i love it faster then then the iphone and apps are free that are not on tunes and it is lighter and just so much better this is the best phone i have had in a while i still have not figured out everything this phone can do but already can do more then any other phone"}, {"rating": "5", "user": "-", "raw-text": "I love this phone EXCEPT: I'm currently on my 3rd atrix. I had the previous 2 replaced b/c the headphone jack quit working properly. So I got my 3rd one less than a week ago and guess what - it happened again! The headphone jack doesnt work! 3 atrix's all w/ the same hardware problem. It's a shame bc its otherwise the perfect phone."}, {"rating": "5", "user": "-", "raw-text": "I was very pleased when I received the Motorola Atrix 4g and I just wished that I gotten it before I went and bought the Nokia C6 but I was trying not to have to pay so much for the phone but I'm glad I did because I'm getting my money worth. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: 1Ghz dual core processor, Customizable roms, docks, gps card dock, easily rooted, runs emulators seamlessly, play hd movies and video games on big screen tv, portable gaming and home console system, excellent phone, Android os is amazing. Can link with laptop dock and be rooted to give you full ubuntu exp from your phone.Cons: Wish battery life was longer but it last all day assuming you aren't running a playstation emulator or something that is heavy, advanced task killer is a must have app(Kind of a downfall with android that it doesn't automatically close programs even when you hit close) Wish it had the new 2gb or 4gb ram chip. Gets hot.The phone is by far amazing and I suggest definitely getting a screen protector and case right away although I dropped my phone a few times before getting a case and the gorilla glass on this phone is simply amazing and holds up well. Emulators play back wonderfully and the custom ginerbread rom from xda forums is almost a must so that you can hook your phone directly to your tv and do webtop over your tv. After which using an emulator you can full screen your mobile view on your phone and connect a wii mote and play with up to 4 of your friends essentially turning this into a portable gaming system. It's great to play super smash again. Also there is a webtop hack that removes the limitations of the webtop and gives you a full ubuntu desktop(still in testing and can brick your phone), the fact that it's even possible though is amazing."}, {"rating": "5", "user": "-", "raw-text": "I've had this phone since the day it came out and it's the one of the best phone I've owned. Pros: Re-sizable widgets Social networking (Facebook, Twitter, etc.) and RSS updates are phenomenal The qHD display is very bright and crisp The finger print scanner is an enjoyable touch to the device Dual LED flash works very well 4 inch screen is very nice to type on GPS is ridiculously fast I have never EVER been as impressed with a phones responsiveness ass much as this one, you push a button or swipe the screen and the Atrix flies, it never stutters or thinks or anything, truly awesome. Cons: I've had several people complain that they have trouble hearing while on the phone I've had the phone lose data connection on me a couple times, but that may be an AT&T issue out in the far western suburbs of Phoenix You can't download non market apps The music player is very boring You cannot play HD videos without converting them, and you are able to do so on both Samsung and HTC No dedicated camera button After just looking over the phone I've realized that the micro SD slot is under the battery cover... but seeing as how I just noticed that, it may not be a big issue No touch to focus, the focus box stays in the center of the view finder so you can't move it to where you want to focus, you have to move the phone itself Battery life is just as good as any other Android phone... so it sucks. The cons hardly take away from device, in the end it comes down to what you prefer, if you want a nice media"}, {"rating": "5", "user": "-", "raw-text": "Pros: super fastCons: battery lifei am a iphone user for 3 years and i like my iphone but when i got this phone i change my mind dual core rocks ! and its on sale for 100 last month when i upgrade to this android thing its so fast and screen is clean im never going back to iphone"}, {"rating": "5", "user": "-", "raw-text": "Pros: Resolution is qHD (Second highest only to the iPhone 4)Dual-Core 1GHz processor and 1GB of RAM makes this pretty much the fasted phone on the market to dateHardware is solid and qualityRootable and custom ROM's are available but with complications.Voice quality is amazing compared to iPhone, \"4G\" speeds exceede that of the iPhoneAnd if you root it, you can enable tethering for free, great if you come from an iPhone plan with unmetered dataAndroid OS has great customization and many appsBiometric unlock is incredibly usefulCons: Motorola encrypted and digitally signed the bootloader"}, {"rating": "5", "user": "-", "raw-text": "Pros: Extremely fast. You basically never wait on anything except the network itself.Cons: This is identical to the one you get from AT&T on contract, and has all the same restrictions.In particular you cannot install apps that don't come from the marketplace (e.g. beta builds of Firefox) without rooting it, since AT&T or Motorola has removed the \"allow untrusted software sources\" option. You have to root it to re-enable this option."}, {"rating": "5", "user": "-", "raw-text": "Pros: Overall featuresCons: Locked BootloaderOver all would be a great phone, but because Motorola decided not to open up the bootloader for developers, I can not support it. When they stop supporting the phone, I should not be left with an obsolete device after a years time while still under contract. Those developers are the ones to keep it up to date when Motorola decides to drop it. Also for security reason."}, {"rating": "5", "user": "-", "raw-text": "I have had the EVO, the Epic, the Hero, the iPhone 4 and the Captivate. The Motorola Atrix blows these out of the water. I honestly do not mind the moto blur, and with this phone speed is not a problem. I have broken down some pro's and con's. PRO's-- Battery Life ( 24-25 hours, medium high usage) Screen Resolution Fingerprint Reader HDMI out Games [play smoothly) Quick response Laptop Dock is amazing 4 inch screen is nice Sound quality is amazing Froyo (sucks compared to 2.3 but the flash 10.1 is amazing) The Camera has dual led flash 16Gb internal memory with 32 additional able to be added. Tegra 2 is FAST CON's-- Phone is slippery Back pops off when taking case on and off Retina Display is better (iPhone4) 4g is disabled from what I hear(no 4g in my area) Camera is a tiny bit grainy in low light area, flash helps with close objects though. Overall this is an amazing phone, tops any phone I have ever had, I sold phones for 6 years and it pleases me to see something like this set the next gen phones in place."}, {"rating": "5", "user": "-", "raw-text": "This is the first one of the first phones whit a dual core processor, it does'nt feel that way it lags web running applications or games compare to my old Iphone 3gs."}, {"rating": "5", "user": "-", "raw-text": "Phone is very fast but it should be with a dual core AT&T 4G network is a joke hopefully it will run better and faster by the summertime at least in NYC is barely up to speed with other carriers 4G speeds My Girl is on sprint and her phone 4G speed runs circles around my BS AT&T 4G speeds nuff said dock is great and all but Motoblur sucks you know what.So its a good buy but simply a prototype for what.s yet to come."}, {"rating": "5", "user": "-", "raw-text": "This phone is very fast and for an android phone it is very smooth with scrolling and pinch to zoom. Had and iphone 4 and made the swtich and could not be happier was a fantastic move. As soon as AT&T gets HSPA+ up and running this phone should be screaming. It is the best phone I have ever owned"}, {"rating": "5", "user": "-", "raw-text": "Pros: build quality, speed, loaded with featuresCons: still not getting the great 4g speeds with att, but if you have you can speed through any download anyway.awesome phone, and the laptop dock is slick and elegant."}, {"rating": "5", "user": "-", "raw-text": "Pros: Dual Core Processor, 1GB of ram whats not great?Cons: MotoblurMotoblur is not as bad as everyone makes it out to be. There are actually a lot of widgets that are very useful to most people. Besides that this phone is amazingly fast and responsive. I would highly recommend this phone to anyone in the market for a high end smartphone on AT&T."}, {"rating": "5", "user": "-", "raw-text": "Pros:: Battery,, Call quality,, Silly fast processor Cons: Laptop dock is expensive After using over a dozen smartphones in the last 12 months including the iP4 and several Android…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Hardware Cons: Software 1. Highest Res Android phone w/ 24-bit color TFT LCD Screen and Corning Glass. I compared this screen to Captivate it is much, much…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Almost everything before the 2.3 update Cons: Downloading pictures sent in texts,, Fwding texts,, Texting multiple people,, Updating anything about a contact…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Comes with wall adapter and allows use while docked.,, Very solid. aux audio out Cons: A little spendy. you will probably have to remove most cases for…"}, {"rating": "5", "user": "-", "raw-text": "Pros: android systemCons: as per revscreen to small and keypad input is too small too hard to read the screen since the letters are too small"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Bluetooth,, Camera,, Hardware specs,, Performance Cons: Color saturation and accuracy,, No 4g service on this 4g phone,, Software customizations and restrictions from motorola…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Landscape mode for phone allows me to watch videos while working. Cons: A bit pricey for a dock,, Even the iphone dock is cheaper. I bought this primarily as a dock,…"}, {"rating": "5", "user": "23,", "raw-text": "Pros: All ... Cons: none I have had this phone for two weeks.. always have great service, never freezes up. Great apps and features! Best phone I have ever had."}, {"rating": "5", "user": "3,", "raw-text": "Pros: Big 4\" display screen ... Cons: no FM Radio Reviews on latest mobile phones from leading brands. We recommand to take a review before buying so you can…"}, {"rating": "5", "user": "-", "raw-text": "Cons: nothing so farlove this phone and the price was right ...great deal ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Not a whole lotCons: AlotIt's not all that as they said it would be, Kinda dull and Battery life sucks. Iphone 4 is better"}, {"rating": "5", "user": "-", "raw-text": "I've tried so many phones and this one works great. Just dont play Jewelquest on it or use the appointment calendar. ... Weakness: Crashes on some games.…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Comfortable,, Usability Cons: Pricey / poor value a bit high price compared to other cellphone docks (eg Iphone) but it works perfect! love it!"}, {"rating": "5", "user": "23,", "raw-text": "Pros: latest technology / very fast ... Cons: battery life sucks love this phone better than the i-phone."}, {"rating": "5", "user": "-", "raw-text": "Pros: Good battery life, best in class cpu/ram and up to 48 GB of storage spaceBest android phone to date! Works great. Have had no hiccups to date!"}, {"rating": "5", "user": "-", "raw-text": "Pros: everythingCons: great battery life bestBest phone by far, easy to use you want go wrong with this 1."}, {"rating": "5", "user": "-", "raw-text": "Pros:: Dual core and it has a nvidia gpu! 4\" screen is much nicer to type on than my ip4's 3.5\" screen,, Fast,, Widgets Cons: All the apps i used on iphone are on android,, But some don't look as nice,, Just as functional though! I was…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Easy to use,, Speed Cons: Att,, The teathering fee is pure greed i just bought this for my wife, after buying her an iphone 4 for valentines day.....the…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: 1 gb of ram,, 1ghz dual core cpu,, 720p recording Cons: Body seems like it will not survive a few drops. at&t I just picked this phone up earlier and…"}, {"rating": "5", "user": "12,", "raw-text": "Pros: hi ... Cons: hi i love this phone"}, {"rating": "5", "user": "4,", "raw-text": "Pros: visit site for details ... Cons: visit site for details Reviews on latest mobile phones from leading brands. We recommand to take a review before buying…"}, {"rating": "5", "user": "-", "raw-text": "Pros: light and durable, I love all the apps that are availableI really like the phone. I like the voice commands and it is easy to navigate."}, {"rating": "5", "user": "-", "raw-text": "This is my first smart phone. When I was comparing phones, everyone I talked to told me to get the iphone because it would be easier for a beginner. Obviously I did not…"}, {"rating": "5", "user": "-", "raw-text": "ive had the samsung captivate, htc inspire, and motorola atrix, and the atrix is by far the best , way to go motorola !!!!!!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros:: 1gb of ram whats not great?,, Dual core processor Cons: Motoblur Motoblur is not as bad as everyone makes it out to be. There are actually a lot of widgets…"}]