[{"rating": "2", "user": "-", "raw-text": "Pros: Awesome still and video camera options make this handset more of a camera with a phone than a phone with a camera. Web browsing options are pretty nifty adn the GPS is useful. The software for docking with PC, the ability to link up with outlook etc had been really good. The music player plugs in nicely to a set of speakers and provides a good mp3 player option.Free car mount is good for the phone, my Garmin GPS and or my iPod.Cons: Well where do we start....1. Battery life is diminishing by the day it seems2. Slider opens in your pocket and buttons get pressed so you start ringing random contacts accidentally from your pocket.3, LCD screen is prone to damage. One completely blacked out (warranty repair) then.4. LCD cracked even though it was in a NOKIA N95 factory case....another repair.5. Destroyed a sim card rendering it dead....another warranty repair.6. You cannot disable two of the nav buttons,7. MAny of the menu options and pathways are clunky and dislocated."}, {"rating": "2", "user": "-", "raw-text": "Pros: 5MP camera, accelerometer, aGPS, application enriched!, 8GB, Speaker quality, VERY Easy to use, and moreCons: ABSOLUTELY TERRIBLE battery life! but thankfully removeableI did lots and lots of research on a number of phones, including this one, on the best one to buy. I had a list of things I wanted in a phone and I have to say, this phone not only had everything I've ever needed, but I was surprised on things I didn't know about! For instance, I didn't even know it had an accelerometer when I bought it! But for now I'll just list the major features and review them:CAMERA(s): The main 5MP camera takes great pictures. Obviously it's not the same quality as a stand alone, say Sony Cybershot of equal quality. But the different scene shots and bright flash make up for that. (portrait, night shots, fast-moving, etc) Video is as good if not better than a Sony Cybershot point and shoot camera. (You can even edit pictures right on your phone!)CALL QUALITY/SPEAKERPHONE: Call quality has been very good. Speakerphone is VERY loud thanks to the pair of high quality speakers.GPS: The assisted GPS antenna on the device is pretty good. When using Nokia Maps to navigate, it takes very little time to connect (5-10 secs mostly) You have to keep the slider open however to get good signal. If you don't like nokia maps, you can always buy/download other software like Google maps, TomTom, etc. Very handy."}, {"rating": "2", "user": "-", "raw-text": "So after almost a year and a half of hearing about this phone, and it finally coming in US form, and a sweet deal I couldn't pass up, I had to replace my N75 with this. Best decision I have ever made. I think it's funny how since it's release, I haven't seen one phone from a US carrier that comes close to what this offers. Highlights: -Great 2.6\" display. -S60. -WiFi. -GPS (a little slow getting started but works well and there's even a cool \"GPS data\" application to track speed, mileage, time). -Built in Nokia Maps. -HSDPA is pretty fast (900-1380 kb/s). -S60 browser is superb and yes there's flash support here (Flash Lite). -Reception is tops. -Stereo speakers are very loud and sound great. -Music player is very good but only using aftermarket headphones. Nokia's suck. -5 MP camera is excellent. -VGA video recording is excellent. -Battery is good enough to last me a full day with web surfing, checking email, watching videos, listening to music, texting, making phone calls, updating my calendar, and using Google maps. -Nokia's firmware updates. Disappointments: -Made in Korea (I expect to see Finland under the battery). -Build quality can be better. The phone creaks almost all the time when grabbed where the microSD hatch is (weakest part of phone). -Front facing camera can be bothersome since it sticks out off the face of the phone 1mm. -Find myself hitting the end key, instead of the clear button sometimes. -The lip below the bottom row of number keys is annoying for me a lot of"}, {"rating": "2", "user": "-", "raw-text": "Pros: Easy accessible programs. Offers everything for the person with the use of every part of the phone. Very loud and clear listening of the speakers for music and videos. GPS is great and useful, especially the talk guide, clarity of picture and video is crisp. Wifi is very fst and easty to get to on websites. Back pages on internet is great. Plenty of software which makes the phone even fun. The phone is very fast and very durable, along with its reception is great. Nokia does have a reputation of good reception service, Even on hilly areas in which usually my phone has dropped many times before. Easy to use when downloading Adobe files and documents through email. The teleconferencing is great use for those using video share, but be sure you have the network to provide this service. The sliding is much better than the other N95 US version, seems to feel more solid and smoother. Which I bought for a my business manager. The use of the phone is overall good as you will see what I feel needs work below. I would still recommend this phoneCons: Phone's battery life is not as great as it should be. The cost is extremely high, why pay for a N95US when you can buy this for 60 US dollars more for 5 more gigs. The buttons very small, not good for those with big hands as my self (since I am also a Judoka), youve got to use your nail to type on text or dial sometimes. The earpiece where you listen to talk on the phone is too low and could be louder. It seems as though other"}, {"rating": "2", "user": "tech", "raw-text": "Pros: Durable, Easy Buttons and Controls, Lightweight, Long Battery Life, Neat Features, Strong Signal ... Cons: Learning Curve Nokia hits a home run with this very competent phone and dual 5 MP camera! Maybe not as good as a stand-alone digital camera, but, for snapshots (optical zoom is a weakness), this comes very close and makes carrying one device extremely handy. Camera even has video capability at 30fps! Nokia should have put the Xenon flash on this device like the N82 or N78, but, it works out fine for daytime shots. If you're relying on this camera for night shots, you're expecting too much! This is for the North American N95-3 edition. This phone is manufactured in Finland. I previously had a Nokia 6682 for three years and the phone still works fine... handed it to a family member! This new and updated Symbian firmware set brings this phone experience to whole new level! In case you did not know, Symbian , unlike other mobile OS platforms is a very mature extremely stable (read rock solid), memory efficient operating platform. This phone is on the Series 60, 3rd edition. It is the most populated phone platform worldwide outside of North America. The Symbian OS while intuitive may take some time getting used to. Once you're acquainted with it, you will not want to go back to another phone platform. Very good owners manual and excellent toll free support for this phone. This phone has 160 MB of internal memory vs. the 8 GB for the N95-4. The key difference between"}, {"rating": "2", "user": "R.", "raw-text": "I purchased my Nokia N95 Slingbox Solo bundle at a steal of a price 550 w/5% off buy.com loyalty equals a very low price compared to now. It did take a while for me to get my items because when I purchased, later that day it went into backorder. No worries as it was shipped the next week 4 days after ordering. Came in two seperate boxes. The N95 is the -3 version which handles the american version of 3G. I am currently running it with ATT Wireless and it runs so beautifully. It came with a lot of accessories such as video out cables(awesome), headphones with mic, 1gb nokia micro sd, etc.. I was able to pop in my 3g sim and start browsing the web immediately. The free nokia apps are very well done, check out their beta apps as they are wonderful as well. the 5 megapixel camera takes incredible pictures. I took some spectacular pictures at White Rock Lake in Dallas; the picture clearly took the surroundings and even downtown skyline in the background. My other high profile phones with x Megapixels could not even come close to the detail and clarity. I use shoutcast.com on my phone all the time, listening connected to my car s speakers connected thru bluetooth. It works very well. The GPS is great when using Google Maps, but with the Nokia Maps loaded onto the phone it is very tricky. It will not give you turn by turn navigation even without voice unless you purchase the voice navigation. I think that is a crock. Still learing the GPS but works good, takes 1 min to lock into"}, {"rating": "2", "user": "-", "raw-text": "Pros: The Nokia N95 8GB is an excellent phone. It has all the great features that you would want, compacted into one little phone. It has GPS, more than enough memory to store your favorite videos, pictures and music on the go, wifi and bluetooth technology. It has great audio and excellent web browsing. It is fast and easy to navigate through the phone, audio is clean and clear and it has an excellent selection of software available.Cons: Its battery life is not so good especially if you watch videos or listen to music regularly.Overall the Nokia N95 8GB is an excellent phone. Its like your own personal multifunctional device. All the Nokia N95 8GB needs to get is touch screen and it would be the perfect phone. It is even better than the iPhone."}, {"rating": "2", "user": "-", "raw-text": "Pros: I love that the memory size allows me to have all my music, photos, even videos all in one device. The camera is fantastic, I never remember to carry a seperate camera so it's been a godsend. The good people at nokia have made it easy to update photos, music, and applications as you can use Nokia's OVI suite, media player, or adobe to link with your computer. Excellent battery life and a sturdy body that lasted me through just over two years of use.Cons: It was a little blocky, and did eventually become slightly 'buggy', though nothing that actually made the phone unusable. Applications remained open after use and needed to be opened and closed to reduce battery drain, though again, a minor issue.This was my first 3g enabled phone, and it really opened up mobile internet for me. I walk or run daily, and this phone was fine no matter how much sweat, grot or even light rain I exposed it to. The..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Very easy to navigate the menus. Great camera and MP3 functions. Good reception on the phone calls.Cons: Flimsy battery cover. Sometimes slides open in my pocket. There are things on the main menu screen that I can't seem to get rid of. Alarm clock is hard to find. Battery life is fairly short in comparison to other phones I have used. A bit bulky.I love this phone. It does everything I need it to and more. The camera and MP3 functions are very handy because they mean I don't have to carry a separate camera and music player as well. The..."}, {"rating": "2", "user": "-", "raw-text": "Pros: I liked its support for Flash lite and wireless network which enable me to enjoy Facebook, Orkut, Google, VoIP, SIP Phone, Skype, etc without paying extra for data plans. It supports java and thus holds the capacity to do anything with ample of inbuild space including music downloads, etc. Its support for video output is great and 5mp camera makes it an alternative to digi cam if not a handy cam. Superb browsing and working speed with moderate battery life (lasts nearly for 30hrs for me) makes it a complete phone in black.Cons: The phone price is a bit at high end though its features are of good standards. Thickness is a bit of concern and the keypad is kind of unflattened which is uncomfortable at times.Nokia phones generally have a good resale value. So its a worth of try given its good speed and lots of other features making it a complete phone and can be a good style statement for you. ..."}, {"rating": "2", "user": "-", "raw-text": "Pros: It is easy to use, the menu is well set out and it has an easy slide.Cons: It is bulky and the screen and sides crack easily when dropped, even in a case.This phone is great to use as the menu is well set out and not cramped like many other phones. It has great Mp3 sound and a large memory card for storing songs, photos and video. The camera is really..."}, {"rating": "2", "user": "-", "raw-text": "Pros: The screen is huge, the camera is very good quality, has lots of extra features, good battery life and the music player is pretty loud.Cons: I had software problems with this phone from day one. I've owned it for a bit over a month and i'm only just getting the hang of it now so i wouldn't recommend it if you need something easy to use. the instructional guide was no help. GPS feature is good but make sure you check whether your service providor supports all areas cause my didn't so i can't use the gps in my city. The first phone started crashing from the first day, and I needed to get a replacement phone, which then needed software upgrades. i also find the buttons very sensitive, which i don't like.A generally good phone once you get the hang of it, but i don't think i'd get it again given a second chance. it does come with lost of great features isuppose, but by the time i figured out how to..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Good phone with lots of features. Solid, stylish, clear reception and good sound.Cons: Hard to find the clock and alarm. For awhile I was using the calendar reminders instead as they were easier to find. Battery lasted about 4 days initially but (6 months later) it now lasts only 2 with around the same sort of usage. This is a problem with all phones though.Really like this phone, works well, looks good and suits what I use it for, every day use, occasional music or video playback. ..."}, {"rating": "2", "user": "-", "raw-text": "The Nokia N95 is, in my opinion, the Smartphone of 2007. I reviewed the i-phone but I'm not sold on their concept, so moving forward. I will keep this in a detailed pros/cons scenario. PROS Camera: With a 5 Megapixel Carl Zeiss, other than some Sony Ericsson's, nothing comes close. Seriously, I don't use optical zoom, so I no longer need my stand-alone digital camera. Could use a stronger flash though. I'd give up some battery life for a stronger flash. :-) Video: The fact that I can watch it on TV without it being pix elated is sheer delightful! By far the best video/phone I've had yet. Symbian: I have used Palm, Windows and Linux. While I like Linux, Symbian by far is the most user friendly OS. Very robust and personally think it has more running for it than any other platform in the market. Also, you'll love the Video Center where you can watch news, YouTube and even do Podcasting. Screen: Colors are brilliant and well lit. Web Browser: Better than ANY browser on the market. That's a promise. GPS: A little slow (1 or 2 minutes) to grasp connection but once it has it, you're hooked. Wi-Fi: Every smartphone should have wi-fi if you ask me and not your carrier. :-) The Gizmo project application's nice, too! CONS None for me although I would have wished for, oh, a bigger battery. :-) I think battery life's is good but not exceptional. The bottom line is this is NOT a phone. A phone is what you plug into your wall a ONLY talk on. On this you can watch videos, browse the web, blog,"}, {"rating": "2", "user": "-", "raw-text": "I have had this device for about six months and, I have recently purchased a new 8gb version of this device so now that I am done with this device I'd thought i'd submit my review. I really like the camera on this device the 5mp camera is the best I've seen so far. As a matter of fact it is better than most digital cameras I've seen. The Carl Zeiss optics is off the chain. The call clarity is crystal clear. I think the sliding camera mechanism on the back is cool too. I love the dual slider however the buttons for the multimedia functions are difficult to use and press. I was pleasantly surprised that phone could actually accept a 4gb mirco SD card which allowed to pretty much load up my phone with mp3 files. The sound quality for the music is superb! However I would have liked it I could get more bass with playback. The ergonomics is of the device can be tricky at first but you can easily overcome that. Despite the fact that I could not get 3G service in North America with this device, I was still pleased with it's EDGE speeds and capabilities. Overall, I am very impressed with the overall performance of the N95-1 and, I really look forward to getting my N95-4 8GB. Based on the feedback I've heard so far I'm sure that I would be having a better mobile experience. Pros: Nice big screen High bright resolution screen Excellent Camera Great sound quality for calls Speakers are very loud and clear for music Cons: You have to get used to ergonomics of the device Lack of bass when playing"}, {"rating": "2", "user": "-", "raw-text": "I have been in the Cell industry for 17yrs and am one of the few left who still field test, repair, and refurbish phones. I am an independent and have no allegiance to any Service Provider. This Nokia N95-3(Make sure you have the N95-3 NAM North American Model)is still the best all around phone available in the GSM Technology.It blows away the Apple iphone in Reception, durabilty, camera, wifi, video, sound & cost of useable features. It doesnt have a touch screen,but touch screens are over rated & expensive to fix. Some of the negative reviews on here are quite simply moronic. They give it bad remarks for not having a Qwerty keyboard. Thats like buying a red car and giving it a bad review because its red. If you need a qwerty, don't buy a non qwerty phone. I've no problem using the T-9 and can text almost as fast. The camera, is by far the best. There are now equal, and higher, MP cameras out there but they don't have the Carl Zeiss Optics. I'm not a camera tech, but a few have told me better optics beat higher mp's. I have actually printed these pics on 4x6 and 5x7 prints and they look great. The GPS is amazing. Don't get the Nokia maps though. You can get the full Garmin maps from a few shops like myself. Just look for an Old-School independent in your area. He shouldn't charge you more than $75 & you have a full GPS with NO monthly Charge. I've even downloaded maps from all over the world for my customers. The wifi is strong. I can sit anywhere in any hotspot and quickly"}, {"rating": "2", "user": "-", "raw-text": "Pros: Great Camera, easy to use, good looks, decent sound, expandable memory, cool sliding design.Cons: Sliding screen can open in your pocket, program is a bit slowI used to have one of these phones and it was great. It is the best phone i have ever owned besides my new iphone. It took great photos and with the expandable memory i could keep all my music on..."}, {"rating": "2", "user": "-", "raw-text": "First off the camera is BANANAS!!! Auto focus 5MP camera. Need say no more. There is no micro SD slot, but who needs it when you have 8 gigs of memory already installed in the phone. I use the phone for Sprint and the internet is super fast. No complaints with this handset. The battery life is superior to its predescessor and the screen is bigger and brighter. The phone isnt perfect, but what model phone is."}, {"rating": "2", "user": "-", "raw-text": "Pros: The large memory(8 GB), The double-way slider mechanism, The great looks, The amazing features, 5 MP Camera(wow!!!), Good music, Wi-Fi, GPS, Large screen, Great surfing!!Cons: Average battery life, No camera shutter, Looks a little bulky, May not be so durable as for the cost.The large memory allows an unbeatable amount of music in the phone. The large screen is definitely a plus. The N95 comes in a neat black finish and hasa rather ergonomical look to it. The phone's..."}, {"rating": "2", "user": "-", "raw-text": "Pros: 5 MP camera, Best MP3 player, Durable, Long Battery Life, Neat Features, Strong Signal ... Cons: NONE This phone does it all. But unlike some expensive smart phones, reception and voice quality are excellent. 5 MP camera is full featured with excellent picture quality. Music player can be used as a mini boombox with quality sound reproduction. Internet and FM radio sound great. With GPS, bluetooth, WiFi, 8Gig internal flash memory, excellent web browser, 3G ATT network capability, voice command, etc., iphone looks a little short on functionality."}, {"rating": "2", "user": "-", "raw-text": "Pros: Excellent phone features, easy to use. Very clear speakerphone and easy to select. Beautiful clear photos. The camera has so many features and the display is clear and concise. FM Radio that shows the artist & title.It has a lot of software on it, like Adobe Acrobat. It has 8GB memory, 802.11b&g Wi-Fi, many great features.Cons: The e-mail view is not user-friendly. The main issue is that when you delete a mail, it only draws a redline through the icon nect to the mail. It leaves the header of the mail on the phone. It is not possible to fully delete using the phone. I called Nokia and they said that the only way to get rid of the deleted mail on a POP3 account is by going to your server and deleting the mail there. For me the purpose of a PDA phone is to be able to use it in place of my computer. I receive too much spam even with filtering. I need the flexibility of deleting mail on the phone.Unfortunately, this was the only reason why I did not give the N95 an excellent mark. Other than this, the phone has high marks.The overall phone is amazing. If the e-mail feature does not bother you, then this phone would be perfect for you. If I did not need access to e-mail often and did not receive so much spam, then this would be the right phone."}, {"rating": "2", "user": "-", "raw-text": "Purchased this as an impulse while Comp USA was going out of business. Pros: 1. Camera: Many custom options, great in low-light. 2. Phone Quality: It's built extremely well. 3. S60: Series 60 is no doubt the best and most tested mobile phone system at there. 4. Navigation w/WiFi: Enough said with that, works well and can sync over WiFi. 5. Connectivity, offers Nokia's signature ability to pull signal where most can't. 6. Memory Card (4GB in there right now on mine). 7. Community: There are so many user groups out there, it provides a sense of connectivity with other mobile users. Cons: 1. Battery life: Which can be tweaked to get anywhere from 2-5 days instead of a few hours. 2. Ear-piece volume is lacking at times (which afflicts many Nokia phones). 3. Great for European 3G, but the NA version would be great on AT&T's 3G service."}, {"rating": "2", "user": "-", "raw-text": "Pros: Durable, Easy Buttons and Controls, Lightweight, Long Battery Life, Neat Features, Strong Signal ... Cons: Limited keypad This is the phone I finally chose to replace my old Treo 650. I own the N95-3, with US 3G hi-speed internet. The Symbian OS is much more stable than Palm OS, but is almost as simple, and it has full multitasking capabilities. The voice quality is just outstanding on both the calls received and how I sound to other callers. The included web browser is a gem. Very fast and capable of viewing almost any web page. The included GPS receiver works great, albeit it is a little slow to lock on to the satellites, but when locked, it wont lose the signal. The maps are downloaded via the 3G connection and are quite accurate. The music player is just a charm and sounds with clear highs and deep lows. The sliging mechanisms fells solid when slinding in either direction. The only minus is the small dial pad. Composing a text message takes patience. The included office software is limited to only view documents. The office upgrade is very good for view and making quick edits on the go."}, {"rating": "2", "user": "-", "raw-text": "Love this phone!!! I love using different phones... Latest one I have got is this phone after HTC Diamond, I know Diamond just came out but still I love N95.... Wide screen... Dual 5 MP camera with fantastic picture quality... Video quality on this phone is very good, I won't say Excellent.... This phone's wifi works everywhere love it... Battery life is excellent. talk time if fantastic and voice quality is gr8. This phone is worth every dollar spent. Even if you are buying this phone from your friend I would recommend you to get this phone.. Speakers are very nice quality... Overall I would give 9.5 out of 100 to this phone...."}, {"rating": "2", "user": "-", "raw-text": "Pros: Everything you need is here. EDGE 32 class gprs modem! 5 mega pixel camera.Cons: sliding set some times get messy. i had to repair it's keypad, but after one and a half year.This is the best phone ever (but not now). It's got all. Camera, n-gage games, awesome music player, symbian 3rd edition software, lifeblog, built in GPS! just foe a record i would tell that if you..."}, {"rating": "2", "user": "-", "raw-text": "Pros: It's lightweight and so easy to use. Huge memory and excellent photo / video clarity with the Carl Zeiss Lens. Music & Data capabilities are brilliant and I got it on Virgin at an unbeatable price!Cons: Haven't found a fault with it yet.Best value top end Camera /Phone / PDA out in the marketplace. Had a Nokia N90 before this and it was fantastic too, but just a litle weighty. ..."}, {"rating": "2", "user": "-", "raw-text": "Talk about an I-Phone Killer! This phone is awesome and Nokia finally hit the jackpot. Ive had my share of phones and as I used to be one of those guys who made excuses for why the I-Phone is so good I've stopped to see the real I-Phone. The N95 is just plain great! I've had it now for about a week or so and I just love it. The phone is so unlike . Many phones have media players and that is just one app. On the N95 the Media Player is a whole new section of the phone a new UI (User Interface). This has many pros and no cons so heres a couple of em'. Pros: Nice Screen Best Web Browser Ever Awesome Media Player Great Screen Resolution Best Service Wi-fi Stereo Speakers VGA & Higher Video 5!!!!!!!! MP CAMERA! Carl Zeiss Lens Dual Slide & Many Many More! Cons: None"}, {"rating": "2", "user": "-", "raw-text": "Pros: Good camera, large screen.Cons: Clumsy menus and navigation compared to other phones. Phone is slow to respond to some requests. Unable to customise many settings/features that you can do on other phones. Phone is very bulky. Very poor battery life. Phone often performs whatever function it feels like when idle.I got the N95 8GB model for a few reasons. My camera needed replacing, as did my phone and MP3 player. I was delighted to find a phone that I thought would competently perform all these functions to..."}, {"rating": "2", "user": "User", "raw-text": "Browse the internet, write a document, send emails, listen to mp3's, Realplayer to watch MP4'S, video calls, Play Flash games, GPS nav system. What else could u want? Just some of the extras added on from previous models.With a battery life of 5 days on stanby and a charge time of only 1.5 hours how can you go wrong.It recieved an 8 because of its size, but you need that for internet surfing.Optus also provides 1gb Downloads a month on $79 dollars cap Plan and the phone can be used to provide internet for your laptop using nokia PC suite provided. At a speed of 28kbps via 3G. ..."}, {"rating": "2", "user": "-", "raw-text": "Wow, I cannot believe the price of this phone! Wow, I cannot believe how crappy and difficult the S 60 operating system is! Wow, it has a 5 MP camera, too bad I never got to try it out seeing I could not figure out the phone. Wow, the GPS thinks I live in Canada! I live in Wisconsin (close, but not Canada). Wow, the numeric keypad is small and hard to type on. Wow, the browser looks alot like Opera Mini. The final two wow factors... Wow, I can't believe I returned the phone less than 24 hrs after buying it, and... Wow, I can't believe I just took the SIM card out of it and put it back into my iPhone 3G ZERO Stars. Wow."}, {"rating": "2", "user": "-", "raw-text": "Pros: Good Phone and features very handy and entertainingCons: Few isues volume key stopped working just after 1 year. Then the flash lite went off so pictures not so good in low light conditions. Now the phone keeps switching off although the battery is fully charged. Its now just over 2 years Too expensive if it slowly dies. Any advise Please....Its good phone and Nokia is reliable or was?? Had a nokia earlier which is still good after 9 years so stuck to this brand not sure about this phone. Apart from this I still think of Nokia for mobiles ..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Great Phone, compact and easy to use.Cons: battery life seems to fade quickly.Great phone with easy to use applications, good slide and great music and pictures. The applications are easy to read and use and i really have enjoyed this phone alot, the slide to access your music..."}, {"rating": "2", "user": "-", "raw-text": "Used the N95-3 whihch is the latest version (besides the 8GB) version for US. Came with the larger battery now being used for this phone. Pros; Camera - amazing pics for a phone Bluetooth - works well with headset WiFi - connects easily and fast 3G - web pages load very quickly PDA/Smartphone - allows you to sync online with Exchange for calendar, contacts, tasks and email. However, if you keep notes in contacts only first few lines come over. Music - great speakers. Sounds great. Solid operating system - never locked up. Cons; Battery - you will not last the entire day without charging even if you turn off Wifi, 3G and bluetooth. I tried every configuration and even with the larger battery it is not acceptable. Size - the phone is thick. Not very comfortable in pants pocket because of that. Overall, the phone feels very solid and packs a lot. If the battery would last an entire day, it would have been a keeper and I would have rated it higher."}, {"rating": "2", "user": "-", "raw-text": "this is one of the few phones i have owned that hasn't left me wanting. it has everything what more could you ask for. A five mega-pixel camera in a phone, it really doesn't get much better. 8gigs of internal memory. decent battery life and i am a power user so i do threw batteries like no body's mother. wi-fi, gps , great multimedia support, and the phone is not locked down like a virgin on Saturday night like the iphone. nothing really to complain about with this phone. Definitely worth the price point."}, {"rating": "2", "user": "-", "raw-text": "Haha, the Nokia fanboys aren't going to like this, AvgJoe, I'm sorry but you hyped my head and let me down. Obviously this phone has amazing features, it literally does all of the big things as far as GPS, wifi, 5 mp camera, video, etc etc. It's crazy the features. But, I miss the little things from my blackberry or iphone. Quick run down: Pros All the features listed above Cons -Browser is stupid compared to the iphone, don't tell me about opera mini, iphone browser kicks a$$. period. -t9 texting after having a blackberry and iphone? terrible, it's the hardest thing ever, I quit. -size, too thick -colors, visuals, etc, not good, that was another thing great about the iphone. -Nokia maps is not as good as google maps, it's too euro-ish. -the slider gets old. Anyway, what it comes down to is I don't use all the features enough, therefore it comes down to the little things day to day. This phone is nothing special day to day but obviously brilliant when you need to do it all. It really is a great phone, but not for me."}, {"rating": "2", "user": "-", "raw-text": "Pros: the N95 is the first Nokia phone to have a GPS facility and the WiFi access facility. The double sliding facility makes it easy to use - Slide it left for music and slide it right for the keypad. The music and recording quality are satisfactory.Inbulit PDF viewer and 5 megapixel camera with flash are other key features of this phone.Also the TV out cable provided by Nokia helps a lot.Cons: The only problem I felt with this phone is that the buttons under the screen respond very late ,that is the program startups using shortcuts takes some time.It is an excellent phone with an extremely powerful web browser that loads up quickly and the camera quality is unbeatable. I have been using this phone for about half a year and it hasn't disturbed..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Excellent included applications, easy to use, great form factor, fast navigation, excellent audio and video quality, excellent selection of available software (free and otherwise). Extremely feature rich with Wifi, bluetooth, and other communications features - plus there's a phone in there too. ;-)Cons: Battery life is so-so if you're going to view a lot of videos or listen to a lot of music throughout the day, doesn't come with a case of any sort.The N95 series is Nokia's flagship series of phones. They are extremely powerful, well-crafted, and very much worth every dollar you pay for them. I've had a number of Nokia's in the past (N series and E series) and this one is the very best."}, {"rating": "2", "user": "-", "raw-text": "Pros: It's probably one of the best phone nokia has ever made. Uses all 8Gb's as ram so it is almost impossible for the phone to freeze. Fast interface that supports even web 2.0 apps. The GPS is a great add on and the new Nokia maps interface is amazing. It also has the amazing sound quality that Nokia is known for! (One thing you need to remember is that you have to make adjustments on the phone configerations cause the phone is not made for the US market).Cons: Sometimes depending on your provider your might have sound quality problems! Also it doesn't support office applications as well as I would expected to do. Price a little high but worth every pennie.If you want to get a quality phone, that is the best I've tried in a while. I used to write quality reviews for cellphones in Europe and I just want everyone to understand that these phones are not made for the networks here, but this doesn't make them bad!"}, {"rating": "2", "user": "-", "raw-text": "After about 10 week using Nokia 6120 Classic, my son bought me Nokia N95. Herewith my review on both Nokias: Nokia N95's plusses: - Excellent 5 Mp Carl Zeiss Optics Tessar Auto focus camera. - Built in Internal GPS. Though USD 42 Holux GPSlim 236 GPS receiver is more superior (http://www.phonearena.com/htmls/Nokia-N95-Review-review-r_1744-p_7.html) - Stereo sound, wifi connection, infra red. - For my age, bigger display with same resolution does really help. - Feel more robust and sturdy. Nokia 6120 Plusses: - Built in display rotation. - Built in panoramic shot. - Small, lightweight and economical. - Candy bar form factor will last longer as no moving parts. - Better battery life. I charged the phone battery once every 4 \u0096 5 days. Both phones work well with 8GB Micro SD Card. The other features are about the same, as both are Symbian S60 3rd so my programs collections for Nokia 6120 Classic are also work with Nokia N95. N95 has 4 times bigger internal memory (ą 40 Mb vs ą 160 Mb) but with 6120's 40 Mb I had not yet faced any problem. So if I have to buy a new phone from my own money and for my own use, I will still go for Nokia 6120 Classic (or Nokia N82 now). With additional USD 42 Holux GPSlim 236 Bluetooth GPS receiver it will also guides me as N95 does even with better satellites connections. But of you really need the following features: - Infra Red & wifi Connection, - Stereo sounds for music & other multi media as what N series are built for, - Show off with"}, {"rating": "2", "user": "-", "raw-text": "Pros: Easy to use, fast response, good quality sounds and camera. Loundspeaker is great.Cons: a bit chunky, dont like the dual slide feature and dont like that there i stuff on the main menu scrren that i cant remove.After having a horrible time with another type of phone i am extremely happy with my N95. It does everything i need quickly and efficently. The mapping comes in handy. ..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Stability, MultifunctionalityCons: No touchscreen as N97This is great device for Browsing Internet, Listening to music, Playing N-Gage2 games... Installing lot's of applications and using them all at the same time just minimizing unactive applcation to tray not closing it...Great camera...Excellent GPS...Nice clear & loud sound...Fast enough (128mb RAM), has 2 - 339Mhz (CPU) and 220 Mhz (GPU)I can create my playlist while downloading news via browser, weather via widget and files via torrent... and with GPS working background... instead of cold start (very long on every GPS) every time I turn it off then on...at the same timeIf you want multifunctions as in your desktop PC - you must have this one."}, {"rating": "2", "user": "-", "raw-text": "Pros: EverythingCons: Haven't found anything yet.I have 4 phones, Iphone 2nd generation, 3g iphone 8g, Nokia E71x and Nokia N95 and the N95 rocks it's way through. As with any mobile phone, there will be the great and not so great features. Apple has two things going for it and thats a free flowing touch screen and qwerty board. The N95 has eveything else. With the Iphone third party apps require jailbreaking which if done to your voids your security blanket. The N95 comes with EVERYTHING already installed and the one thing I really like is that I can connect to the internet using it as a true modem. Iphone, uhhhhh, NOT. N95 is an all around phone that lets you do everything and if you're a phone geek then it's the phone to have. If you want a phone that won't let you down then it's the phone to have. If you want to hear your phone ring from 3 rooms away, it's the phone to have it you want a REAL mobile phone be it for work or entertainment, it's the phone to have. Video, audio, documentation or just calling up a friend, it's the phone to have."}, {"rating": "2", "user": "-", "raw-text": "Pros: Has a 5 megapixel camera and good camera features.Has great ways to view your photos - slide shows, etc.Has very good and clear speakers.Cons: Battery life is very poor on this phone.It's wide square shape doesn't make it very comfortable when holding up to your ear for talking.My desision to purchase this phone was based on all the great things I had heard about it.My favourite feature of this phone would have to be the 5 meapixel camera.It took a little while to get..."}, {"rating": "2", "user": "-", "raw-text": "Hi Folks, This phone is absolutley amazing, I'm here to clear up a few concerns. Firstly the battery life was considered below average and Nokia has released the new 1200amp battery which is substantialy better. This phone offers high end smartphone users to use the Wlan and multimedia business apps to use this phone effectivley in the workplace. Nokia will also be intruducing an 8GB version of the N95 under the assumed Music version. Some applications may be missing on that line due to the extra memory. This phone is not only for smartphone users but the everyday user, incorporation of the media dual slider mode makes it the most wanted phone among youth also. PRO wlan dual slider 5MP camera DVD quality video **comes with AV cables for easy viewing on a TV smaller than the N80 with more punch Better battery life now The latest firmware has been released Mac and PC compatible (Quite good with Mac's I might add) CON Some complain about the materials, I have no problems though Sluggish, which really depends on your memory situation The price factor, the lowest price I have seen personally is at http://www.hi-mobile.net I hope I've helped, I'll keep everyone posted about the music edition N95 in the upcoming months."}, {"rating": "2", "user": "-", "raw-text": "Pros: best camera in mobile phone. i dont know of n96 though.u can use gps by downloading maps from nokia and dont have to pay fees to operator.unlocked.video is also good.Cons: doesnt work well on all network. i had att and it was working fine,.. i shifted to tmobil and its like another small budget phone...not tested well in north america.this phone is pretty good deal in case u have good operator, its not tested well on north american markets. probably with nokia qcom deal we may see some good products from nokia as well."}, {"rating": "2", "user": "-", "raw-text": "I upgraded from a Nokia N70 to this phone about a month ago and recently upgraded the firmware to version 11 (via Nokia Software Update). This phone is as close to perfect as I can imagine for my needs, and can only imagine that firmware updates in the future will fix the minor bugs and glitches I'm currently experiencing (the firmware update I just applied fixed a lot of them) PROs: Every function that I loved in the N70 (which is a lot) got improved. Slight functionality improvements to the parts that already worked well, and completely new features that rock my socks. * 5MP camera takes great shots in daylight, very decent shots at nighttime, though I'd suggest using the night mode versus automatic for those. * WiFi is awesome. * Web browser rocks. Much better, IMO than the Opera browser on my N70, which was very good in it's own right. * OS (S60v3) response time is *much* faster than my N70 (S60v2) CONs: * Even with firmware update, camera takes too long to start (though once it's open, taking pictures works quite well and quickly) * Maybe it's just my particular hardware, but it takes a ridiculously long time to find a GPS signal. Most of the time it just doesn't get a location at all. (However, once it does find a signal, it's spot on for the rest of the time I use it)"}, {"rating": "2", "user": "-", "raw-text": "Pros: Takes decent photos and the call volume is loud.Cons: The slider mechanism has problems, only after about 3 months after purchasing it - it actually won't open or close half the time. The buttons for the MP3 player are cracking and the chrome on the directional pad is wearing out.After paying a large amount for this phone all I can say that it was a very regretful purchase. The photos do come out good but even so take a while to be captured. The video quality is ok but not..."}, {"rating": "2", "user": "-", "raw-text": "I too had a N-73 and enjoyed it but decided to upgrade because I prefer a slider to a candy-bar and wanted the wi-fi. I have had no problems with the phone and love the camera. You can take a picture and e-mail it within seconds by either using the wi-fi or your carriers internet connection. Unlike the N-73 witch would freeze alot until I upgrade the firmware , I have not experienced this at all. Battery life is fine considering all the applications it has but will drain quickly if you use the Gps and the wi-fi. Overall I love it and would higly recommend it."}, {"rating": "2", "user": "-", "raw-text": "This phone has all the bells and whistles, works flawlessly and has the best reception of any phone I have ever utilized. Pros: Great reception/signal strength, battery life is superior. Cons: quickery keyboard is difficult to utilize and get used to. If you're sending lots of email best to look for a full keyboard phone. Sorry, but phone is over priced at $700-$750.00. Doesnt have an expansion slot. Overall if money isn't any object go with the N95 as its still what I believe to be the very best phone in stability and reliability out there."}, {"rating": "2", "user": "-", "raw-text": "Pros: Speakerphone quality, camera picture quality, applicationsCons: call quality, battery lifeBought this phone a few months ago, and it offers a lot of options. First of all i would have to say this phone has the best speakerphone i have ever had on a cell phone. Very crisp, and can be turned up extremely loud. However I would have to say on the other hand the call quality of using the handset is below average. Even when the volume is turned all the way up, it is sometimes difficult to hear who you are talking to on the other end, and that can be annoying. Sometimes I am forced to turn the speakerphone on when I would prefer to use the handset just in order to hear the person clearly. The downloadable applications are very impressive, alot of options as far as those are concerned. The camera takes great pics. The battery does get used up fast when you are using the applications. One other thing is that the lcd screen will scratch and show marks, so I would highly recommend some type of shield or screen protector. Overall a solid phone, I would say above average in most aspects."}, {"rating": "2", "user": "-", "raw-text": "Pros: It's a really attractive phone and I love the numerous buttons on the front of it. The screen is really nice and large so I don't have to squint to read texts or anything.Cons: It seems to have a bad battery life after a long period of time, and I'm scared of accidentally dropping it because I don't want it breaking.I would recommend this phone if this is all you would pay for a phone, but otherwise I would recommend you invest in another maybe more expensive phone so you know you bought a good quality phone. ..."}, {"rating": "2", "user": "-", "raw-text": "Pros: * Nokia reliability* great screen display* brilliant camera* robust.. I've dropped it at least a dozen times and it still works!Cons: * scratches easily (having said that i am tough on my phone0* battery life is a little short for my liking, but I get around it by charging it every night...*timed profiles.. aren't a standard feature (see below)this is the best phone i've ever had.. I went away from nokia for a while and tried nec, phillips etc. but they were never as good or strong as Nokia.. the camera is worth the price alone... while I..."}, {"rating": "2", "user": "-", "raw-text": "Pros: MP3 Player; 850,900,1800,1900,2100 3G; Wi-Fi Calling (SIP); Freedom; Functionality; Wi-Fi; 5mp Camera; GPSCons: No touchscreen; No QWERTY boardThis phone is superior in many ways to the iphone. It has the 3g internet capability (if you'd like to opt into a 3g plan to utilize it), 5mp camera with camera savvy options (not equaled by the iphone). Ability to make and recieve calls via sip (internet calling... including but not exclusively Skype... try Truphone or Tpad). World network compatible. It doesn't have a QWERTY keyboard or touch screen but those are for small fingered game players.If someone wants the availability to own their phone without contract and high monthly rates, enjoys traveling, would like a Phone, Wireless device, Camera, MP3 player and GPS all in one 8g package with the flexability to choose a plan that works best for them this is the phone for them.Trust me when I say, I've done my research and it was between a Blackberry and n95; and even the Blackberry doesn't have the funtionality of the top Nokia N-series device."}, {"rating": "2", "user": "-", "raw-text": "Pros: MP3 Player; 850,900,1800,1900,2100 3G; Wi-Fi Calling (SIP); Freedom; Functionality; Wi-Fi; 5mp Camera; GPSCons: No touchscreen; No QWERTY boardThis phone is superior in many ways to the iphone. It has the 3g internet capability (if you'd like to opt into a 3g plan to utilize it), 5mp camera with camera savvy options (not equaled by the iphone). Ability to make and recieve calls via sip (internet calling... including but not exclusively Skype... try Truphone or Tpad). World network compatible. It doesn't have a QWERTY keyboard or touch screen but those are for small fingered game players.If someone wants the availability to own their phone without contract and high monthly rates, enjoys traveling, would like a Phone, Wireless device, Camera, MP3 player and GPS all in one 8g package with the flexability to choose a plan that works best for them this is the phone for them.Trust me when I say, I've done my research and it was between a Blackberry and n95; and even the Blackberry doesn't have the funtionality of the top Nokia N-series device."}, {"rating": "2", "user": "-", "raw-text": "Pros: Great phone, lots of features, gps is good, video and camera are great.Cons: Reception is so so, I've owned other Nokia's and reception were much better with them. Wifi works only if you are on top of the transmitter I get ten foot from my wireless at home and it loses the signal. Wifi was the main reason I bought this phone but phone is useless to me since the wifi doesn't work right.better wifi, faster GPS"}, {"rating": "2", "user": "-", "raw-text": "Pros: Great screen size, great color and screen resolution potential and great high quality camera also - which can take stand alone camera quality pictures.Cons: slow, crashes at least once a day - usually several times each day, cannot use multiple applications at the same time or prone to crashing or running slowly, symbion operating system has limitations and although it is generally smoother than a windows operating system it is far less flexible in my opinion.I had this phone for about two weeks before i returned it because i was so dissatisfied with its overall reliability and performance. what it boasts is incredible - but my particular model, AND a..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Not a difficult phone if you ever owned more than one Nokia. The music sounds out of this world and yet features are simple. When playing music at high volume you forget that this is a cell phone and so battery does die very quickly at no fault of Nokia but rather the listener because it sounds so great. Pictures are great and clear and the flash works excellent. Connecting to the web is so easy especially using WLAN. There is so much more that i am discovering but as you can see it is not a cheap cell phone.Cons: My first smart phone, cannot compare to others out there. The ear piece volume is somewhat low, but then again it's a cell phone...."}, {"rating": "2", "user": "-", "raw-text": "Well what can I say. This phone has everything but the kitchen sink. I paired it with a Moto S9 stereo bluetooth and my cars bluetooth, popped in a SanDisk 4GB micro SD card and it is awesome!! Pros: Everything is top notch on this phone. Wifi 3G Camera Video MP3 Matter of fact I teach martial arts and use the video function to video tape my students doing their forms. I then show them the parts of their forms that needs work. Amazing when you can see what you are actually doing wrong instead of just being told what you are doing wrong. Cons: Very minor stuff, the browser is not to my liking so I loaded up Opera Mini. The GPS is a little slow. I suggest buying the voice for it cause I almost rear ended a car once. Taking pictures at night can be challenging in low light situations. So I have finally gotten an all in one phone that is probably gonna last me a year or 2. Or until Nokia comes out with something better."}, {"rating": "2", "user": "-", "raw-text": "Pros: full resources, great battery life, accessories available, lots of softwareCons: no touchscreenthis is a very gorgeous smartphone. the best to date.you can creat and edit word texts, surf the net like a pro, make and view photos and videos, listen to good radio stuff, go skype and whatever you want. and as a bonus try the gps, a cool stuff with nokia or google maps."}, {"rating": "2", "user": "-", "raw-text": "Pros: I now carry less gadgets in my purse as this can do the same as my digital camera, PDA and MP3.Cons: The service I get from 3... my software has gone kuput and I've only had it since August. Very disapointing considering the cost!A great improvement on my previous LG phone. Camera is awesome and takes better pix than my Canon digital camera. Huge memory. The web, when it worked was great to use on the go. A bit disapointed..."}, {"rating": "2", "user": "-", "raw-text": "Prior to owning the n95 I was an avid iphone user, but after over a year of fat fingering the touch screen I wanted a phone with real buttons. The N95 is just about perfect.Pros:- Bright screen viewable in all environments- Call clarity is great- Super easy initial setup for ATT- Built in browser is good for everything I've tried- Wi-fi is fun when available- Camera picture quality is outstanding for a phone- Great battery life (so far)- Slider function still feels solid after much use"}, {"rating": "2", "user": "-", "raw-text": "Pros: great camera features and also great mp3 player/ sound. Great memory for storage and large screen, easy to use phoneCons: poor battery life, always freezes, breaks if dropped straight away,a great phone now that its alot cheaper, it has a fabulous camera on it and also a good mp3player, the memory is fantastic also. ..."}, {"rating": "2", "user": "-", "raw-text": "I really love this phone. I think most of the previous reviews have covered the PROs and CONs pretty well. I just want to say what a great media phone this is. Seamlessly transitions between phone and MP3 player with great sound. It's very easy to use all of the functions... well the camera load time could be faster. I've been pretty impressed with this Phone."}, {"rating": "2", "user": "-", "raw-text": "Pros: I actually found the camera to be very good. Still shots came out better than i thought they would. All the other features were pretty good so i'd say one of Nokia's best.Cons: Maybe the video is a bit slow. I think we should have been made aware that the navigator was an additional service that we he to buy a licence for it.Pretty good phone, maybe if it were $900 it would have been a bit better but i'd still say its good value. ..."}, {"rating": "2", "user": "-", "raw-text": "Pros: ease of use, good layout, fast internet, quality pics.Cons: Dreadful battery life, after 12 months of charging at least once a day, I was told by Vodephone that a frmware upgrade was available, after installing this and replacing the battery I am getting 2 to 3 days between rechargesI like the phone, sometimes the system is slow, pics are good, but operation of the camera is a pain, use of MP3 drains even the new battery, I am pleasantly supprised with the build quality, as I..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Many features, Nokia's easy to use and understand interfaceCons: breakdown a lotSadly my N95 has been back for repairs twice, and is no out of warranty and sitting in my drawer \u0091dead\u0092. When it was working it was great, with great camera / video and the typical easy to use Nokia..."}, {"rating": "2", "user": "-", "raw-text": "Pros: 8GB of memory, 3.5mm earphone port, high quality photosCons: Fragile, easily brokenI had this phone for a total of 3 months before i had problem with it switching off by itself until one day it did not come back on. I liked that it had so much memory for movies or songs and the..."}, {"rating": "2", "user": "-", "raw-text": "Pros: lots of memory space for songs and applications.Cons: Not a very high quality mobile phone.the N95 is pretty simple to use and has a lot of memory space. but i found the phone too be not very durable. i only had my N95 for about four months when it started to switch on and off by itself! I..."}, {"rating": "2", "user": "-", "raw-text": "Well after having motos and testing sony' I must say that nokia is great! sp this one. The signal is the best i've ever had! and the gps (i've installed garmin) is really really great. for those who likes being the center of attention buy an ipod. Compare N95 with this last one, is like comparing a pc with a tv. if you prefer ipod, thats because your eyes are bigger than your mind. Really ipod is great, but they are two diferents things. PROS: Nokia N95 is an all in one. With exelent quality, the camera, the viedeo camera, the gps, the viedeo & audio player and the OS symbian who lets you add or use your own aplications (if you don´t like the player or the broser you can use anyone you like, or the gps, like me that i'm using garmin instead). The batery life in this version is great! realy great, and if you run out of it it brings you a car charger all included with the phone package, also bring earphones, traveler charger, a/v cables (yeah you can conect it to the tv, and with a divx player i've seen severals movies) and a microsd memory. CONS: well i must say that if you own this phone you should have a special care with it, because if it falls one it will have two scratches! It feels realy good wen you touch it, but the materials are very żweek? The thing with the iphone is that the touchscreen it makes navigating the phone much more easy, and the screen is larger (2 points to the iphone! That's aphone!)"}, {"rating": "2", "user": "-", "raw-text": "The N95 is possibly the most amazing phone ever made. Yes this is quite a statement, and the n95 8gb does have a larger screen and a functioning accelerometer, but despite those 2 small short comings this phone is amazing. I have owned this phone for the past month and a half, prior to this I had owned the treo 650,& 750 and the moto v3xx, all were and absolute joke in comparisson. I have since purchased and n81, n82, and and 8800 s40. I can say without a doubt that there is no better functioning phone loaded down with freeware s60 software. The functionality especially since the release of the n78 in which the firmware release was finally posted to . Since they have released another 5 or 6 apps that are fantastic. I have read alot on the battery life and running 3g all day along with truphone,wifi, and a ton of other apps in the background, I still get a full 12 hours. So if you don't have one and are considering getting one, go for it, this will change the way you look at cell phones, it will make carrying ipods, laptops, and cameras a thing of the past. Also it is like a new way of life with a ton of s60 blogs and sites on the web with a ton of freeware this will become a new extension of your body!!!!! This phone actually excited me enough to start working in the cell industry, I have become a top salesman in a month and I am pumped to have such a great tool to help me out. With Truphone which embeds directly into the phone calling overseas is free if not less than a cent a minute."}, {"rating": "2", "user": "-", "raw-text": "Having started with the N82 then the N95-3 (which got better with the recent FW upgrade) I now have the N95-4. I hesitated because of the limited internal memory vs the open SD card on the N95-3 HOWEVER I never filled up the 4GB SD card on the N95-3 Now for the differences, The screen is bigger but not noticeably larger as the resolution is the same thus larger pixels creating a \"brighter\" screen. Nice but not worth upgrading for. Phone is black..Ho Hum I don't view phones as fashion statements so this means nothing to me. The glass is more flush with the case though not allowing the grit to get in the seams. Again,,no big deal. The GUI carousel is different. I like both equally well, Now for the reason the N95-4 is better,,, SPEE D.....The OS is much faster. The camera opens immediately rather then the 8 seconds on the N95-3 (pre FW) The OS is faster in many cases. That's the only reason I am keeping it and since the wife does not want the N95-3 (happy 6126 owner) I will most likely sell it. I highly recommend the N95-4. It is indeed a jack of all trades and MASTER at many of them unlike the iphone. The best $450 I spent on a phone."}, {"rating": "2", "user": "-", "raw-text": "Pros: Good screen size, picture qualityCons: Almost everything else. It keeps freezing, cant use the camera, video, or normal, cant use the phoneI hate my phone, i have had it since sept 07, it is being fixed for the second time, at the moment. I think that because it it too much of a computer, it keeps crashing. I bought it, for the good..."}, {"rating": "2", "user": "-", "raw-text": "I was pretty disappointed in the N96 before, so I decided to give this one a go. First of all Nokia has added a few enhancements. A bigger 2.8\" display, as well as a better battery, which lasts about 2 hours longer than the other. Other than that its has the same design, the phone runs alittle more smoothly thanks to Nokia doubling the RAM. But still it lags after a while. I also felt battery life was still on the short side, and because the US 3G networks aren't as \"mature\" as it's Asian and European counterparts, I never really had good 3G coverage. So all in all I'd say that Nokia has addressed some of the issues with this iteration of the N95. So if your looking for a great multimedia device and your interested in the N95, I'd say go for the N95 8GB, or just wait for the N96, as it will have a faster processor, more RAM, and 16GB of storage, and does have a Micro SD slot if you so need."}, {"rating": "2", "user": "-", "raw-text": "Pros: Integrated GPS, Excellent Internet Browser, 5mp camera gives good quality shotsCons: Butons are smallOut of all the Nokia's I've owned, this is my favourite. It does everything I need it to do to get my day to day things done. I basically run my entire life out of this phone. The Calendar is simple..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Durable, Long Battery Life, Neat Features ... Cons: Flimsy I have the little brother of this phone..the E62. I am a CPA and little use of a camera as this phone lacks a camera. It took a little while to understand how to use this phone which uses the Symbian operating system. Sound quality is quite good and the email feature works well. Battery life is excellent. [...]"}, {"rating": "2", "user": "-", "raw-text": "This is by far the best phone I have had. Pro's: GPS works decent, pretty quick once you get it up and running. The First Phone I had to lower the volume by default. Locks on to my 3g signal better then any other phone, as well as excellent reception. Nokia loaded it up with ring-tones and some apps. Con's: OK its a little but not overtly bulky. But accepted this going into it. Yeah its expensive."}, {"rating": "2", "user": "-", "raw-text": "Pros: Display, buttons, slideing without FLAT cable, wi-fi, sound (very strong), came with car chargerCons: Price, short battery life (extremly short while using WI FI), often software freezes and bugs,The phone is generally good for communiation and SMS/MMS/POP3 mail. If you plan to use it with all options make sure that you have spare battery. With the price is mind, it is just too expensive. It..."}, {"rating": "2", "user": "-", "raw-text": "Yes it's true... I sold my iPhone and bought a N95. It does it all. It sounds better it looks almost as good, and it has everything that a phone would need to b considered serious. I am an avid Apple Product Supporter but I service them for a living. Maybe a few versions later i could go back, but not now. Nokia has developed probably the best multimedia phone on the market. The camera is amazing, the sound is amazing, and it syncs to my mac. This pleases me greatly. You have read the others pros and con so i will spare you. I love this phone and don't think i will regret getting rid of my iphone. BUY THIS Phone!!!!!!!!!"}, {"rating": "2", "user": "-", "raw-text": "Pros: it has a good quality camera on it, and it doubles as an MP3 player also... rally handy!!Cons: my first one was deasd on arrival, however the replacement phone works perfectly well!Once you get used to the menu funcions, you'll wonder how you ever managed with a basic phone. You can even change the order of menu items so the ones you use most often are readilly at hand. The..."}, {"rating": "2", "user": "-", "raw-text": "Pros: -5mpx camera-large bright screen-GPS-UI-Compatability-GPSCons: -Brought it into warranty twice for repairs and recieved replacement handset-I purchased their extended warranty and because I didn't register in time, I had to go through a lengthy process to get it activated.-GPS connection poor and slow"}, {"rating": "2", "user": "-", "raw-text": "The Nokia N95 is backed with so many features, it takes a day just to go through all of them and every time you find a new application, you can't help but shout COOL. Pros. Super nice screen. It is huge and sharp. Internet Browser is awesome but sometimes while loading a website, it will close the browser and go to the main menu. Pretty nice MP3 player Nice camera. Takes beautiful pictures. GPS is nice. nice if you are in a new part of town and want to see what is around you but the maps are very slow to download. Cons. Nothing really. I wish T-Mobile had a stronger network to take full advantage of this phone. The included leather case sucks."}, {"rating": "2", "user": "-", "raw-text": "Pros: Lots of features, unique design.Cons: has a mind of its own on occasions, slow.like most other N95 users, I was swayed by the adverts on TV and other media about the N95. Consequently I rushed out and got 4 on my business account.for 2 months all was good, then one night I..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Features are amazing and it's easy to use.Cons: short battery life, but it depends on how you use it really.I've had it for almost a year now, and I haven't had any problems with it. it works great, you can use one hand to operate it and it's so easy. It has everything you would want in a cellphone. Batterylife, well, I only make calls when necessary or if it's really impt. bec it consumes your battery more than if you will send text msgs.instead. I highly recommend it."}, {"rating": "2", "user": "-", "raw-text": "I received the phone on Tuesday, and I have to say I am impressed. This phone is made in Finland, and it is impressive in its build quality. I have no problems with construction. I am switching from a N73. The N95 has a much better keyboard, it is much easier to find keys without looking. The processor is also much faster with a limited delay at getting to menus, where with the N73 there was a delay on first entry to menus. GPS works well, it did not take too long to find satellites, and once found it worked well. It was very slow to download the maps from Nokia. Wi-Fi is very easy to work with, it is much better than the N80. Battery. Not bad. I must not be a heavy user because I charged in on Tuesday and recharged it today for the first time and it had two bars left. But that was with limited GPS and Wi-Fi, just GRPS and phone calls. Overall I am impressed. Cheers, Hutch"}, {"rating": "2", "user": "-", "raw-text": "Pros: I find this cellphone very benificial to me in a way that, whenever I am at home, and I am lazy to go out , to surf the net, I make use of this phone as my internet.Cons: The only thing that I can say with this is taht the price of teh cellphone is quite big or expensive.I can say that N95 is one othe hottest cellphone produce by Nokia. I actually have the cellphone now. it has a great features. All the features that you are looking fora cellphone can already be..."}, {"rating": "2", "user": "Penny", "raw-text": "The only thing left out of this device is a touch screen. It only comes with 160 mb memory card and they say you can use up to 2 gb, but if you buy the 8 gb micro-card now on sale at Buy.com it will use it just fine. This device works great however you use it. The only thing I find a little on the weak side is the operation manual which is more of a quick reference guide. You will find out lot more information on the many uses from the forum. I am giving this device all fives because it is not just a phone, it is a FM radio, has two built in cameras, a video recorder with stereo sound, mp3 player, MS outlook style Contact book with person picture, appointment calendar, MS office programs, game machine, and the list goes on and on even to a quot;Walk-O-Distance Meter quot;. By using Nav4All GPS software the GPS is FREE until 2010 which includes turn by turn voice directions and more. This only touches the surface of this device use. If you just want a phone then this is not for you but if you want a great phone and a professional camera then just these two things out of all the rest makes it a real bargain."}, {"rating": "2", "user": "-", "raw-text": "I bought this smart phone about 4 months ago. I love this device. Everything about it. The camera results are mind blowing both for pictures and videos. Great reception, features, enough space for all your music needs, and with the memory card slot underneath the battery, I can add more if I want :) If you are interested in this product, I say go ahead. You will be pleased that you did :D Good luck."}, {"rating": "2", "user": "-", "raw-text": "Pros: Is like a small PC in many ways, so much better than older mobiles.Cons: A bit expensive.I got my Nokia N95 just over a yea ago. I have had no problems with it and love that it has so many features. Being able to wirelessly link to all the networks I use is awesome because I can use..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Screen, GPS programsCons: Not always the best shots from the cameraWell, I like this phone, but I'd rather have an iPhone. I like the N95, like the video out and everything that came with mine right out of the box, but as good as it is, the touch screen on the iPhone is years ahead of anything else.Also, for the guy that says you can't save a photo on the iPhone while surfing, hold your finger on that picture and it will ask you if you want to save to your photo album. Just a little FYI...FC"}, {"rating": "2", "user": "-", "raw-text": "Pros: Durable, Easy Buttons and Controls, Lightweight, Long Battery Life, Neat Features, Strong Signal don't listen to them to be prepared for trouble emailing etc. I specifically got this phone because i did not want a qwerty. I'm very adept at T9 and i can use this phone like a champ. I love this device. I have an external battery charger and a second battery. i use the battery till it is dead, swap out the battery and plug in the other one. I generally get 3 days of use out of the phone if i do not use the other features too much. if i had to complain, the GPS takes forever to synch up....but hey, i use my garmin."}, {"rating": "2", "user": "-", "raw-text": "so im kind-of a cell phone freak (working on my 20th or more phone) and after i saw this one and it came down in price i snagged one at $440 on ebay new. it was the n95-3. lets just say i was blown away at first but it kinda diminished as the weeks went on. pros: -can do anything -great signal (work deep in a office building and the only place i cant get reception is the bathroom.... who needs it there anyways) -great call quality -great camera -great setup and operating system -brilliant screen -battery life was pretty good for me considering i used the mp3 function pretty regularly at work -headphone jack is a must -sdhc up to 8gb was perfect stereo sound was amazing, best i have ever heard on a phone -free gps -wifi -the unlimited add on's now for the cons. -gps - would freeze up and reset the phone if used for too long -signal- switching from edge to 3g would reset the phone or would lose signal for a long time... which is a big problem for me (and i know you can turn 3g off but whats the point of buying a phone that has that capability if you have to turn it off to get it to function correctly) -mp3 - songs would skip sometimes or wouldnt play and it couldnt be the files because they worked on everything else (old blackberry, ipod, computer) -screen - the other day it started having black lines go through it but they come and go but it extremely annoying (one of the reasons im getting rid of the phone) -back scratches too easily due to the soft touch paint -the screen"}, {"rating": "2", "user": "-", "raw-text": "I love this phone. It arrived on time. Very easy to use as you get the hang of it. The features are great. I used the camera to take over 80 pictures so far and all pictures came out really nice and sharp. I have not used the GPS yet but I got a lot of compliments from younger generation. they all carry i phones and they told me my phone is way cooler then their i phone. It slides really nice n smooth and the media player is great. Easy to access the Internet though I don't use it as much yet but will be when i am travelling. I recommend this phone to everyone who is on the go. Great for everything, at least I know now that I won't have to carry my camera around. ..."}, {"rating": "2", "user": "-", "raw-text": "Pros: It has so many features which makes the phone worth it.It`s really a must have gadget.Cons: Unfortunately I had to send the phone back. The video capture pause itself during video capture, but I hope they gonna fix that.I really love that phone.Go and get it!!"}, {"rating": "2", "user": "-", "raw-text": "Pros: great camera, and slide actionCons: none so fari love this phone, had it a while now it has a great camera takes some amazing pics, i love the slide action never had a problem with it. has great battery life and is awesome that i can change the..."}, {"rating": "2", "user": "-", "raw-text": "Pros: CAMERA, MEDIA PLAYER, WEB BROWSERCons: A BIT CONFUSING NAVAGATING THROUGH THE PHONE.OVERALL IM MORE THAT PLEASED WITH THIS PHONE. IM NOT A CELL PHONE EXPERT BUT I DO KNOW SOME THINGS. I'VE GOT NOTHING BUT COMPLIMENTS ON THE PHONE, AND I GOT IT AT A GREAT PRICE =). OVERALL ITS WORTH ITS WEIGHT IN GOLD CAN DO JUST ABOUT ANYTHING, AND IS WAYYYYY BETTER THAN THE IPHONE. YES ITS AN INVESTMENT BUT TRUST ME ITS WORTH EVERY PENNY!!!!!!!!"}, {"rating": "2", "user": "16,", "raw-text": "This is a rare color in the 95 serious. I am happy with the one I get except the size is a little large for a woman but is a strong and hitech phone can do everything you command...."}, {"rating": "2", "user": "-", "raw-text": "Pros: Great screen size, 5 Megapixel camera, Has everything you need and moreCons: I dont know how to use this phone to its full potential, battery life seems to be a little shortI've had this phone now for approx 6months i think and I havent had any problems with it so far. The camera on this phone is just fantastic and out does my digital camera easy. The web works a hell..."}, {"rating": "2", "user": "trench", "raw-text": "the case covers up the numbers so it makes it a little hard to find exactly were they are. no screen cover, but it wont break like the other hard cases. its good to have if your hard case breaks, and you have to wait a while to get another one"}, {"rating": "2", "user": "-", "raw-text": "I'm in the same boat as most of the posters above, but I wanted to add a few comments GPS - the newest (Oct 15?) version of Google Maps is a great addition. The supplied Nokia maps is great, but often it would take a while (2 mins or more) to get my GPS location. The new Google Maps app 1.) updates you on your connection status (the Nokia Maps just shows a 'connecting' icon) 2.) Puts your location on the map quickly and then narrows down the margin of error Camera - I haven't quite figured this out yet, but the file sizes for the camera even at the highest settings are pretty small. I have a 4 MP Pentax Optio that takes much better pictures than this 5MP camera. Having said that, the camera does blow the phone-camera competition out of the water. Just don't expect to be taking pics that are comparable to a stand-alone 5MP camera."}, {"rating": "2", "user": "-", "raw-text": "Pros: good point is you can use miro SD cards in the phone and the camera comes in handyCons: battery life is really bad after having this phone for 22 months the only way it will last more than 1 day is not to use it. Then the battery will last a lot longer. Having to pay for voice nav to use GPS. crashingWhen this phone came out you could use the GPS for tracking you with no need to pay for voice nav. After some updates nokia removed the free tracking meaning if you wanted to use the GPS you had to..."}, {"rating": "2", "user": "-", "raw-text": "Pros: noneCons: the baterry doesnt last long, you have to be extra careful with the screen or it looks like it will break easy, the sliding system keeps sliding up and down and activating the phonethis phone is a gadget phone. just a trendy looking photo studio. for work this phone is useless. it will slide up and down in your pocket activating internet not to mention that it seems so week and..."}, {"rating": "2", "user": "-", "raw-text": "Pros: takes good photos \"big deal\"Cons: the screen has no protection, the battery would be lucky to last 2 full days with minimal use, the sliding action keeps sliding up and down in your pocket. reception is poor even in main cities. expensive purchasewhat a piece of junk. i bought my n95 3 months ago and have already replaced the screen twice and believe me when i say \"after replacing the first screen i was extra extra careful the second time\". i..."}, {"rating": "2", "user": "-", "raw-text": "I am not going into great detail, because most of the stuff has previously been mentioned. I can say, as an owner of 2 Symbian phones (6620 and 6682) then 2 Sony Ericsson phones (W810 and K790a) that it is good to be back to Symbian. I sorely missed Profimail and IM+ for Symbian. The GPS, for me currently, is a neat feature as I rarely travel places I dont know where I am going, but I can see it being very useful one day. The Wi-Fi, on the other hand, is phenominal and I use it every day on my home network. Camera is great, but...in certain situations that provide trees in the distance that end up showing on the outer edges of the photo, well those trees can look a little washed out. My K790a takes slightly better pictures of scenery stuff but the N95, IMO, has a better macro mode. Overall, love the phone and dont regret spending what I did on it. Oh, purchased it from Dell.com if anyone would like to check it out."}, {"rating": "2", "user": "-", "raw-text": "Owned this thing for a week-in a nutshell it's a keeper as it does a lot of things well enough. Major functions for me besides the obvious of being a phone: -Camera: Excellent -Maps with built in GPS: Adequate -VOIP: Very good on a WLAN -Internet access: Very good-utilizes EGPRS well and the S60 browser is excellent The phone function is as good as most. My SE W810i had just as good reception so nothing real special with the N95 here other than it picks up a strong signal, speaker phone is excellent, but my bluetooth is a little on the low volume side-I find myself pushing it into my ear sometimes if there is surrounding noise. Pros: -Versatile -Great Camera -Wifi is useful (especially since no 3G stateside for this model)for fast internet and especially VOIP (Gizmo, fring, iskoot, etc) -Built in free maps and GPS -Browser is good Cons: -A little sluggish-but the new firmware should help that if it would come to the USA released phones -GPS slow to lock but good once it does -3G is on European frequency -Minimal support stateside -On the expensive side Nokia needs to support this phone and other unbranded unlocked devices in the USA big time, in response to the carriers (especially Cingular) obsession with their need to brand and cripple the manufacturer phones. The carriers need to figure a way to get the contracts they want and market their ringtones etc, without the use of their branded, locked phones. I, for one will never buy another branded, locked phone. Cingular or"}, {"rating": "2", "user": "-", "raw-text": "Pros: large memory capacity, well placed keys, easy to navigate menuCons: keys get warn out easyOverall i think its a great phone, with the ability to connect to the internet and receive emails like a blackberry but with out the additional features, so its ideal for those wanting a little extra..."}, {"rating": "2", "user": "-", "raw-text": "Pros: It has everything u need in a phone. looks sexy with its sliver finish. GPS, WiFi, 3G and 3.5G Also more applactions can be downloaded and add on the phoneCons: The battary. Have to change it at least every second night. Its also slugishI got this phone a few months ago as an upgrade from a Nokia N70. Takes time to get used to all the stuff thats on it, so if ur not tech minded this is not the phone for u. Also the phone needed a..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Loads of applications available, great audio and video playback, volume is LOUD, 5MP camera, 8GB built-in memory, Adobe Acrobat reader, easy to use interface, 3G enabled with compatible service provider, GPS.Cons: Battery Life pretty much goes down the drain when using wi-fi.This is a great phone for anyone looking for a smartphone with a Symbian OS. Would of been nice of Nokia to include a carrying case."}, {"rating": "2", "user": "-", "raw-text": "Pros: DOES EVERYTHING A PHONE SHOULD REALLY BE DOING IN 2008!Cons: NO TOUCH SCREEN, BUT EVERYTHING ELSE MAKES UP FOR ITIV'E HAD THIS PHONE FOR THE PAST MONTH AND A HALF, AND ITS THE BEST PHONE ON THE MARKET PRESENTLY.....THERE IS NO OTHER 3G NORTH AMERICAN COMPATIBLE SMARTPHONE ON THE MARKET THAT HAS NEARLY AS MANY FUNCTIONS AS THIS PHONE... YES AT&T IS THE ONLY 3G NETWORK OUT SO FAR, AND IV'E BEEN ABLE TO GET UP TO 3.5G SIGNAL ON THIS PHONE.....5 MP CARL ZEISS WITH FLASHHUGE RAM!!!, CAN RUN UP TO 10 DIFF PROGRAMS WITHOUT LAG8 GB INTERNAL FLASH MEMHUGE 2.8 INCH SCREEN3G SIGNAL WITH FRONT CAMERA AND VIDEO CALLIN CAPABILITY, PUSH TO TALK CAPABILITYTALK, SURF AND TEXT ALL AT THE SAME TIME WITHOUT ENDING THE CALL"}, {"rating": "2", "user": "-", "raw-text": "I'm always being made fun of by my friends and family that I have a new phone every month, and while it's more like every 3 months that I have a new phone, this one is it. N95-3 US NA Edition. Although I've barely had it two weeks, there is nothing better out there right now so I can't really get a new phone with more features. I'm going to say I have this one for a long time. Pros: +Screen +mobile internet is great on this thing +robust music player +reception +keypad +camera +tv-output +fast +rss feeds +emTube application (youtube) +GPS Cons: -build quality may be an issue in the long term -music quality has some background hiss even with high quality encoded mp3's -additional cost for voice guidance for GPS -no camera lens cover (-3 edition)"}, {"rating": "2", "user": "-", "raw-text": "I ordered this phone online paid to have it 2nd-day mailed to me. After not hearing anything from customer service receiving no emails after 2 days had passed I called. They told me its 2 days after the order is processed. Well, OK I thought... not knowing that it would take them about 2 WEEKS to finalize my order. I bet I called customer service at least 10 times, always ending in frustration I had to explain everything everytime I called. It was ridiculous. I don t think anyone speaks English at Buy.com. I would definitely recommend this PRODUCT. However, I will NEVER order anything from Buy.com again."}, {"rating": "2", "user": "-", "raw-text": "Pros: The Brand - The Camera - Features - Solid Build - Battery Life - Current -Cons: Slow/delay - Memory - Battery Lid - Location of Settings - Speaker PhoneI have tried many mobile phone brands and since going back to Nokia will be unlikely to leave. I find Nokias generally easy to navigate, harder wearing and basically less annoying. I have had this..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Camera, AudiosetCons: Gps, a bit slow to lockThis is everything a phone should be. Nokia's pairing with Symbian on the OS comes out really nice as always, and FP1 is great. Much quicker operating time than the old S60 3rd, GPS is great to have,..."}, {"rating": "2", "user": "-", "raw-text": "Believe it or not i actually still own this phone, and although its a couple of years old now it's \"technology wise\", not that much out of date. It is a pretty solid phone and still works perfectly all thought one of our dogs has had its teeth around it :P but recently i have been look for apps and stuff that go on the n95 and have come across some weird information about the phone, apparently it has an accelerometer built inside(like the iphone- so it knows which way is up) and Nokia kept this piece of information hidden and made it useless anyway because you have to kind of \"hack\" the phone to make use of it, and this is to complicated for me anyway and probably most normal phone users. This is a bit of a let down anyway that's why I rate this as only 3/5 because I cant really use the n95 to its full potential. :("}, {"rating": "2", "user": "-", "raw-text": "Pros: Easy to use, very reliable, good battery life (depending on how you use it)Cons: It not great to browse the internet with, I've only used it a few times to search for store locations online, most of the time it runs out of memory and refuses to complete the search.My partner and I bought one of these phones each when they first came out towards the end of 2007. Mine has lasted pretty well - I've dropped it a few times, and use it a lot for work calls, and the..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Easy Buttons and Controls; Strong Signal; Durable; Neat FeaturesCons: Freezes Up; Poor Battery LifeThis product was great but battery life is weak.Alsothis product have many features that are not easy to find.The only thing this product freezes and do not have touch screen."}, {"rating": "2", "user": "-", "raw-text": "Pros: photo quality is topsCons: where do i begini have owned a few nokias in the past mostly the cheapest phones, but this time i thought i would splash out and what a mistake. ive had this phone for about 4 months and its been repaired twice, the..."}, {"rating": "2", "user": "-", "raw-text": "Positives: 1. Great suction cup. Won t fall off the windshield. 2. Fits any phone up to 4.5 quot; as mentioned in the spec. Even fits Magellan GPS 3250. I am using it with blackberry curve 8310 Cons: 1. Phone holding unit has hardly any grip. That is the basic requirement it needs to meet. Phone will come out of it pretty easily. I had to set it at 135 (90 + 45) degree angle to the dash so that the phone doesn t fall forward at the time of suddent brake / acceleration. Needed to buy another for 2nd car. Won t buy another, though I am still using the one I have."}, {"rating": "2", "user": "-", "raw-text": "Most greatest phone ever. Nokia kick everyone else's back with it. Pros, all of it. Cons, battery life is to short if you use a lot of applications at the same time. I live in Costa Rica, and the phone works great. Too bad the official nokia store here is the worst of all."}, {"rating": "2", "user": "-", "raw-text": "Best phone i've had...(and that includes the iphone)... i've had the N95 8GB had for about a year....everything is great... only bummer is that its not Touch... Cant wait for the N97 to come out this year though...;) its going to be the best phone ever made people."}, {"rating": "2", "user": "-", "raw-text": "first one i bought had a flimsy slide i thought so i went and exchanged for another one only to find another flimsy clicking rachteting slide on this phone. second one i got in replacement had a very annoying hissing sound in the speaker so i couldn't use this phone just wanna dump it altogether now. for a $900 phone that has a flimsy slide that clicks which is annoying and a $900 that hisses in the handset i can't believe i spent this money for a phone and it has problems like these."}, {"rating": "2", "user": "-", "raw-text": "I placed an order, and the product I received was defective. Overstock sent me a replacement item, only charged me shipping, and let me keep the defective item! I call that excellent service-the replacement item works just fine."}, {"rating": "2", "user": "-", "raw-text": "Pros: THIS PHONE IS THE BEST IN FEATURES - VIDEO, MUSIC, CONTACTS INPUT - EXCELLENT BECAUSE WHEN PHONE RINGS IT CAN BE PROGRAMMED TO SAY CALLER'S NAMEGOOD GPSWICKEDEST CAMERA ON THE PLANET RIGHTNOKIA ABSOLUTELY OUTDID THEM SELF THIS TIMEif you purchase this phone you will have no regretsCons: SETTING UP AND SENDING EMAILbattery life is limited especially when you are palying the music or real playerMAGNIFICENT AND MARVELOUS PHONE. PHONE OF THE 21ST CENTURY"}, {"rating": "2", "user": "-", "raw-text": "The n95-3 sold here now will take a 8GB SDHC chip. They only tell you it ll take 4GB. This Phone is fast. It may not have the neat looking apperance and it doesn t use the touch screen.Once your past that your on your way to a great phone experiance . It may need a little getting use to if your not a die hard Nokia fan. ATT people love it more than I phone too ."}, {"rating": "2", "user": "-", "raw-text": "Pros: Best phone camera yet, Easy Buttons and Controls, Excellent graphics, Lightweight, Neat Features, Strong Signal ... Cons: Qwerty keyboard missing Small size,great graphics,strong signal reception;"}, {"rating": "2", "user": "-", "raw-text": "Pros: has everything you needCons: battery lifeThis is the best phone ive ever owned, i use to upgrade every 6 months to the latest and greatest, but once i got the n95 ive theres no need.... I didnt even think much of the n95 8gig upgrade, no..."}, {"rating": "2", "user": "-", "raw-text": "Pros: looks good - does what its meant to do - good camera - loud ring tonesCons: its all good LOLBought this phone from work on a cheap contract - got the N95 Next G for Telstra coverage as I often go away and like being able to stay in contact (should I need it). Only downside with the phone I..."}, {"rating": "2", "user": "-", "raw-text": "I love this phone. Coming from an N75 it is light years ahead. Pros: Huge screen Great camera Super reception Fast program start-up Good sound quality from speakers Small size Fast data processing, even on EDGE, when using programs such as Opera Mini Con: Slight slider wobble (fixed with the tape trick) I can highly recommend this phone!"}, {"rating": "2", "user": "-", "raw-text": "If your a phone lover, and don't already own this phone, buy it! I've had the n95-3 about a month. Hands down the best phone I've ever used. This puts the iPhone to shame. Pros: Great screen Fast OS Great reception (3g) The 5mp camera is outstanding this phone is loaded with apps Very good sound Cons: Price no qwerty keyboard nice job nokia!!!"}, {"rating": "2", "user": "-", "raw-text": "Pros: lightwieght,2 cameras,photo quality,colour (mine is purple)Cons: gps? hard to work out? in saying that though my sister has had the same phone and its fine for her? maybe the carrier you choose? seems to be ok so far!its a great phone,fairly easy to use, lightweight, attractive looking,i find it easy to take photos as well as the large memory capacity,i havent had it fill up once!, easy to transfer things onto..."}, {"rating": "2", "user": "-", "raw-text": "Everything about this phone is awesome 5MP Camera Mp3 FM Radio And Gps Navigation With Voice also MP4 Video 30Frames Per Second What Phone Gives You That WiFi 3G Support And USA 1Year Warranty Works Great With Tmobile No Cons For Me I'm A Fan And I Have Tried Alot Of Phones This One Is Far The Best I Also Try The N93I From Nokia And Sony Ericsson K800i The N95 Tops This Phones By Far Not That This Are Not Great Phones But N95 Is Better get Yours Today."}, {"rating": "2", "user": "-", "raw-text": "So I decided on the Nokia N95-3 after using Sony Ericsson models exclusively since 2001. My SE S700i was on its last legs, but has served me well since Dec 2004. After reading many opinions, and reviews, I thought I would add my 2 cents after playing with the phone for about one week. Like many reviewers have said, this could perhaps be one of the best phones of the year, or perhaps, ever. Pros: - Camera: 5 MP pictures are great, lots of manual options, great in low light - Screen: Large and very bright - Connectivity: Bluetooth 2.0, infrared, HSDPA, EDGE, Wi-Fi are great - Speaker: Great stereo speakers for speaker phone, and MP3 use - Build: Very nice, solid and satisfying clicking when sliding screen, keys are good. Rubberized backing is great - OS: Symbian S60 is quite fast. Really easy to navigate, and multi-task multiple programs. Capable of downloading many S60 applications - Synchronization: Syncs easily with Outlook via bluetooth 2.0, infrared, or USB - GPS: Cold fix only takes about 40-60 seconds, normal like other GPS devices - Voice Dialing: Don't need to record your voice, it simply knows based on how it is named in your phone book - Stand by: Clock, date, and current profile was something that I missed on the S700i during the dimmed stand by screen Cons: - Alarm: Can't use the radio as an option for the alarm - Texting: I like SE's T9 more, where it's much easier to add in a comma or pick the correct predictive word from a mini list that pops out, rather than"}, {"rating": "2", "user": "-", "raw-text": "Hello,i will like know if you are ready to sell this item cos i really need this item, but mail me back with the detalis of your selling of this item so that i can go to make the arrangment of the payment..hope to here from you soon ..."}, {"rating": "2", "user": "-", "raw-text": "Pros: GPS FeatureHSDPAWi-FiBig screenCons: Poor photo qualitySlow-ishA little on the big sidePoor value for moneyAll up, it's the best, most feature packed Nokia ever made.  Nonetheless, it's like a movie that's really hyped up - once you see it, it's not as great as you expected it to be.  The fact..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Awesome still and video camera options make this handset more of a camera with a phone than a phone with a camera. Web browsing options are pretty nifty adn…"}, {"rating": "2", "user": "-", "raw-text": "Pros:Big screen Cons:Slow, chunky, ugly, features don't quite work I got the Nokia N95 a year ago (late 2008), after telling my phone provider that I was not going to renew the contract because I was going to get an iphone. I wanted to…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: GPS, Free Maps software, Wifi, Screen, Camera, Video Out, Internal Memory, Memory expansion, Video Capability, Office compatibility ...Bad Points: General Build quality, Battery life. Generally speaking…"}, {"rating": "2", "user": "-", "raw-text": "Pros: I love that the memory size allows me to have all my music, photos, even videos all in one device. The camera is fantastic, I never remember to carry a seperate camera so…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: - Huge high quality screen - 5mp camera - Built in GPS system - Nokia ...Bad Points: - Battery life not perfect - Phone speaker low grade (although stereo music speakers are superb) I have always had a…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: 3G inc HSCDPA/GPRS connectivity 2.6\" (6.6cm) Viewable TFT screen in portrait & landscape view ability 5MP Auto focus camera Built in GPS Video recording with MP4 30fps capture 3.5mm headphone jack In-built stereo speakers MP3, AAC, ACC+ playback FM visual radio WLAN B/G built…"}, {"rating": "2", "user": "-", "raw-text": "Pros:2.8\" QVGA display, 5 megapixel camera (Carl Zeiss optics),8GB-storage capacity,TV-out functionality Cons:No camera lens protector,Cannot edit office documents,No card…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Very easy to navigate the menus. Great camera and MP3 functions. Good reception on the phone calls. ... Cons: Flimsy battery cover. Sometimes slides open in my…"}, {"rating": "2", "user": "-", "raw-text": "Pros: I liked its support for Flash lite and wireless network which enable me to enjoy Facebook, Orkut, Google, VoIP, SIP Phone, Skype, etc without paying extra…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Multiple devices in one, small and light and slowly will become your essential must have. ...Bad Points: Probably not as good as dedicated device for each of…"}, {"rating": "2", "user": "-", "raw-text": "Pros: It is easy to use, the menu is well set out and it has an easy slide. ... Cons: It is bulky and the screen and sides crack easily when dropped, even in a…"}, {"rating": "2", "user": "-", "raw-text": "Pros:Features, style, wi-fi, 5mp camera, sat-nav, 8GB built in memory Cons:Battery life I got this phone a few days ago as a replacement for my old Nokia N80 that I'd had for nearly two years. People hated the N80, but I…"}, {"rating": "2", "user": "-", "raw-text": "Pros: The screen is huge, the camera is very good quality, has lots of extra features, good battery life and the music player is pretty loud. ... Cons: I had software problems with this phone from day…"}, {"rating": "2", "user": "-", "raw-text": "2 . The \"To-Do\" summary shows \"14 to-do notes not done\". Its a useless piece of info for me, what would be better is to show the high priority notes eg Call"}, {"rating": "2", "user": "-", "raw-text": "Pros: Good phone with lots of features. Solid, stylish, clear reception and good sound. ... Cons: Hard to find the clock and alarm. For awhile I was using the…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Great Camera, easy to use, good looks, decent sound, expandable memory, cool sliding design. ... Cons: Sliding screen can open in your pocket, program is…"}, {"rating": "2", "user": "-", "raw-text": "Pros: You can use normal headphones for this phone. ... Cons: Broke after 3 months of use. With this phone you can browse the internet, check e-mails, watch movies…"}, {"rating": "2", "user": "-", "raw-text": "Pros None submitted Cons None submitted This phone has all sorts of wonderful features already loaded onto it (Wi-Fi, GPS, VOIP, Office, Zip etc...), plus 8 gb of storage space!…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Durable, Long Battery Life Cons Bulky ...Good for: Texting, Photos, Web Browsing, Music, Video Had it for 2 years. Never had to do a repair.…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Durable, Easy to Use, Stylish, Good Quality, Good Sound, Perfect Image Quality Cons Bulky ...Good for: Photos, Web Browsing, Travel I…"}, {"rating": "2", "user": "-", "raw-text": "Pros: The large memory(8 GB), The double-way slider mechanism, The great looks, The amazing features, 5 MP Camera(wow!!!), Good music, Wi-Fi, GPS, Large screen,…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen Cons Short Battery Life, Bulky ...Good for: Texting, Photos, Web Browsing, Email, Travel Being a fan of Nokia products, this…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Great Phone, compact and easy to use. ... Cons: battery life seems to fade quickly. Great phone with easy to use applications, good slide and great music…"}, {"rating": "2", "user": "-", "raw-text": "Pros: The Brand - The Camera - Features - Solid Build - Battery Life - Current - ... Cons: Slow/delay - Memory - Battery Lid - Location of Settings - Speaker Phone…"}, {"rating": "2", "user": "-", "raw-text": "The Nokia N95 8GB mobile phone has been called the ultimate multimedia computer. To start with, it's a Symbian-powered smart phone. Slide the screen up and you'll…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: The Nokia N95 was provided free by good old Orange.co.uk on-line, and it arrived the next day. Wow! Didn't have to speak to a soul, just went to the Orange Shop on line, looked…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Great screen, Great camera, Internal GPS, universal networking, wifi, infra red and bluetooth. Good design. No annoying little things, like when some new phones don't have vibrate it has…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Screen Sound Looks. ...Bad Points: Slow Software Battery Life. The N95 is the best phone I have ever owned, the 5m camera is spot on and includes…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: This mobile has exceptional camera and quality screen. HSCDPA is supposed to be good but you need to pay to access stuff like internet and satnav.…"}, {"rating": "2", "user": "-", "raw-text": "I have now had my Nokia N95 for 15 months. All things considered I would definitely reccomend this mobile phone to other people. I find the best thing about this phone is…"}, {"rating": "2", "user": "-", "raw-text": "Pros Nice Screen Cons Bulky ...Good for: Texting, Photos, Web Browsing I bought the Nokia N95 because I loved Nokia phones at the time. Although the interface…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Is like a small PC in many ways, so much better than older mobiles. ... Cons: A bit expensive. I got my Nokia N95 just over a yea ago. I have had no problems with it…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen Cons None submitted ...Good for: Texting, Photos, Web Browsing Absolutely fantastic. The picture and Video quality is so great…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Zeiss camera lens, reasonable battery life. ... Cons: Slow, buggy and lacks user-friendliness I have owned at least 5 Nokia phones and this one is the…"}, {"rating": "2", "user": "Thompson", "raw-text": "Overall, the N95 is everything they claim, in a neat little package, the only reason it didn't make 10/10 is the battery life, which means a nightly charge is"}, {"rating": "2", "user": "-", "raw-text": "I've had this Nokia N95 phone now for 2 years. I've been looking for to change, but to this date, I cannot find anything close to its quality. I believe the handset was first released in the…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Easy to use menus, Large colour screen, Great camera and video playback. ...Bad Points: Fairly short battery life, but that's probably because I am always…"}, {"rating": "2", "user": "-", "raw-text": "Pros: It's lightweight and so easy to use. Huge memory and excellent photo / video clarity with the Carl Zeiss Lens. Music & Data capabilities are brilliant and I…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Long Battery Life, Stylish, Good Quality, WiFi support, Rich Features, GPS support, Quality Construction Cons Bulky ...Good for:…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Good camera, large screen. ... Cons: Clumsy menus and navigation compared to other phones. Phone is slow to respond to some requests. Unable to customise many…"}, {"rating": "2", "user": "-", "raw-text": "Pros None submitted Cons Bulky The Nokia N95 is a great phone. A solid design and alot of features plus a really big screen make it great. The only downside to…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Lightweight Cons None submitted ...Good for: Texting, Photos, Email, Travel It is a good product lanuched by nokia. It has all…"}, {"rating": "2", "user": "Halfon", "raw-text": "This is truly a remarkable phone. The old N95 was full of flaws and the battery life was ludicrously low. The N95 8gig is a fantastic piece of kit and does what…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Long Battery Life Cons Bulky ...Good for: Texting, Photos The Nokia N95 is the original smartphone that provides the user with a…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Great mp3/wma player, good camera, exceptional battery life. ... Cons: No longer in production, slow processor means it can slow down and sometimes freeze up (very rare).…"}, {"rating": "2", "user": "-", "raw-text": "It's a rock solid Nokia phone thats been reliable for me, anyway. It's got everything I need-calendar, converter, video, mp3 player-you name it, its got it."}, {"rating": "2", "user": "-", "raw-text": "Pros: Good Phone and features very handy and entertaining ... Cons: Few isues volume key stopped working just after 1 year. Then the flash lite went off so…"}, {"rating": "2", "user": "-", "raw-text": "Pros Nice Screen Cons Energy Inefficient, Short Battery Life, Poorly Built, Limited Memory, camera shutter speed very slow ...Good for: Texting, Photos, Web Browsing Music…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Feature set is impressive - mp3, headphone jack, good video, pictures ok ...Bad Points: Slow, unstable, keeps forgeting custom dictionary! my GPS didnt work. the…"}, {"rating": "2", "user": "-", "raw-text": "SLEEK LOOKING! Good reception! ... Weakness: The keypad is annoying. Hard to find a case that works well with this phone. The Nokia N95 8GB is a sharp looking phone…"}, {"rating": "2", "user": "-", "raw-text": "Pros: the N95 is the first Nokia phone to have a GPS facility and the WiFi access facility. The double sliding facility makes it easy to use - Slide it left for…"}, {"rating": "2", "user": "-", "raw-text": "Tons of features, Wifi, great camera, excellent battery life, very loud, clear screen. ... Weakness: GPS kind of lags. Phone is a little thick. This is a great…"}, {"rating": "2", "user": "-", "raw-text": "Absloutely love this phone. Had it for over 2 years and had the original N95 with a 4gb card. Ther sound quality is BETTER THAN AN iPhone! My friend has an iPhone and we plyed…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Easy to use, fast response, good quality sounds and camera. Loundspeaker is great. ... Cons: a bit chunky, dont like the dual slide feature and dont like…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: I liked this phone as it does so much, if you can get it to work... but back to that later. I love the multi screen position and yet again Nokia have made…"}, {"rating": "2", "user": "-", "raw-text": "Pros: 5 MP camera , up to 4 GB memory support. ... Cons: Nothing i can think of. Inside the N95 design are advanced features like Bluetooth wireless technology, a 5…"}, {"rating": "2", "user": "-", "raw-text": "The Nokia N95 is an absolutely jaw-dropping incredible device. It would be doing it a huge disservice to simply call it a mobile phone. What can you call a jewel of electronic wizardry which incorporates a 5 mega pixel camera,…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Has a 5 megapixel camera and good camera features. Has great ways to view your photos - slide shows, etc. Has very good and clear speakers. ... Cons: Battery life is…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Good points of Nokia N95 are 1. Camera quality very good. 2. Stylish looks according to the todays generation. 3. All in one phone ...Bad Points:…"}, {"rating": "2", "user": "-", "raw-text": "Pros None submitted Cons None submitted The Nokia N95 8G is great phone that produces best performance in terms of camera capture and camcorder recording, and…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Stylish Good storage for photos, videos and music ...Bad Points: Keeps crashing Unreliable for making and receiving calls. When I first got the phone, I…"}, {"rating": "2", "user": "-", "raw-text": "I've got a Nokia N95 and it does the job well, add some extra software and it becomes a mediaplayer. No full size keyboard camera seems poor quality and finds…"}, {"rating": "2", "user": "K", "raw-text": "Good Points: Looks, features, satnav, PDA. ...Bad Points: I don't see any. I bought my Nokia N95 just 5 days ago from Coventry City centre, after waiting desperately for…"}, {"rating": "2", "user": "-", "raw-text": "Pros: ease of use, good layout, fast internet, quality pics. ... Cons: Dreadful battery life, after 12 months of charging at least once a day, I was told by…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Takes decent photos and the call volume is loud. ... Cons: The slider mechanism has problems, only after about 3 months after purchasing it - it actually…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Lightweight, Durable, Long Battery Life Cons None submitted ...Good for: Texting, Photos, Web Browsing, Email, Travel, Gifts, Music,…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Many features, Nokia's easy to use and understand interface ... Cons: breakdown a lot Sadly my N95 has been back for repairs twice, and is no out of warranty and…"}, {"rating": "2", "user": "-", "raw-text": "Pros: I find this cellphone very benificial to me in a way that, whenever I am at home, and I am lazy to go out , to surf the net, I make use of this phone as…"}, {"rating": "2", "user": "Louise", "raw-text": "Not happy with the battery life, size of the phone is too big for me, it feels like a brick in your pocket in my opinion! The Nokia N95 doesn't survive a spin"}, {"rating": "2", "user": "-", "raw-text": "Pros: It's a really attractive phone and I love the numerous buttons on the front of it. The screen is really nice and large so I don't have to squint to read texts or…"}, {"rating": "2", "user": "-", "raw-text": "Pros: * Nokia reliability * great screen display * brilliant camera * robust.. I've dropped it at least a dozen times and it still works! ... Cons: * scratches easily (having said that i am tough on…"}, {"rating": "2", "user": "-", "raw-text": "Pros Durable, Long Battery Life Cons Bulky, Email setup difficult, GPS ...Good for: Texting, Photos I bought this mobile 1 year ago with the intension that I will…"}, {"rating": "2", "user": "-", "raw-text": "Pros: great camera, and slide action ... Cons: none so far i love this phone, had it a while now it has a great camera takes some amazing pics, i love the slide…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Great screen size, great color and screen resolution potential and great high quality camera also - which can take stand alone camera quality pictures. ...…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Good screen size, picture quality ... Cons: Almost everything else. It keeps freezing, cant use the camera, video, or normal, cant use the phone I hate my…"}, {"rating": "2", "user": "-", "raw-text": "Overall I would highly recommend this phone to anyone. It is a little pricey but well worth..."}, {"rating": "2", "user": "-", "raw-text": "Pros: Integrated GPS, Excellent Internet Browser, 5mp camera gives good quality shots ... Cons: Butons are small Out of all the Nokia's I've owned, this is my…"}, {"rating": "2", "user": "-", "raw-text": "The Nokia N95 is a great phone. Has a great camera, good internet. Only complaint is battery life. Would still recommend it. Just charge it every night."}, {"rating": "2", "user": "-", "raw-text": "Pros Same reliable nokia interface Cons Too chunky, camera is not good. I though t this phone was going to be sooo good when it got released! Finally Nokia had stepped it up…"}, {"rating": "2", "user": "-", "raw-text": "Pros: I now carry less gadgets in my purse as this can do the same as my digital camera, PDA and MP3. ... Cons: The service I get from 3... my software has gone kuput and…"}, {"rating": "2", "user": "-", "raw-text": "Have had the Nokia N95 for 18 months now. Its a great phone to have. The phone as such works brilliantly, the standby time is good and requires less charging. But this…"}, {"rating": "2", "user": "-", "raw-text": "Pros: great camera features and also great mp3 player/ sound. Great memory for storage and large screen, easy to use phone ... Cons: poor battery life, always…"}, {"rating": "2", "user": "-", "raw-text": "Pros:Rich of feature Cons:none Ever since the Nokia N95 original debuted gage in Sep 2006, it's been one of the most awaited and highly coveted cagey phones. In fact, Nokia didn't change mortal plans to transport the…"}, {"rating": "2", "user": "-", "raw-text": "Pros: takes good photos \"big deal\" ... Cons: the screen has no protection, the battery would be lucky to last 2 full days with minimal use, the sliding action keeps…"}, {"rating": "2", "user": "-", "raw-text": "I got the Nokia N95 8gb one as an upgrade from my service provider and overall I've been pretty pleased with it - aside from the odd positioning of the on/off…"}, {"rating": "2", "user": "-", "raw-text": "I've had 3 from vodafone all same probs freezing, switching off, I felt that vodafone were poor at sorting what appears to be a common problem with the handset"}, {"rating": "2", "user": "-", "raw-text": "Pros: -5mpx camera -large bright screen -GPS -UI -Compatability -GPS ... Cons: -Brought it into warranty twice for repairs and recieved replacement handset -I purchased…"}, {"rating": "2", "user": "-", "raw-text": "Pros: I actually found the camera to be very good. Still shots came out better than i thought they would. All the other features were pretty good so i'd say one of…"}, {"rating": "2", "user": "-", "raw-text": "Pros: good image quality and fast internet. gps is great and easy to use. ... Cons: poor battery life. sold this phone because of it! the nokia n95 is an…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Lots of features, unique design. ... Cons: has a mind of its own on occasions, slow. like most other N95 users, I was swayed by the adverts on TV and other media about the N95. Consequently I rushed out and…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Durable Cons None submitted ...Good for: Texting a very durable phone that will last alot of knocks. nokia have always made durable phones…"}, {"rating": "2", "user": "-", "raw-text": "Pros Nice Screen Cons Bulky ...Good for: Web Browsing The Nokia N95 isnt goo in my opinion due to the fact it is bulky and feels a bit cheap. It feels asthough…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: If you can afford this phone buy it now. You will not be disappointed! ...Bad Points: Case can feel a little plastic. Would have been nice to have a…"}, {"rating": "2", "user": "-", "raw-text": "Love the fact its so easy to use and navigate. Also the camera is the best I've used on any phone with amazing picture quality. Generally very happy with it and…"}, {"rating": "2", "user": "-", "raw-text": "But overall it's a very good phone, Nokia brand is excellent."}, {"rating": "2", "user": "-", "raw-text": "Nice stylish looking phone. Big screen. Perfect for texting. I just love it. It is the best phone I have ever owned and I have had quite a lot of mobile phones…"}, {"rating": "2", "user": "-", "raw-text": "Pros: lots of memory space for songs and applications. ... Cons: Not a very high quality mobile phone. the N95 is pretty simple to use and has a lot of memory…"}, {"rating": "2", "user": "-", "raw-text": "Overall i would say this is the best phone i have owned, i had a k850i before this and the camera was rubbish, my photographs were out of focus and grainy."}, {"rating": "2", "user": "-", "raw-text": "Pros: It has everything u need in a phone. looks sexy with its sliver finish. GPS, WiFi, 3G and 3.5G Also more applactions can be downloaded and add on the…"}, {"rating": "2", "user": "-", "raw-text": "Excellent camera and mp3 player, fantastic video recorder, crystal clear. i never need worry bout memory again. Excellent phone, best i've had so far!"}, {"rating": "2", "user": "-", "raw-text": "The Nokia N95 8gb is easy to use, cheap, loud, good video calls and also good camera clear as anything. Also the black is better looks awesome."}, {"rating": "2", "user": "-", "raw-text": "Pros: Feature rich5MP CameraCons: Buttons kinda finicky while typing. Outer cover feels really cheapMust Buy"}, {"rating": "2", "user": "-", "raw-text": "GPS + 5 Megapixel Camera + DVD Like Video Recording + Symbian OS + Large Screen + Dedicated Media Control + Stylish Looks + Generic USB Connectivity + Dedicated Camera…"}, {"rating": "2", "user": "-", "raw-text": "Overall a great product!"}, {"rating": "2", "user": "-", "raw-text": "large 2.8\" screen 5 MP camera lightweight (128g) solid feel keypad mini-USB jack video ... Weakness: slider wobble when closed slow software load time First…"}, {"rating": "2", "user": "-", "raw-text": "I upgraded to the Nokia N95 8GB from an N80 and was very pleased with the improved spec. Great connectivity, simple wizard connects to all WIFI types without fuss.…"}, {"rating": "2", "user": "-", "raw-text": "Just to help understand, I did have an O2 Orbit, touch screen and installed Co-Pilot live on it. Everything was perfect but I was due an upgrade and went for the Nokia…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Display, buttons, slideing without FLAT cable, wi-fi, sound (very strong), came with car charger ... Cons: Price, short battery life (extremly short while using WI…"}, {"rating": "2", "user": "-", "raw-text": "Pros: it has a good quality camera on it, and it doubles as an MP3 player also... rally handy!! ... Cons: my first one was deasd on arrival, however the replacement…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Excellent tools on phone, lots of useful programs. ...Bad Points: Poor battery life, first phone broke, second not much better. Loose fitting sliding…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Durable, Long Battery Life, Intuitive Cons None submitted ...Good for: Texting, Photos, Web Browsing, Email, Travel Holy mackeral! what an…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Good Quality camera, lots of features. ...Bad Points: What can you do with a cellphone with lots of features but without battery life? I made…"}, {"rating": "2", "user": "-", "raw-text": "Pros: GPS Feature HSDPA Wi-Fi Big screen ... Cons: Poor photo quality Slow-ish A little on the big side Poor value for money All up, it's the best, most feature packed Nokia ever made. Nonetheless, it's…"}, {"rating": "2", "user": "-", "raw-text": "Pros None submitted Cons None submitted It is bulky cell phone but Nokia N95 is really high quality. Simple set up, sound is big enough for wake me up every morning."}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Lightweight, Good Quality Cons None submitted ...Good for: Texting, Photos N95 is a good phone to use because of its kneat design, so it is…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Long Battery Life Cons Bulky ...Good for: Texting, Photos, Email Nokias N95 is a good phone for texting and keeping in…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Lightweight, Durable, Easy to Use, Stylish, Good Quality, Good Sound, Good Value, Simple Setup, GPS support, Compact, Quality Construction Cons Short Battery Life…"}, {"rating": "2", "user": "-", "raw-text": "Pros None submitted Cons None submitted Good mobile. Occassionally jams when you have the phoned switched to silent with vibration mode on and you have to turn…"}, {"rating": "2", "user": "-", "raw-text": "No, I didn't play any games.....when I took it back to the shop they suggested I didn't 1st charge the phone for 24 hrs and gave me a new battery. But hey same"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Easy to use, excellent internet ...Bad Points: Keypad can unlock without warning Very pleased with the N95 and would recommend to others. It's…"}, {"rating": "2", "user": "-", "raw-text": "Pros: has everything you need ... Cons: battery life This is the best phone ive ever owned, i use to upgrade every 6 months to the latest and greatest, but once i…"}, {"rating": "2", "user": "-", "raw-text": "I have had the Nokia N95 now for close to a year now and everything is still as impressive as the day that I bought it. The screen is amazingly resilient and all…"}, {"rating": "2", "user": "-", "raw-text": "As a victim of the mass advertising on Nokia N95 we rushed in and got 3 of them on our account. Within 5 weeks one phone's microphone died so nobody can hear the…"}, {"rating": "2", "user": "-", "raw-text": "Everything about the Nokia N95 is good, i don't have any problem with it bought it last September no problem with software or battery or anything else.…"}, {"rating": "2", "user": "-", "raw-text": "My Nokia N95 keeps freezing you have to remove the battery so as to start the phone again. Also it will turn itself off and boot back up again. There is a known…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Never breaks, looks sweet, 2 cameras ... Cons: large, clips break on battery cover This is an excellent phone for people that get mad and want to throw…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Great screen size, 5 Megapixel camera, Has everything you need and more ... Cons: I dont know how to use this phone to its full potential, battery life seems…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Camera, Audioset ... Cons: Gps, a bit slow to lock This is everything a phone should be. Nokia's pairing with Symbian on the OS comes out really nice as always, and FP1 is…"}, {"rating": "2", "user": "-", "raw-text": "Multifonction, Design, Resistant"}, {"rating": "2", "user": "-", "raw-text": "All in all, a good phone."}, {"rating": "2", "user": "-", "raw-text": "Being an Nokia user I purchased the Nokia N95 new unbranded and unlocked 6 months ago - what a disappointment. The phone works great as a standard phone, sms,…"}, {"rating": "2", "user": "-", "raw-text": "As far as cons the only one i can see is battery life. This phone does it all! Whatever you want done this will get it done."}, {"rating": "2", "user": "-", "raw-text": "Pros: Easy to use, very reliable, good battery life (depending on how you use it) ... Cons: It not great to browse the internet with, I've only used it a few times to…"}, {"rating": "2", "user": "Wooldridge", "raw-text": "Pros: Video quality, Photo quality, Sat Nav, 3G and playing live SKY SPORTS TV and other live stuff via the Networks...watch your mates faces drop! ....Cons: Battery life Yep, despite the mighty iphone hitting the streets the sleek…"}, {"rating": "2", "user": "-", "raw-text": "As you can guess from my above points, im not too happy with my Nokia N95. This phone (first impressions) was in fact very positive (to begin with). To put it short, it…"}, {"rating": "2", "user": "-", "raw-text": "not good at all had to send back three times because of software issues then had to get another phone as to many problems"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Looks great, plenty of features ...Bad Points: Very slow I found my Nokia N95 to be very very slow to do anything other than make a call. I can't even get it…"}, {"rating": "2", "user": "-", "raw-text": "Pros: good point is you can use miro SD cards in the phone and the camera comes in handy ... Cons: battery life is really bad after having this phone for 22…"}, {"rating": "2", "user": "-", "raw-text": "Nokia N95 has easy access and is easy to use but takes quit long to tern on. its fantastic if you now everything on it"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Nice looking phone, plenty of software, can even make a cup of tea! ...Bad Points: A bit too big for a pocket, battery life abysmal. Thought this was going…"}, {"rating": "2", "user": "-", "raw-text": "EPIC"}, {"rating": "2", "user": "-", "raw-text": "The Nokia N95 is a great phone. Would recommend it entirely, although it will be interesting to see what the N85 is like when its out because gut feel is it…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Solid Keypad, Protective Sliding Cover on Main Camera, Access to Email,Wap and Web pages all over the World, GPS was an afterthought amazing it…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Bluetooth, WLAN, GPS have all been fantastic. ...Bad Points: Battery is shockingly bad. It is on this basis alone that I have just sent mine back.…"}, {"rating": "2", "user": "-", "raw-text": "Have had this Nokia N95 phone for over 18 months now and absolutely love it. Contract is up but wouldn't even entertain switching to another phone. OK, some phones…"}, {"rating": "2", "user": "-", "raw-text": "Amazing, it's 4 years old, and stil a Great Mobile Feature packed,you can't fault this Mobile, you can pick up a nokia-N95 cheap for around 50 pounds easy if you look around. the Video…"}, {"rating": "2", "user": "-", "raw-text": "Pros Lightweight Cons None submitted ...Good for: Texting, Photos it is too normal, i cann't find anything can be attracted to buyers, sometimes can be said…"}, {"rating": "2", "user": "-", "raw-text": "Pros None submitted Cons Short Battery Life, Lacks features, Energy Inefficient, Poor Quality, Email setup difficult ...Good for: Texting, Photos, Travel this…"}, {"rating": "2", "user": "-", "raw-text": "Pros Long Battery Life Cons Bulky Nokia N95 Cell Phone is bulky but it is really easy to use and it is strong as well.I droped it few times but it still work well."}, {"rating": "2", "user": "-", "raw-text": "Pros Durable, Long Battery Life Cons None submitted ...Good for: Texting its price is cheap, good for every day use, good quality of sound, but it is a little…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Long Battery Life, Good Quality, Good Sound Cons None submitted Nokia N95 is really strong mobile phone.The sound is big that can be a alarm…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Lightweight Cons Lacks features ...Good for: Texting, Photos, Email, Travel, Gifts It's really unbelieable with a very cheap price....although it…"}, {"rating": "2", "user": "-", "raw-text": "I have had the iphone on trial it pales into insignificance to the Nokia N95, its so fast and sound quality fab. I also had the 8800, and this is an upgrade"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Screen quality and camera better than any I've had before Loads of features Excellent sound quality ...Bad Points: Most features have to be paid for…"}, {"rating": "2", "user": "-", "raw-text": "good transaction,good price,helpful when you need them,great business,"}, {"rating": "2", "user": "rach", "raw-text": "I've had the Nokia N95 for 12 months now and apart from the battery life it's a great phone. The camera is ace, The video is great, The sound quailty of the tracks…"}, {"rating": "2", "user": "nokia", "raw-text": "Have been a loyal nokia fan for a long time, however after this experience I will not be entertaining a nokia for the foreseeable future."}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Intuitive, Good Sound, good looking phone Cons Bulky, Lacks features, Limited Memory, Email setup difficult, complicated to use,…"}, {"rating": "2", "user": "-", "raw-text": "Pros Nice Screen, Durable, Long Battery Life Cons Bulky ...Good for: Texting, Photos, Web Browsing Decent battery life, a good 5mp camera, decent build quality…"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Durable Cons Bulky ...Good for: Texting, Photos, Email, Web Browsing, Travel, Gifts Ive had one of these phones they last…"}, {"rating": "2", "user": "-", "raw-text": "Pros: Tons of featuresCons: Can't find anyBest phone ever!"}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Durable, Long Battery Life, Intuitive Cons None submitted ...Good for: Texting, Photos, Web Browsing, Email, Travel, Gifts The N95…"}, {"rating": "2", "user": "-", "raw-text": "I have owned the Nokia N95 8GB for the past year, the phone is excellent overall however does have some flaws... - Poor battery life (Needs charging almost daily) - Bulky…"}, {"rating": "2", "user": "-", "raw-text": "Pros: large memory capacity, well placed keys, easy to navigate menu ... Cons: keys get warn out easy Overall i think its a great phone, with the ability to…"}, {"rating": "2", "user": "-", "raw-text": "Nokia recognises that there is a problem with the GPS satnav system and have come up with the \"assisted GPS\" ideaThe problem was that I found the assisted GPS was fine if you were in the…"}, {"rating": "2", "user": "-", "raw-text": "Where do I start? Terrible battery life, kept crashing - could only restart by taking battery out and re-inserting it, battery cover kept falling off, took it…"}, {"rating": "2", "user": "-", "raw-text": "Will not disappoint....well worth the value for the hefty price."}, {"rating": "2", "user": "-", "raw-text": "Pros Great Design, Nice Screen, Intuitive, Durable Cons Bulky ...Good for: Texting, Travel, Photos, Email, Web Browsing, Gifts, Music, Upgrade, Everyday Use,…"}, {"rating": "2", "user": "n", "raw-text": "I have always used Nokia I got the Nokia N95 as my new upgrade at the end of January 08 its now may 08 and my phone has been in for repair 3 times. When its…"}, {"rating": "2", "user": "-", "raw-text": "STILL ONE OF THE BEST OUT THERE. HAD APPLE IPHONE. N900. SATIO. SOLD THEM ALL. BUT HAVE SILL GOT THE N95 I LOVE IT."}, {"rating": "2", "user": "-", "raw-text": "The slide mechanism is cheap and flimsy, it is not far from a house brick the N95, I would never recommend the N95 to anyone so am hoping when readers read this"}, {"rating": "2", "user": "-", "raw-text": "Ive been a nokia man all my life, but no longer! you need to upgrade firmware to get more stability, but def I do NOT recommend this phone."}, {"rating": "2", "user": "-", "raw-text": "Full of application with a considerable amount of harddisk. ... Weakness: Not slim Nokia N95 8GB has currently only in black color. It has capable of using GSM…"}, {"rating": "2", "user": "-", "raw-text": "I bought a Nokia N95 when they first became available because the advertising sounded like it was the best invention of the year. I think that perhaps 3 or 4…"}, {"rating": "2", "user": "-", "raw-text": "My Nokia N95 battery doesn't last 5 minutes, chargers last 5 minutes. Camera is meant to be 5 mp more like 1!i had phone 3 months, it crashed, had new handset…"}, {"rating": "2", "user": "-", "raw-text": "the charger works but sometimes it pops out, kinda like it wasn t made for the nokia n95."}, {"rating": "2", "user": "-", "raw-text": "Hi guys, I have the Nokia N95 in black, its the coolest mobile I have ever seen in my life."}, {"rating": "2", "user": "-", "raw-text": "In general I quite like the Nokia N95 phone, it has a good camera (even though it can be a bit slow at times), a good (from what I can tell) reception and I…"}, {"rating": "2", "user": "-", "raw-text": "Great looking phone,could do with a more powerful battery,"}, {"rating": "2", "user": "7,", "raw-text": "I have had my nokia 95 since the day it arrived, I swear by it, it has been the most reliable phone I've ever had. I'm so upset I can not get another one not…"}, {"rating": "2", "user": "-", "raw-text": "Have been dissapointed by this Nokia N95 phone since I got it.Navigation is hampered by softkeys that seem ultrasensitive, sending you to bizarre places every time you slightly…"}, {"rating": "2", "user": "-", "raw-text": "Pros: GPS ... Cons: No touch screen If Nokia had incorporated a touch screen, this phone would be close to 10/10. A very hard phone to beat."}, {"rating": "2", "user": "-", "raw-text": "Pros: GPSCons: No touch screenIf Nokia had incorporated a touch screen, this phone would be close to 10/10. A very hard phone to beat. ..."}, {"rating": "2", "user": "-", "raw-text": "Pros: photo quality is tops ... Cons: where do i begin i have owned a few nokias in the past mostly the cheapest phones, but this time i thought i would splash…"}, {"rating": "2", "user": "-", "raw-text": "this phone is a gadget phone. just a trendy looking photo studio. for work this phone is useless. it will slide up and down in your pocket activating internet…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: On face value the phone looks great ...Bad Points: a bit chunky to live with and the battery life is terrible, I find myself having to constantly recharge it.…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: erm.... what do nokia say \"It is what PC's have become\" ...Bad Points: It only comes in Plum and Sand The Nokia N95 is a very good all round professional…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Media Player, GPS. ...Bad Points: Battery life. The Nokia N95 is a great all-round phone"}, {"rating": "2", "user": "-", "raw-text": "Good Points: It has got everything you could possibly want in a phone. ...Bad Points: Very slow, cuts out, battery also not very good. I wouldn't recommend the Nokia…"}, {"rating": "2", "user": "-", "raw-text": "Loved the Nokia N95 when I got it shame about all the problems as it is a decent phone. I have now had 5 N95's they all had to be sent back. Problems with…"}, {"rating": "2", "user": "-", "raw-text": "the phone is ok but i like the old version better"}, {"rating": "2", "user": "-", "raw-text": "Never again will I buy a Nokia phone from the n series i will stick to my d500 (samsung)"}, {"rating": "2", "user": "-", "raw-text": "The Nokia N95 8GB is the best phone I have had ever. The camera is amazing and wow there is no phone that I want now as I used to buy a phone ever month.I had…"}, {"rating": "2", "user": "-", "raw-text": "These problems seem to be very common with this phone, Nokia should scrap this model as most problems just cannot be resolved, its very frustrating when your in…"}, {"rating": "2", "user": "-", "raw-text": "When I use Nokia N95 8GB, i can access internet with high speed data access (HSDPA), this is the point why i verry satisfied to use N95 8GB.long Battery life…"}, {"rating": "2", "user": "-", "raw-text": "Overall, The Nokia N95 is the worst phone ive ever had so much for some stylish phone feels plastic."}, {"rating": "2", "user": "-", "raw-text": "Very pleased with the N95 and would recommend to others. It's smart, stylish and practical."}, {"rating": "2", "user": "-", "raw-text": "Pros: looks good - does what its meant to do - good camera - loud ring tones ... Cons: its all good LOL Bought this phone from work on a cheap contract - got the N95…"}, {"rating": "2", "user": "Farmer", "raw-text": "I was impressed when i first seen the Nokia N95 but when i got it i started to notice the problems. After beening sent away mine is now beyond repair. I bought…"}, {"rating": "2", "user": "-", "raw-text": "I have had my Nokia N95 just short of a year now. Every so often it will turn itself off and back on again. I have kept good care of it but now it has started…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Excellent phone no problem what so ever Everything about the Nokia N95 is good, i don't have any problem with it bought it last September no…"}, {"rating": "2", "user": "-", "raw-text": "In short, if you CAN upgrade the Nokia N95 firmware to the latest version 20, I would strongly recommend the phone: but if not, only purchase the phone if…"}, {"rating": "2", "user": "-", "raw-text": "Would not advise the Nokia N95 phone as nokia have major problems with the soft ware and will not help. Faulty goods"}, {"rating": "2", "user": "7,", "raw-text": "the speaker and the digital camera is exceptional ... Weakness: The gps is not responsive,very slow,battery life is average and need buy at least worth $300…"}, {"rating": "2", "user": "-", "raw-text": "Great phone. Mine says UMTS 850/2100."}, {"rating": "2", "user": "-", "raw-text": "The best mobile I have ever used. I have been using it for more than 8 months without hazzle."}, {"rating": "2", "user": "-", "raw-text": "Pros: lightwieght,2 cameras,photo quality,colour (mine is purple) ... Cons: gps? hard to work out? in saying that though my sister has had the same phone and…"}, {"rating": "2", "user": "-", "raw-text": "Reliability is awful mine crashed and froze if you have another opinion then you have been really lucky with yours!"}, {"rating": "2", "user": "-", "raw-text": "I LOVE THIS PHONIS BETTER WHIT THW IPHONE AND IS THE BEST COMPANY OF CELLULARS ..... NOKIA .------ IS THE BEST OF THE BEST"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Camera, music,video are all good as are most other features ...Bad Points: None so far I have had this phone a month now and am still finding new…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: It has everything you could possibly want and saves space in bag. ...Bad Points: Keeps freezing and have to take battery out, let picture fade from…"}, {"rating": "2", "user": "-", "raw-text": "Good Points: Screen, looks, feel (not build quality but rather size vs weight) ...Bad Points: Battery, but here is a tip, turn off the 3g network and it lasts 3…"}, {"rating": "2", "user": "-", "raw-text": "Ultimately I carry this one device, it's my phone, my PDA, my music player, my movie viewer, my calculator, my camera, my map book. It's everything I need in"}, {"rating": "2", "user": "-", "raw-text": "N95 8Gb, the first 5 Mega Pixel camera phone manufactured by Nokia. From listening to music, watching videos, Wi-Fi, a 5-megapixel camera, to finally GPS Navigation -…"}, {"rating": "2", "user": "-", "raw-text": "Camera is also excellent, even on the lowest quality setting. The sound when listening to videos, music etc is very good due to the speakers on either side of"}, {"rating": "2", "user": "-", "raw-text": "I have this phone through O2 with a data usage bolt on which really brings the phone to life, don't even consider it without a data tariff!"}, {"rating": "2", "user": "-", "raw-text": "This is a great mobile. 5.0 megapixels camera, Wi-Fi, Improved GPS map and dvd-like quality videos are the features that make N95 becomes a user favorite."}, {"rating": "2", "user": "-", "raw-text": "I have been a loyal Nokia client for the last 10 years and only had one other phone (A Motorola) because of their great features and reliability. However the Nokia N95 8Gb…"}, {"rating": "2", "user": "-", "raw-text": "Wow! what can i say, this phone is absolutly brilliant! I normally tend to get drawn in by the more over fancy looking phones but this time i decided to go with a…"}, {"rating": "2", "user": "-", "raw-text": "Nokia N95, is one of the best mobile in nokia's production. I was using this one since 2 years, with out any complaints. all the features were awesome. I really…"}, {"rating": "2", "user": "-", "raw-text": "Bought the Nokia N95 from phones4u bout 7 months ago on Vodafone. Generally a great all-rounder smart phone, all features conveniently packed into one matt finish phone.…"}, {"rating": "2", "user": "-", "raw-text": "Good phone, alot of software to get the techie to buy in! WiFi is handy and great for the first week you own the phone, but pretty useless outside your own home…"}, {"rating": "2", "user": "-", "raw-text": "I like the style of it, and it has many features which at the beggining i did not think it may have it, eg the office, the capacity of watching a film ect"}, {"rating": "2", "user": "-", "raw-text": "Overall a very good phone"}, {"rating": "2", "user": "-", "raw-text": "I wanted another mobile(i have the Samsung F700 great phone) tried the sony ericsson W960I(8Gb) and the Nokia N95 8Gb. What a difference! the SE has great music…"}, {"rating": "2", "user": "-", "raw-text": "The Nokia N95 8GB has great sound quality and also phone can used offline when on an aeroplane to listen to music great phone 10/10"}, {"rating": "2", "user": "-", "raw-text": "i have had many phones over the past couple of years and all makes but for me the n95 8gb is the best.slider wise it is tops only just edged out by the build of…"}, {"rating": "2", "user": "mac", "raw-text": "The Nokia N95 8GB is a great phone with too many features to list. Might seem a bit pricey but it's well worth it. The best feature would have to be the WI-FI. I've never…"}, {"rating": "2", "user": "-", "raw-text": "Has everything you need in a smartphone. With a data plan (I use 3's X-Series) you can sync your calendar, emails, notes and everything with your PC.I'm pleased…"}, {"rating": "2", "user": "-", "raw-text": "I will recommend to all that they should go through the features and specifications and compare this handset with all others which they are willing to buy and…"}, {"rating": "2", "user": "-", "raw-text": "The whole phone is amazing, the quality in which it looks is always a plus, This phone has a professional look to it, amazing screen, great music player when…"}, {"rating": "2", "user": "eye", "raw-text": "Very powerful device, I like it."}, {"rating": "2", "user": "-", "raw-text": "I have had this phone for about 3 weeks. My previous phone was an 8800, so this means two things so far, a) I am really impressed with the fact there are so…"}]