[{"rating": "5", "user": "-", "raw-text": "This is asuch a great purchase and the price is fantastic. It is really stylish and has the look of a much more expensive smart phone. The keyboard is just large enough to use with ease, however large fingers might have slight touble.The screen is bright and colourful and shows fairly well in sunlight. The Camera quality isn't great however it has a range of effects to utilise. The video recording is useless on the Nokia C3. It will only take 5 seconds of video and the quality isn't great anyway.The phone comes with some really great features though, these include a range of games (a number of which are trails however) as well as a radio, mp3 player and very easy access to Facebook and Twitter through the 'communities' app and to your emails. The operating system is the same as a number of other Nokias and is very easy to navigate.The biggest problem with the Nokia C3 is the signal. Incorperated into the phone is wifi however there is no 3G and this makes internet access very difficult if you are in an area with no wifi. This is obviously a major floor with the phone and part of the reason that Nokia has got the price down, however if you can get past this then you have a truely fantastic phone."}, {"rating": "5", "user": "-", "raw-text": "Now thats what I like .....Not too complicated! and a key board layout you can actually understand / use.Modern, sleek design, and a bright display( a variable font size as well , so no need for specs)Only slight issue.... connection for charger seems a little flimsy , I thought it was on charge but jack plug had got disconnected :-(Overall very good value"}, {"rating": "5", "user": "-", "raw-text": "PROS : nice qwerty keypad that makes it easy to type in a text. battery life could last for 2-3 days with heavy-usage. customizable themes and home display screen CONS : phone connects to the mobile network (EDGE/GPRS) by itself. so if you are on a plan, you may be charged for it. I removed wap and gprs settings on my phone to stop the phone by connecting it to the network. fonts are too large (hope they release a new software for this). characters on text messages displays wrong letter (master reset on the phone fixed this issue). so far, there are workarounds for some of the issues on the phone.. the only unresolved problem im having with it is the font size. if you guys are heavy texters and loves to do instant messaging, this is the right phone for you"}, {"rating": "5", "user": "-", "raw-text": "Pros: This is S40. That being said, the Nokia C3 has nice apps for messaging and e-mail (Google, Yahoo, MS Live/Hotmail and Ovi). It comes with a few games (Block'd, Bounce Tales, Diamond Rush, Sudoku). Opera mobile 4.2 is pre-installed and works wonderful. Speaking of the browsers, I don't really know why people complain about the Nokia browser that much.I bought that phone primarily as a back up phone for my Nokia N900. Keen eyes would surely see that both phones are using the same battery (BJ-5L).Wi-Fi works ok. The range at which you can pick-up signals is short. My router is in the living room and I was in my bed this morning and could barely see it (around 8 to 12m through 2 walls).The Nokia C3 can easily be configured to use Fido Internet (call them for the settings). I have just tried it and bought a one day pass which allowed me to play youtube video, although the quality is only ok. Gtalk works too !The screen is of good quality. Viewing angle is not badCons: Google maps applications require a touch screen so I was not able to use that. Strange ..."}, {"rating": "5", "user": "-", "raw-text": "This is my first QWERTY phone and I'm pleased with it. Had it a week and texting is now a pleasure, sending 30+ a day with ease. Easy to use phone, bluetooth works well, wifi connects in seconds if you know your passcode (rediscovered mine on underside of router). Havnt downloaded any themes yet, the ones supplied were not impressive. Pleased with music player and radio through speakers, though headphones just adequate. Camera alright. Having fun with voice recorder, handy for recording guitar and silly txt alerts, lol :D Took a few minutes to get the supplied 2GB memory card out on the side and replace with a bigger capacity one (you have to press it and it pops out). Overall this phones appears to be storming value for money compared to previous phones I have bought."}, {"rating": "5", "user": "-", "raw-text": "Good Points: Although I have had mobile phones for years I have never really used them and my husband got fed up of not being able to contact me. I thought that if I had a decent phone that was easy to use with a good battery life (because I will never remember to charge it) I might use it more. So far, so good. I leave the phone on all the time and I have only charged it once in two weeks. The ring is loud enough for me to hear it through its leather case, in my handbag in another room. The qwerty keyboard means that I am now happy to send texts, something I previously hated. Being able to download games and apps is a bonus so I can use it to pass time when waiting for the kids to finish a club or other activity. It feels solid and looks good (the hot pink is hard to lose but actually is quite a dark colour so doesn't look too girly). I was pleased to find a phone with such good features but without 3G as it didn't want to pay lots on PAYG for it to connect to things that I don't use. Bad Points: The wifi internet is quite slow, but for this price I am pleased that it has it and it won't be used much anyway as we have a computer for that."}, {"rating": "5", "user": "-", "raw-text": "I love this phone..i swear by Nokia and wasn't to sure about this one but it's a great wee phone for the price. Good sound quality..Photo's very clear..long battery life and to top it of looks like a blackberry so all round very pleased with my new moby...."}, {"rating": "5", "user": "-", "raw-text": "Absolutely fab phone being a mum of three I feel as thou Im up todate with the latest fashion. Very easy to use, love the ring tones, big screen so I can view my photos with ease."}, {"rating": "5", "user": "-", "raw-text": "Good phone!1) High-quality display (bright and clear! This is in the E71, E722) Who was talking about the sound? Sound normal! should not compare it with the Express Music! This high-quality speaker phone, loud!2) There is a WIFI! Very convenient!3) Housing: High-quality, build a 5 -, rear aluminum cover4) Keyboard is very comfortable, the buttons are convex, all visible5) Battery: 1320Mach works very well! I have 4-5 days of use of calls and the player, if you use ICQ will last for two days! what I think is good ...6) USB Flash Drive: I´m standing on all completed files 8GB"}, {"rating": "5", "user": "-", "raw-text": "This is the best phone I have purchased. Have had it for a few weeks now, and I like the keypad (makes texting easy) and the large screen. Would recommend most Nokias anyway,though I had a slider phone and the sound quality was terrible. I'd suggest getting a cover, to prevent scratches."}, {"rating": "5", "user": "-", "raw-text": "Needed a replacement as my Sony Ericsson w595 had finally broke. I knew I could never get the same again & I really did not want a touch screen. Only had this a few weeks but so far so good. I do have to charge battery every 2-3 days as I do use internet & music alot. The camera isn't as good as my sony, grainy & not so many settings but I'm not that fussed as for the main reasons I need it - its doing me well (so far) I'd recommend it."}, {"rating": "5", "user": "-", "raw-text": "I bought this because the price was reasonable for an unlocked cell phone and it is very attrative! However, when i used my AT&T SIM card in it, I was able to access phone service and text messages only. I was unable to access the web or multimedia messages and I have an unlimited plan. I called AT&T tech support and Nokia tech support mulitiple times. Neither service could troubleshoot the configuration problem. This phone IS NOT configured properly for AT&T service. I had to return this product as a result. Dissappointed! ..."}, {"rating": "5", "user": "-", "raw-text": "A good phone for a ridiculously low price for what you get. Qwerty keyboard is great makes writing much quicker, It is what you would expect from a nokia. Have had a few problems playing videos which is why i give 4 stars, but aparrently they are working on a software download available soon which fixes this."}, {"rating": "5", "user": "-", "raw-text": "I bought this phone for my ten year old daughter for xmas and she is already a whizz texting all her friends with the qwerty keyboard, and it means I can stay in touch with her when she is out. The battery life is excellent, as we are only having to charge it once a week, and the phone's features are amazing for the price. A great all-rounder and looks expensive so she can be the envy of all her friends!"}, {"rating": "5", "user": "-", "raw-text": "Good Points: Product is Value for Money. Not So Complicated with the price offered. Bad Points: C3 still have issue with the local Wifi Connection. Seems like vodafone software to lock the Mobile block original Wifi function of the Mobile phone."}, {"rating": "5", "user": "-", "raw-text": "Good Points: Excellent battery life and standby. It has been 4 days since I last charged my mobile and that is with regular usage rather than excessive. Really easy to navigate and well thought out, logical menu. \"Hot pink\" wasn't my choice - I needed a phone quickly in that price bracket and that's was the only colour available, but you know what, its growing on me! Bad Points: I miss not being able to pick up emails, and is a slight irritant rather than real problem. Have noticed that on occasion while texting, I involuntarily get the \"upper case\" symbol rather than letter. This has been annoying and I'm a little irked that its something I need to get sorted and the inconvenience of having to do so."}, {"rating": "5", "user": "-", "raw-text": "Good Points: Easy to use. Brilliant qwerty keyboard! Bright display, sleek design, battery life is fantastic. Bad Points: Camera is a bit dull and has no flash."}, {"rating": "5", "user": "G", "raw-text": "Good build quality, nice solid feel. Clear quality calls. Keyboard easy to use for texting. Menus are clear and easy to follow. Camera quality a bit limited at only 2MP. Beware of making too much use of the internet on pay-as-you-go, it can get very expensive."}, {"rating": "5", "user": "-", "raw-text": "Good Points: Easy to use. I use it for phone, texting and checking the internet and emails and for this it's the best phone I've had. The QWERTY keyboard is good to use and common punctuation marks are included on the keyboard as well so you don't have to scroll through, looking for them. Battery life is impressive, much much better than my previous phone, a Samsung. Bad Points: None so far"}, {"rating": "5", "user": "-", "raw-text": "I have always been a huge fan of Nokia phones & I have to say that the Nokia C3 did not let me down. This phone was sold exclusively though Walmart a few months ago & could very well still be in stores for the time being. Pros: +Very Responsive Keys +Very Customizable +Super Long Battery Life +Runs on the EDGE network with decent web browser speed +Able to multitask while playing music +Loud ringtones & Loud Alarm +Video player +Excellent Call Quality +2MP Camera Cons: -Doesn't play YouTube videos -Phone sometimes glitches on SMS messages (I have owned 3 of these phones & its does it on all of them...easy way to fix this problem is to switch from conversation view to normal view when you are messaging or you could simply turn your phone off & power it back on in 15 seconds) -Keypad layout slightly different from tradtional QWERTY keypads on other phones -Doesn't take 2MP quality pics or video (very low quality video & pics look a little dark & fuzzy) -No volume rocker :( (You can adjust volume by pressing on the Options tab & select More...check Volume & press Done...go to Volume & set the Volume on your phone. Or while in call you can just simply press up & down on the directional pad for in-call volume settings) The Nokia C3 is a great phone for anyone looking for excellent call quality, full QWERTY keypads and really do not care for phones with slider mechanics. If you have videos saved on your MicroSD card, you will be able to play them but unfortunately no YouTube. Battery life"}, {"rating": "5", "user": "-", "raw-text": "Rather disappointing, great keyboards but functions poor eg mail which would be great use of keyboard. Rather expensive for what it is.The Nokia C2 has small screen and no QWERTY keyboard but in every other way is better and costs Ł20-30 less."}, {"rating": "5", "user": "-", "raw-text": "i love this phone , it look complicated , but is so so easy to use and the qwerty key board is fab no more pressing 3 times for a certain letter when your txing..my dad 75 and we got him one too! features are spot on and camera is great, soo 100% fab from me!! who needs a blackberry when you can have this for less than half the price:@))))"}, {"rating": "5", "user": "-", "raw-text": "Good Points: very easy to use. love the qwerty keyboard. the battery goes on and on, even when i've been using the internet a lot! really like the design. i read in other reviews that this phone does not save sent text messages...well, mine does! maybe nokia have fixed the problem. Bad Points: facebook app is not great. i use facebook via the internet URL as its better than the app installed on the phone. no USB cable included with phone."}, {"rating": "5", "user": "-", "raw-text": "Really please with this phone. Had it a month now and completely satisfied - as good as a blackberry and much cheaper. Looks good, easy to use and does everything I want quickly. Sound and photos good quality. :)"}, {"rating": "5", "user": "-", "raw-text": "An excellent Nokia phone. Everything is excellent with features and ease of use and battery life is brilliant. Only one small minor disappointing thing was how small the qwerty keys are. Easy to tap the next letter in by mistake. Would help if I had some fingernails to press them though. But otherwise a brilliant phone."}, {"rating": "5", "user": "-", "raw-text": "Great Phone !! Plenty of features and easy to use once you get use to the keys. Only drawback is camera not very good, but i didnt buy it for this. But overall am well pleased with it and would defo recommend to a friend."}, {"rating": "5", "user": "-", "raw-text": "Nice light feel. Slightly larger keys than the E71x. Nice, bright screen and fonts. Good, standard, and simple Nokia menus. Good battery life - 2days+. ...if only it were 3G (or now 4G)!"}, {"rating": "5", "user": "-", "raw-text": "So pleased with this phone, having looked around at others decided on this one partly due to the good reviews. It is so easy to use, battery life excellent, love the qwerty keyboard which makes texting so much easier."}, {"rating": "5", "user": "-", "raw-text": "Great battery life, great features, great design! Basically great everything about it!Good buy, very hardwiring dropped it twice so far on laminate flooring and no scratches or damage done!"}, {"rating": "5", "user": "-", "raw-text": "Good Points: Brilliant phone. Especially like the WLAN feature which let you browse the internet without spending any money,providing you have wifi. As with all nokia it's intuitive to use and has lots of great features. i love the fact that you don't have to go buying any special headphones as you cvan use your regular one. It has a quality feel to it but would recommend getting a skin to protect it. Bad Points: can't set radio station name, only available on Vodaphone"}, {"rating": "5", "user": "-", "raw-text": "Keyboard buttons quite small. Menu easy to follow. Slim. Havent looked at advanced features yet. Need phone case to protect phone & not sure if numbers & letters will come off with time?"}, {"rating": "5", "user": "-", "raw-text": "I just got this phone and the phone itself looks nice but I'm confused about charger. Charger is big, it can't fit into the outlet. Can anybody help me with that? What is your experience with the charger for this phone? Thanks! ..."}, {"rating": "5", "user": "-", "raw-text": "Love the phone, had a samsung querty before but this is much more stylish and easier to use. Also good reception. Battery seems a bit hungry, but maybe because I am using it more than my old phone!"}, {"rating": "5", "user": "-", "raw-text": "Good Points: Good size making it easy to hold. The battery charge lasts and does not need recharged every day as I have had to do with other phones. Very happy with the purchase."}, {"rating": "5", "user": "-", "raw-text": "Good Points: Easy to Text and camera easy to use for somebody who is not used to mobile phones. Bad Points: I had to purchase a cable to allow me to download my photographs on to my computer."}, {"rating": "5", "user": "-", "raw-text": "Bought this for our 11 year old daughter and she absolutely loves it , she finds it really easy to operate and loves the querty keypad for texing. Fab phone , looks the part and for a bargain price too , a little gem ."}, {"rating": "5", "user": "-", "raw-text": "Good Points: still learning to use some points. easier than my last Nokia, love colour, use, camera, facebook, everything about it.. Bad Points: keep hitting wrong buttons when using keypad part.. too small,"}, {"rating": "5", "user": "-", "raw-text": "Good Points: The phone looks nice. Bad Points: The phone is very slow as I am a fast user and all my other phones work instantly. It is also tricky pressing the buttons. For the value I purchased it for I regret and wish I put in the extra money and get a decent phone."}, {"rating": "5", "user": "-", "raw-text": "Good Points: It looks great, it's easy to use and does everything simply and quickly! I just love this phone. For the past few months i've been struggling with a Samsung Genio Touch which was completely rubbish. My new NOkia is heaven :) Bad Points: I'd prefer a bigger screen, but that's just a small issue."}, {"rating": "5", "user": "-", "raw-text": "Decided to go back to Nokia after having had other unreliable makes. It is fairly easy to use and the LARGE FONT setting is brilliant ! The battery life is good, lasts 1 week. I am very happy with this purchase."}, {"rating": "5", "user": "-", "raw-text": "Overall a very good price for a nice looking phone. There is a problem connecting to wi-fi, hopefully an update from nokia will sort it. The camera could be better but it takes fair snaps."}, {"rating": "5", "user": "-", "raw-text": "Purchased 2 one for the wife one for me,what can I say nice well made little phone already dropped it twice not even marked .Like the key pad is much more efficient than my previous phone.The wife loves hers especially in pink.My only gripe is the camera one of the poorest I have used in a phone which is a shame as I like to use the camera alot, apart from that its still a bargain. The wife gives it 5 stars but for me only 3 because of my issues with the camera."}, {"rating": "5", "user": "-", "raw-text": "got this as my old phone crashed on me a few days befor. i liked my old nokia and did noy want a new one, but you can not get my old x3 anymore so went for this. have found it easy to us. i us everything on a phone so was inpressed did not have to read hand book as its easy to work out. battery does not last as long as my old one and takes linger to charge. but still a good phone"}, {"rating": "5", "user": "-", "raw-text": "This mobile phone is better than i thought it would be. I love the qwerty keyboard it is easy to use. I would recommend this to everybody, easy to use, good for all types of uses."}, {"rating": "5", "user": "-", "raw-text": "Been using nokia C3-00 4 5months already,,and heres my personal reviews:) PROs..fast bluetooth.bright screen.sleek design,find it better than e72.keypad is reasonably good 4 txtng addicts:D.superb call quality.yes, txtng n this phone sa breeze.fast ntrnet using wifi.2mpix takes average quality 4 still images. CAN PLAY YOUTUBE VIDEOS over wificonnection(just unblock youtube site and others,,pornsites f desired from the server-comp wer wifi s conncted). CONs..low quality youtube videos.freezes wen txtng using convrsation(dspicable).1day batlife heavy use.low sound quality,got 2 hav nicR stereo headset.verry low vdeo qualty,shaggy/shaky.laks 3g.s40 laks multitasking."}, {"rating": "5", "user": "D", "raw-text": "I have always wanted a qwerty keyboard but have always bought Nokia phones. This phone is good. Very easy to use and navigate. Has a few more bits and bobs than my last nokia but that's progess for you. My only gripe is that occasionaly the phone does freeze. It has only happened to me once. Other people I know have had it happen a few times and ended up changing theirs. I am going to hang to it and see what happens because the phone otherwise is very good. My daughter has a blackberry and she was impressed with this one|"}, {"rating": "5", "user": "-", "raw-text": "Good Points: Fantastic phone, has everything I need, very easy to use and a good looking phone. Bad Points: The only drawback is it takes between 4 to 5 hours to charge but then the charge does last quite some time."}, {"rating": "5", "user": "-", "raw-text": "I bought this phone for my 16yr old daughter to replace a rather expensive and rather unreliable acer smartphone. My daughter was unimpressed with th elook of the phone on the internet, but when I told her that it was available in \"Hot Pink\" she was sold on it. In reality it is a very easy to use piece of kit and my daughter absolutely loves it. It is ideal for anyone not just 16yr old girls, but not in pink."}, {"rating": "5", "user": "M", "raw-text": "Great phone bought for daughter. Easy to use and set up, the only difficult was setting up the phone to use the wireless network in the house as default when browsing the internet, rather than the phones GPRS signal. This appears to be a common problem for other buyers. I did eventually manage it, having found a procedure on the internet - my 13 yr old daughter would have struggled with this. Otherwise a great little phone, packed with features."}, {"rating": "5", "user": "-", "raw-text": "Purchased this phone as a Christmas present for my daughter. It's very smart and looks similar to a Blackberry (which I wasn't prepared to buy). After three months of quite hard teenage use, it's continued to perform. This is a very good phone."}, {"rating": "5", "user": "-", "raw-text": "Good Points: It has most if not all of the features of a BlackBerry Bad Points: This is not a shop's delivery or service of the product review - The instruction booklet falls short of having the user informed of what must be done to set up the phone, not just inserting the SIM card and charging the battery. One needs to sign in to Ovi to be able to send e-mail. The customer will continue to get messages like \"security incorrect\" and the phone has had problems with WLAN connections. The e-forum information is not always correct. All this has to be known let alone registering the phone with Vodaphone by automated message that tells the user that hasnt registered that they can access their balance on the website."}, {"rating": "5", "user": "-", "raw-text": "this phone is very basic with not a bad camera at all.this is a great wee first timmers phoneif your just starting outwant anything more then save your money and go a step up to something with more kick to it otherwise great wee phonebuttons a wee bit fiddly but you get use to it"}, {"rating": "5", "user": "-", "raw-text": "Good Points: I bought this phone for my 11 year old daughter and she absolutely loves it! So much so she was permanently glued to it for the first 2 weeks! She tells me it is really simple to use Bad Points: The keyboard is tiny"}, {"rating": "5", "user": "-", "raw-text": "My son wanted to spend his birthday money on a new phone. Got to say I was unsure as it seemed a lot of money. But got to say this phone is great value for money and i'm thinking of getting one for myself."}, {"rating": "5", "user": "-", "raw-text": "Good Points: All features were working and had quite a few apps installed. Bad Points: When you are recieveing calls or calling someone the speaker does not come out very clearly and you cannot hardly hear anything even on the highest volume, plus the whole point of having a phone is to call people and this phone is seriously chosen to be a flash product, but all i wanted was a smartphone which you can actually hear your call."}, {"rating": "5", "user": "-", "raw-text": "I did really like qwerty keyboard phones found them very big. I don't fancy the blackberry because they are harder to use.I have been used to nokias for so many years, so I decided to purchase the c3. This phone is excellent with battery life, the colour is fantastic, perfect size and easy to use.Has a lot of cool features however only comes with a 2mp camera. This was a really good buy for me, worth every penny"}, {"rating": "5", "user": "-", "raw-text": "Very good phone and very user-friendly. My only criticism is that you have to keep checking the phone to see whether or not you have a message or missed call whereas my old phone used to bleep intermittently to draw my attentino to the fact. Otherwise cannot fault it."}, {"rating": "5", "user": "-", "raw-text": "i would highly recomand this phone it is easy to use has all top features except skype on the go which is a drew back and the only other thing is i have't yet worked out how to input the Ł sign but given time i'm sure i will work it out.It is great and easy to use apps such as facebook and e-mail.All in all a great buy."}, {"rating": "5", "user": "-", "raw-text": "i bought the phone for my daughter she loves it the only reason i gave four stars is because there is no flash on the camera other than that i'm really impressed with it"}, {"rating": "5", "user": "-", "raw-text": "I bought this phone for my son for xmas and he loves it.I did expect a few complaints from him - this would be normal. But oh no, not this time, he had nothing but good things to say. From my son that is praise indeed."}, {"rating": "5", "user": "-", "raw-text": "Although I have not my way through the instruction book fully the functions I have found are easy to use the keyboard is an added bonus to an otherwise very good mobile phone"}, {"rating": "5", "user": "-", "raw-text": "Good Points: bought for my Son as yet all good and he is pleased to have received the Nokia C3 for his birthday and I have the same phone on contract Bad Points: None as yet"}, {"rating": "5", "user": "owl", "raw-text": "This is a great phone, easy to use qwerty keypad, Facebook, email and internet are easy to access, looks more expensive than it is,I have to say this is the best phone i have had well done Nokia."}, {"rating": "5", "user": "-", "raw-text": "This Nokia C3 overall is a pretty good phone. Sturdy and pretty well-built. PROS: Long battery life, great QWERTY keyboard, nice screen CONS: no Wi-Fi, service interruptions (but that's a provider issue), keyboard buttons are a bit on the small side but manageable"}, {"rating": "5", "user": "-", "raw-text": "Good Points: FANTASIC PHONE, EASY TO USE AND EXCELLENT VALUE FOR MONEY Bad Points: QUITE SLOW TO SWITCH ON. IF YOU DON'T HEAR THE INCOMING MESSAGE TONE (OUT OF THE ROOM OR THE PHONE IS IN YOUR BAG) YOU DON'T KNOW THAT YOU HAVE RECEIVED A MESSAGE, IE NO FLASHING LIGHT TO LET YOU KNOW A MESSAGE HAS BEEN RECEIVED."}, {"rating": "5", "user": "-", "raw-text": "Good Points: Usual Nokia efficient handling;Clear and easy-to-use QWERTY keypad;Large, clear screen;Fantastic battery life;Not a touch-screenGreat value for money as replacement for Vodafone contract handset"}, {"rating": "5", "user": "-", "raw-text": "Good Points: FOR SOME REASON I HAVE NOT BEEN ABLE TO SET UP MY E MAILS. SOMETIMES I HAVE TO REMOVE THE BATTERY BECAUSE THE PHONE IS TELLING ME I HAVE NO CONTACTS LOADED, BUT AFTER I REMOVE THE BATTERY , IT ALL RETURNS OTHER THAN THIS I FIND IT WORKS VERY WELL, AND THE KEYBOARD IS EXCELLENT TO USE, AND I HAVE BIG FINGERS. Bad Points: NON REALLY"}, {"rating": "5", "user": "-", "raw-text": "I have had many phones, on almost every major carrier, i switched to AT&T recently, a friend sold me a used LG SHINE, for once i was disappointed in an LG product so i spent $63.50 on this little number, the Nokia C3 let me start with the pros superior battery life even when using the camera, radio, or mp3 player sound quality is amazing texting is a breeze the radio is mazing to, its clear as a bell the mp3 paler has tons of customizable features and head phones sound great, it supports both mono and stereo blue tooth for both voice and music, the price for all this is beyond amazing cons, its only available on AT&T and that is all, for under 70 bucks this is the phone have period unless your a sucker for those droid phones, funny story, a bunch of \"Iphone only\" apps work on this phone as well, if your going to buy a nice replacement phone that you will love and thats feature packed, hit the local wal- mart and get a nokia c3 you will be glad you did"}, {"rating": "5", "user": "-", "raw-text": "Brought this phone for my daughter for christmas and she loves it. It has plenty of memory space for all her pictures and music etc and its a wonderful pink colour and reminds my daughter of a blackberry phone because of the way it looks. Really glad i purchased this item and would definately recommend it."}, {"rating": "5", "user": "-", "raw-text": "I bought this phone for my daugther for Christmas. Wasn't sure whether I had bought what she wanted but from the screams and hugging on Christmas Day I think I can safely say that it's \"just what she wanted\". It was purchased from the Argos in Bulwell one very late night in November as it was the only one left at that time. Thanks for the late night opening!!"}, {"rating": "5", "user": "-", "raw-text": "Purchased this for my partners xmas present, fantastic value for money, nto as expensive as the blackberrys and other smartphones, btu still just as great, Battery life is fantastic, he never puts the things down but rarely has to charge it, its look stylish, and feels nice too, easy to use! Highly recommended!"}, {"rating": "5", "user": "-", "raw-text": "Nokia C3 Mobile phone is a stylized tantalizing Phone that comes amongst a abounding QWERTY keyboard & is obtainable in a unconventional of air conditioned colours. This handset has a bland & curvaceous advised circumstances & comes provided a advanced array of communication, entertainment, imaging & media features, aloof cat and mouse to be enjoyed by the user on the move. source: www.extramobilephones.com"}, {"rating": "5", "user": "-", "raw-text": "very good all round phone wider than i expected but not a problem the keyboard is very good i have big hands and can still manage to type ok liked it so much i bought my wife the c3 in pink.."}, {"rating": "5", "user": "-", "raw-text": "Good Points: the phone is easy to use. The Granite grey colour suits the phone, it is slik and thin also it fits comfortably in the pocket.i recomend it to every body, it is just as good as the blackberry."}, {"rating": "5", "user": "-", "raw-text": "Good Points: It looks good and has lots of good features at a reasonable price Bad Points: Could not get it to work, Sim card would not stay in therefore could not register it,"}, {"rating": "5", "user": "-", "raw-text": "Good Points: Phone looks good and is easy to usegood to have qwerty keyboard for texting instead of normal phone number/letter keys Bad Points: not experienced so far"}, {"rating": "5", "user": "-", "raw-text": "Pros:look, battery life, design, call quality, features, price Cons:none After leaving my contracted cell phone about a year ago, I transitioned through a few phones trying to find the right match of cost effectiveness and…"}, {"rating": "5", "user": "want", "raw-text": "i got this phone last christmas as a present and chose it myself so was extra excited as i read about the twitter, facebook, ovi store etc. I loved the fact…"}, {"rating": "5", "user": "-", "raw-text": "Pros:Compact with many features Cons:Needs protective case as the screen and keypad are exposed 100% of the time The Nokia C3 cellphone is a very affordable cellphone with many upscale features. It looks…"}, {"rating": "5", "user": "-", "raw-text": "Since no one in his or her right mind wants an extended period on contract with the big cell phone companies, I have been purchasing \"go phones\" for the family…"}, {"rating": "5", "user": "-", "raw-text": "Picture quality is good, but it does not have a flash. If you are looking for a replace for that tired old phone, the one you broke yesterday, or just a good"}, {"rating": "5", "user": "-", "raw-text": "Pros:Long battery life - Bright display - Full QWERTY keyboard - Lightweight - Cons:Buttons are relatively small - Low internal storage - I feel that the Nokia C3 was…"}, {"rating": "5", "user": "-", "raw-text": "All in all, if your considering a phone similar to blackberry but at half the price, go for this! :D"}, {"rating": "5", "user": "-", "raw-text": "Pros: battery, volume, Bluetooth, great signal, MicroSD memory slot. Cons: when taking out MicroSD, it erases the assigned ringtones for contacts."}, {"rating": "5", "user": "-", "raw-text": "The C3 has an excellent camera with clear definition. Only down- side is the lack of light option which was good for lighting way in lofts. Nokia comes with"}, {"rating": "5", "user": "-", "raw-text": "Overall, though, the phone is a good phone and is good for texting, phoning, ovi chat, e-mail (though it can be quite slow) and music."}, {"rating": "5", "user": "-", "raw-text": "I was very happy with the camera! But annoying alerts kept popping up on the screen saying I had no internet connection. I never got rid of the messages."}, {"rating": "5", "user": "-", "raw-text": "This phone has very good battery life and reception. The camera could be better as the pictures are pretty low quality and grainy, but i guess its alright for a phone.…"}, {"rating": "5", "user": "-", "raw-text": "Pros: Good battery life, menu's are easy to navigate and overall a good quality phone for the low price. Clear screen and easy to use querty keyboard makes it a…"}, {"rating": "5", "user": "-", "raw-text": "Overall, I highly recommend this phone, especially to people that like to use their mobile to check Facebook and e-mail. It is an excellent value and product."}, {"rating": "5", "user": "-", "raw-text": "Instant access to the web, FM Radio, IM, AT&T Social net, Email, AT&T Music, Apps & Games from AT&T and Nokia USA, USB and MicroSD card connections. Best phone for…"}, {"rating": "5", "user": "-", "raw-text": "I had this phone on an Talk Mobile contract for about 14months and i was bored out of my mind. You can't connect to the internet however i think that was just the…"}, {"rating": "5", "user": "-", "raw-text": "this is a very good phone, it has very good graphics and the camera is amazing. the operating system is better then a blackberry curve 3g. the app market has…"}, {"rating": "5", "user": "-", "raw-text": "I've had it for a few months now, and it's been alright. it turns itself off, vibrates randomly, and the internet is completely unpredictable. The Wi-Fi is slow, and so is the 2G.…"}, {"rating": "5", "user": "-", "raw-text": "Unlike others I didn't experience many firmware problems, which is just as well as there was no software pc cable included to update it. The problem arises in"}, {"rating": "5", "user": "-", "raw-text": "Overall this phone is easy and great :)"}, {"rating": "5", "user": "-", "raw-text": "Pros:Best Feature- Wi-fi, Looks- Same as blackberry, Price Point- Low Cons:Camera doesn't give perfection in Night mode. But in day, its worth taking pics. This…"}, {"rating": "5", "user": "-", "raw-text": "I bought this phone to replace my existing phone that I have with ATT. I did not plan to use it as a prepaid phone. I needed a new phone but didn't want to sign a new two year contract…"}, {"rating": "5", "user": "-", "raw-text": "This phone is ACE! It has a wide range of features like qwerty keyboard, conversations displayed, email , internet and the connection is really fast most of the…"}, {"rating": "5", "user": "-", "raw-text": "You might be thinking this phone isnt very good after this review but it does have good points. there are shortcuts which make it easier to control, it has"}, {"rating": "5", "user": "-", "raw-text": "I bought this phone to replace a Samsung 747. I just slipped my AT&T card in & it worked just fine. I didn't have to pay to activate it, like I would of if I…"}, {"rating": "5", "user": "-", "raw-text": "Just got this phone and I'm very impressed. First it looks great. It feels good in my hand and has a little weight to it. The keys on the keyboard are close together…"}, {"rating": "5", "user": "-", "raw-text": "Overall a good phone and i would definately recomend it !"}, {"rating": "5", "user": "-", "raw-text": "I got this phone and fell in love with it. however after a while it would flash white then turn itself off even when had full charge. can sometimes be very…"}, {"rating": "5", "user": "-", "raw-text": "This phone has an amazing battery life, I can usually go a week without charging! They qwerty keyboard is so easy to type on. But facebook and the internet is…"}, {"rating": "5", "user": "-", "raw-text": "good phone, easy to read screen ,qwerty keyboard makes texting quicker ,Battery seems to last well"}, {"rating": "5", "user": "-", "raw-text": "Pros:Homescreen feature, comfortable keypad, 2MP cam, music equaliser Cons:No standby for applications, no camera flash, bad browser typing respinse I must say, it's a…"}, {"rating": "5", "user": "-", "raw-text": "I bought this phone this time last year and having had it for this amount of time i can honestly say i wish i had read reviews to it properly... the first few months it was…"}, {"rating": "5", "user": "-", "raw-text": "Its an average phone and it works. the battery is good but the camera is the worst thing ever. and its good for texting. pretty much sums it up."}, {"rating": "5", "user": "-", "raw-text": "This phone is very easy to text people, i have had it for a year and after having it for 2 months it started freezing and turning it self off. The battery life…"}, {"rating": "5", "user": "-", "raw-text": "i got this phone afew days ago and can honestly say i love it. iv had smart phones such as blackberry and htc and to be honest they really annoyed me, esp touch screens…"}, {"rating": "5", "user": "-", "raw-text": "Overall love it."}, {"rating": "5", "user": "-", "raw-text": "Several times after having to do a battery pull it took so long trying to turn on it just gave up. And every time it froze it would use up a load of battery."}, {"rating": "5", "user": "-", "raw-text": "Have had this phone for nearly a year. I have dropped it in the sea and still works which I think is brilliant, battery life is amazing and pretty easy to…"}, {"rating": "5", "user": "-", "raw-text": "Well this phone has reconvinced me to buy nokia after so many in the past failed. excellent battery was on 1 light for 2 days. easy menu even great for the…"}, {"rating": "5", "user": "<3", "raw-text": "I got this phone for christmas 2010, at the time i wanted a blackberry but they were out of the price range, instead I got the Nokia C3. Everything is good. The camera is 2.0 but that is…"}, {"rating": "5", "user": "D", "raw-text": "If you are like me and like all the latest features on a phone, with good old buttons - no touch screen and a good battery life then this is the phone for you!…"}, {"rating": "5", "user": "-", "raw-text": "it is a brilliant phone! i had a Sony Ericsson xperia mini pro before this nokia and the is nokia better by a long way. the battery life of this phone is…"}, {"rating": "5", "user": "-", "raw-text": "For an <Ł100 QWERTY phone, I don't know how you can beat this. Great features, good battery life, adequate camera. The only downsides I can think of are occasionally hard to…"}, {"rating": "5", "user": "-", "raw-text": "well the features are just like any other life nokia except for the wifi which is very good. theres are lack of 'fun' apps which you can download. Battery life is very…"}, {"rating": "5", "user": "fan", "raw-text": "I had been saving up for this phone for ages and I finally got one. I didnt expect it to be as great as this. As soon as you turn it on there's facebook and twitter…"}, {"rating": "5", "user": "-", "raw-text": "I bought this phone as an alternative to a Blackberry, as my dad said they were too expensive. The look of this phone is stunning, and can definitely get away…"}, {"rating": "5", "user": "-", "raw-text": "I love this phone, i was torn between this one and the blackberry and im so happy i chose this one. The battery life is great, its really easy to use, internet…"}, {"rating": "5", "user": "-", "raw-text": "Great Value for the Money!!! Up to 41 day standby time and with the $2 per day unlimited talk & text only when you use it this phone is a winner. Every phone has pluses…"}, {"rating": "5", "user": "-", "raw-text": "I got this as I dropped my LG POP down the loo...like an idiot. This phone had been given great reviews and was reduced from Ł150 to Ł50!! Great Saving! Its easy…"}, {"rating": "5", "user": "-", "raw-text": "im 15 years old and a couple of weeks ago i lost my phone which was around Ł250.00! my mum went metal and said i couldnt get another expensive phone. a couple…"}, {"rating": "5", "user": "-", "raw-text": "I have 'favourite contacts', where you can keep a list of all of your most used contacts, and get quick, easy access to text them or call them."}, {"rating": "5", "user": "-", "raw-text": "It comes in a variety of colours and has lots of choice on different themes. The bad point is that the chat doesn't function properly and there's always problem"}, {"rating": "5", "user": "-", "raw-text": "Very pleased with it. Good battery life, good keyboard, good screen. The features are good enough for me."}, {"rating": "5", "user": "-", "raw-text": "I love this phone. Its so easy to use. it has a nice big screen & the battery lasts for at least four days even with bluetooth on. I found the qwerty keyboard easy…"}, {"rating": "5", "user": "-", "raw-text": "All in all I am very pleased with this smart looking phone which has a good quality feel and would recommend it highly."}, {"rating": "5", "user": "2", "raw-text": "Used phone for one week. Cant believe how good it is for the cost of the phone.not many phones with 2gb memory card.So easy to use screen good. this phone is…"}, {"rating": "5", "user": "-", "raw-text": "I've had this c3 for 4 days now, and what a phone. Plenty of great features, and the 2mega pixel camera takes very good pictures. Not only do you get a phone…"}, {"rating": "5", "user": "-", "raw-text": "Good Points: Good value for money, easy to use, good to text, camera excellent, long battery life."}, {"rating": "5", "user": "-", "raw-text": "Very happy with this phone especially for the price. The battery life is excellent. All the features have worked well for me. It works a treat with the…"}, {"rating": "5", "user": "Lady", "raw-text": "All in all a good upgrade and I would recommend it as the screen is large enough to see very well, especially photos. My 5 year old is very impressed with the"}, {"rating": "5", "user": "-", "raw-text": "I've had the Nokia C3 for about 24months, the best thing about this phone is its massive battery life. when i went on holiday i went for 10 days and forgot the…"}, {"rating": "5", "user": "-", "raw-text": "Good phone in many respects, battery lasts several days, picks up a signal well and good keyboard."}, {"rating": "5", "user": "-", "raw-text": "When I first got it, I thought it was the best, but a few weeks later, the cracks started to appear. It started to slow down, and then froze completely. This is…"}, {"rating": "5", "user": "Fan", "raw-text": "I wanted a smartphone but not a Blackberry as I was a frustrated former Blackberry owner, so when I saw this phone I thought it would be a good (and cheaper)…"}, {"rating": "5", "user": "-", "raw-text": "Phone easy to use with the same old Nokia menu. Wifi and Internet just as it should be to keep in touch. Very good price for this type of phone."}, {"rating": "5", "user": "-", "raw-text": "very easy to use, like a blackberry but not. excellent battery life. easy to send texts. querky keyboard. good storage for text messges, good hands free kit…"}, {"rating": "5", "user": "-", "raw-text": "Bought this phone and am well impressed by the look i got the gold colour. Connects to my wifi and im able to go on facebook etc. The internet isnt fanastically…"}, {"rating": "5", "user": "-", "raw-text": "I bought this phone 6 months ago and it is still in perfect condition. i have dropped it a few times and it has never broken. it is a tough, hard wearing phone…"}, {"rating": "5", "user": "-", "raw-text": "Good Points: Easy to use with a clear display and qwerty keyboard. Very long battery life. Bad Points: None as yet"}, {"rating": "5", "user": "-", "raw-text": "Good Points: easy to use,and has a great camera Bad Points: sometimes the keys stick and the internet is very slow...but overall does its job"}, {"rating": "5", "user": "-", "raw-text": "I bought this phone a couple of months ago on vodafone PAYG, At first, the phone gave me a good impression as I don't normally buy Nokia phones. I had the phone…"}, {"rating": "5", "user": "-", "raw-text": "I have been really pleased with this phone and would recommend it. Battery life is good and brilliant keyboard makes messaging alot easier. Good buy"}, {"rating": "5", "user": "-", "raw-text": "Overall, it is a good phone but I would not reccomend it as there are much better phones for the same price."}, {"rating": "5", "user": "xx", "raw-text": "Love it! love the qwerty keypad sooo easy to text woul reccomend to any1 xx lol reallly easily used and great camera and call quality. Wish it was a lil'…"}, {"rating": "5", "user": "-", "raw-text": "This phone has everything you need; a camera, internet, games, organiser and easy access to facebook and a qwerty keyboard! It is brilliant! I've had it for a…"}, {"rating": "5", "user": "-", "raw-text": "This phone was a huge disappointment. I ordered it after reading about it on the Nokia website. Seemed like a bargain - a somewhat \"smart\" phone with WiFi for $60, including $30 airtime. But there's a rub. This is not your…"}, {"rating": "5", "user": "-", "raw-text": "i got this phone for a christmas present, i chose it as i loved my previous nokia which was just getting too old. i got in slate grey and was so excited to get…"}, {"rating": "5", "user": "-", "raw-text": "I am very pleased with this product. I switched from the Samsung Impression(stay away from that phone) after the phone froze and I could not do anything but recieve…"}, {"rating": "5", "user": "-", "raw-text": "Absolutely love this phone and is awesome for the price. The only thing that I had an issue with was the 30.00 airtime credit since I was moving my existing SIM…"}, {"rating": "5", "user": "-", "raw-text": "This phone is excellent! Great screen, keyboard, features, etc. I wanted this phone to be better able to check email when I needed. But I am very conservative…"}, {"rating": "5", "user": "-", "raw-text": "Even though I don't use or need every bell and whistle, this little phone for the value, is really neat! It may not suit the sophisticated user wanting lots of…"}, {"rating": "5", "user": "-", "raw-text": "I am so impressed with this clever little device. It is stylish (especially in slate grey and white gold) and fits in your palm beautifully. It feels nice to…"}, {"rating": "5", "user": "-", "raw-text": "THIS PHONE LOOKS LIKE IT IS WORTH GETTING BUT ITS NOT. THE SCREEN ON THIS PHONE GOES OUT, SOMETIMES U CANT SEND TEXT MESSAGES,THE SCREEN SCRATCHES VERY EASILY.…"}, {"rating": "5", "user": "-", "raw-text": "I love this phone so much! I got it in the pale gold colour and it looks great. Texting is easy, connecting to internet is easy and the MP3 player is fab. A…"}, {"rating": "5", "user": "-", "raw-text": "I don't like the AT&T Mobile Care feature. On my old Nokia phone I had no problem adding time over the phone. This feature tends to freeze up and when it works the…"}, {"rating": "5", "user": "-", "raw-text": "Nokia support says, \"Sorry, you cannot update this phone.\" What a lousy product, it's terrible!. Will never buy another Noika phone. DON\"T BUY THIS PHONE!"}, {"rating": "5", "user": "-", "raw-text": "This phone is the best because of its sleek design, qwerty keyboard (great for texting) , ease of use and battery life. I would recommend this phone to anyone"}, {"rating": "5", "user": "-", "raw-text": "dont be drawn in by the wifi the quality is not very good on this phone. connection errors a frequent. camera quality is ok! however the rest of the phone is…"}, {"rating": "5", "user": "-", "raw-text": "My last phone finally bit the dust so my husband and I decided to try this phone due to our positive experiences in the past with Nokia products (great speaker and battery life) plus we…"}, {"rating": "5", "user": "-", "raw-text": "I bought the phone a week before and it's already messing up. I mean , this phone has alot of good things to offer but, on the 2nd day of experience with the phone 4 things…"}, {"rating": "5", "user": "-", "raw-text": "Just as well. Anyway this phone works fine and has a proper keyboard. It links to Ovi software so you may be able to get contacts rescued and on to this phone"}, {"rating": "5", "user": "-", "raw-text": "i bought this for my son for christmas it is good value for money and has some good features it does look like a blackberry"}, {"rating": "5", "user": "-", "raw-text": "For an extra $50.00 u get a lot more bells and whistles if u use a sim card from a different carrier unless ATT does happen to work in your neighborhood."}, {"rating": "5", "user": "-", "raw-text": "i've only had this phone for a day but its great! the battery life is amazing, its just like a blackberry apart from it doesnt have blackberry messenger! the…"}, {"rating": "5", "user": "-", "raw-text": "Love this phone. The features are great and love the keyboard because of the raised buttons. I have to say that the camera isn't the greatest, but for me the phone…"}, {"rating": "5", "user": "-", "raw-text": "I got this phone for christmas but i was worrying it wouldnt be as good as my friends blackberry.! I find thie nokia c3 much easier to use than a blackberry and…"}, {"rating": "5", "user": "-", "raw-text": "There is also intermittent beeping along with the blue screen. AT&T customer service says it's the phone and not their service and that I should return it."}, {"rating": "5", "user": "-", "raw-text": "I bought this phone 3 months ago and loved it at first. To Nokia's credit it has one amazing battery life, however the internet on the phone is rubbish. It…"}, {"rating": "5", "user": "-", "raw-text": "Got this phone just over 1 week ago and so far so good, has pretty good games and excellent battery life. It is quite easy to use but the QWERTY keyboard do…"}, {"rating": "5", "user": "-", "raw-text": "My daughter loves this. Screen is large and clear! Keys are easy to use. My favorite things about this phone is how easy it was to call and speak to an american and easily…"}, {"rating": "5", "user": "-", "raw-text": "I think think this phone is really easy to use, if you are mad about texting(that i am) this is for you. One thing i should mention is if you look at the feters…"}, {"rating": "5", "user": "-", "raw-text": "Battery life is good, but the reception is awesome. Keypad is small tho. Looks like an expensive blackberry"}, {"rating": "5", "user": "-", "raw-text": "I got this phone today and it was very easy to use, right from the start. I got used to the qwerty keyboard quickly and sent my first message with the conversation screen right…"}, {"rating": "5", "user": "-", "raw-text": "My Dad got me this phone and it is easy to use The camera ain't that bad but what do you expect from a smartphone. The navigation is really simple. Outstanding…"}, {"rating": "5", "user": "-", "raw-text": "Good value for money! It has everything that I need with the addition of being able to store music and the 4Gb FREE card coming in very handy indeed"}, {"rating": "5", "user": "-", "raw-text": "QWERTY keyboard... and EXCELLENT BATTERY LIFE..... I found nokia c3 and im very very very happy. I know is not a smart phone.. i know is not a 3G phone..."}, {"rating": "5", "user": "-", "raw-text": "Battery life is very good, lasts for 4 days without charging. easy to use, looks good and easy texting would buy this phone again but in pink."}, {"rating": "5", "user": "-", "raw-text": "I am sort of bias because I LOVE Nokia phones but this phone really exceeded my expecations. It is a great quality phone for the price. It is very simple and basic so if…"}, {"rating": "5", "user": "-", "raw-text": "this handset is the worst phone ive had it does msn and all that but it has so many problems with it. first the wifi doesn't work. Ive had to take out the…"}, {"rating": "5", "user": "-", "raw-text": "i have had this phone for.. 2 and a half months, it rocks my world! i can play all my favourite music on it and it is loud. the headphones are great. they boost…"}, {"rating": "5", "user": "-", "raw-text": "i got this phone two days ago now and it is amazing, so easy to use! the battery life is amazing and the things you can download from the ovi store for free is…"}, {"rating": "5", "user": "-", "raw-text": "This phone is a really good phone. it has a good social networking feature like yo ucan get live facebook & twitter updates on your phone home screen and comes with the…"}, {"rating": "5", "user": "-", "raw-text": "Good Points: cheap, reliable, good built, enough feature for a basic phone! Bad Points: color, size an design"}, {"rating": "5", "user": "-", "raw-text": "Good Points: Keypad easy to use. Screen nice & clear Bad Points: No Camera Flash. Earphones are low."}, {"rating": "5", "user": "-", "raw-text": "Good Points: Easy to use, lots of features, great value for money, perfect little phone!! Bad Points: battery life indicator can be tempremental sometimes"}, {"rating": "5", "user": "-", "raw-text": "Carphone warehouse show this as a Symbian phone...buts it actually Nokia good ole reliable S40 OS. So not so many apps to download, but still a good option if you…"}, {"rating": "5", "user": "-", "raw-text": "I asked for this phone for Christmas simply because i liked the look of it. It was fine for about 2-3 months, but now it always freezes and won't do anything…"}, {"rating": "5", "user": "-", "raw-text": "I purchased this for my daughter a couple of months ago. its a very good phone and would recommend it for anyone. the good thing is it has whatsapp on it so…"}, {"rating": "5", "user": "-", "raw-text": "I am a technophobe and have always bought Nokia phones. I bought this phone for ease of texting, and it is terrific. The querty key board makes life so much…"}, {"rating": "5", "user": "-", "raw-text": "All in all very impressed."}, {"rating": "5", "user": "-", "raw-text": "I chose gold colour and was bit afraid how it will look once it is delivered. Have to say it looks great, and I'm more than happy with it's features.…"}, {"rating": "5", "user": "-", "raw-text": "Pros:2MP camera, Wifi, Bluetooth, good battery timing Cons:No Flash for camera, JAVA, Screen is small There was a trend of QWERTY keypad mobile phones as blackberry…"}, {"rating": "5", "user": "-", "raw-text": "bought this for my daughter from debenhams its a gorgeous colour r fantastic phone great sound for music easy to use would recommend to anyone"}, {"rating": "5", "user": "-", "raw-text": "02 Nokia C3 Mobile phone looks stylish as described, easy to use and has a good battery life i would recommend it to a friend ."}]