[{"rating": "4", "user": "-", "raw-text": "The Nokia N900 (Type RX-51) is a heavy device. At 181 grams, over six and a third ounces. So with a hefty price and weight penalty what do you get in the N900? You get potential for great hand-computer with a phone attached. Potential- The applications, the software that makes having a computer useful, are lacking. What do you use a computer for? Word Processing \u0096 A viewer is available but not an editor. Spreadsheet - Again, a viewer is available but not an editor. E-Mail \u0096 The on-phone client sets up easily and allows reading and writing of e-mails. It gets full points here. Image Editing \u0096 A rudimentary image editor is included. Web Browsing \u0096 Do what you do on the web with it and you'll find it very close to your desktop browsing experience. T-Mobile 3G/2G, other GSM 2G and WiFi are your connection choices. Watch Movies \u0096 This has a luscious screen. Movies look super on this screen. They play smoothly. This device has the processor and RAM to do the job once the software is there. So what do you get as a phone? Again you get some potential but it generally delivers quite well as a phone. What do you use your phone for? Making Phone Calls \u0096 It says Nokia on it so it shines here. Sending text messages \u0096 Your choice of on-screen or physical QWERTY keyboards. Several kinds of predictive text choices are available. Sending Multimedia Messages \u0096 Can't do it with this phone - not yet. Perhaps in the next update. Calendar \u0096 Super deluxe calendar features. Nothing"}, {"rating": "4", "user": "-", "raw-text": "Nokia n900 Mobile Computer Smartphone, 32GB, 5MP Camera, UnlockedAt the heart of this mobile computer is its powerful 600 MHz processor and up to 1GB of application memory. The superscalar ARM processor delivers exceptional power and enables you to run all your applications quickly, smoothly, and simultaneously. The built-in 32 GB storage is big enough to store up to 7,000 of your favourite songs or 40 hours of DVD-quality video. And with an external microSD card you can expand the storage to up to 48 GB. For the first time get high-speed broadband that\u0092s as fast as an internet connection at home. Enjoy rich interactive content across the web and view pages the way they should be seen with stunning full-screen browsing. Capture vivid images and DVD-quality widescreen video with the integrated 5-megapixel camera. The Carl Zeiss optical lens brings added clarity, while the dual LED flash lets you take great pictures day or night. Powerful hardware packed into a sleek, compact design. The Nokia N900 mobile computer features a sharp 800 x 480 touch-screen display and a fully integrated QWERTY keyboard. Find your position quickly and accurately with the built-in Assisted-GPS receiver. The Nokia N900 works seamlessly with Ovi Maps to give you the quickest available route as you make your way from A to B."}, {"rating": "4", "user": "-", "raw-text": "I thought that they would have to pry my Iphone out of my cold dead fingers, but several weeks ago, I was introduced to the N900 by my phone consultant. Now, I am a proud N900 owner and believe that it is one of the best phones out there, if not the best. The principle advantages of the N900 are the simultaneous functionality of multiple features and the desktop-like web surfing. The most important thing is that the N900 is not a mass-market phone and was correctly introduced to me as a \"geek\" phone, designed for a more tech-savvy market. This means that it has a learning curve for those of us accustomed to being spoon-fed by Apple. Also, if you don't know Linux (and I don't) there are some new aspects to figure out. The transition is manageable. For instance, I am an enthusiastic novice and I had the phone set up and was downloading fantastic apps the first day. The App Comparison: The available repositories for N900 are full of free applications and donation-based applications created by professional grade developers. Compared to my old Iphone, there is little application envy from a functional standpoint. I downloaded the Google-maps and Firefox for N900 to use the sync feature, so everything looks mostly the same. Still, the Iphone is more mass market and seems to be more focused on being a game platform, so keep your personal priorities in mind. But also keep in mind that the N900 really is a mobile computer, so you don't need as many apps--you just go to the website like"}, {"rating": "4", "user": "-", "raw-text": "Pros: The hardware is absolutely top notch - fantastic display and a snappy processor for speed and responsiveness. Has all of the PC like features and capabilities without the clumsiness of past \"computer phones\". Great operating system, based on free and open Linux, so there is a surprising amount of diverse software and \"apps\", unlike Apple's more closed model which is more expensive and locks you in.Cons: Although it is housed in a sturdy plastic chassis, such an elite phone should really have the honour of being cased in metal, much like the ever popular E71. The screen needs to kick out like the N97 mini, because the slider design on the N900 makes the top row fairly difficult to use. The GPS on my particular unit does not work very well, which very well isn't a huge loss because OVI maps is absolutely infuriating and could do with some search lessons from Uncle Google. The size may put off most people that are used to the traditional candy bar phones. Some functions are puzzlingly absent out of the box- like an MMS function.I have had this phone for around 6 months and so far been very impressed. Most Nokia users will have a steep and somewhat confusing learning curve to overcome the Maemo operating system, but once you..."}, {"rating": "4", "user": "-", "raw-text": "Compared to the other positive posters on this phone, there isn't too much to add. Both myself and my wife love this phone. I would fall more towards the geeky side and enjoy playing and customizing my phone, my wife just wants something that works...we are both completely satisfied. Major pros: call quality, camera, music storage and playback, web streaming music, web browser, FM transmitter for over the air radio play. cons: night shots on camera, no mms (I just email pics anyway or upload them online). Both of us rely on our phone for both business and play. I recently took a weeks vacation and was able to ditch my laptop, ipod and camera as this took care of them all without any hiccups while working on the road."}, {"rating": "4", "user": "-", "raw-text": "I've been using this phone since December. I pre-ordered in August. Nokia said it should arrive in September...then October..then November...Then finally it comes before Christmas. Horrible Launch. Not only that it lacks applications, it lacks updates. This phone has many problems that still need to be ironed out. 25% of N900's ( source www.mameo.org ) have problems with their USB ports. Either falling out, not charging, or not being able to detect on a computer. Nokia REFUSES to fix this and says that it is \"user error\" It is NOT user error if about 25% of your phones have the same issue. I called their service and they said I had dropped my phone. Which I didn't and that they were not able to cover it under the warranty. I told them, I will pay them for it to get it fixed. They said they won't do that because it will void the warranty. Cool. Never buying Nokia ever again."}, {"rating": "4", "user": "-", "raw-text": "The phone is heavier and bulkier than I expected, but the touch screen is extraordinary. You can use the stylus or fingertip with equal precision, and the 'phone' feature kicks in automatically when you hold the phone...like a phone (vertically instead of horizontally). Only reason this isn't an Excellent rating is that features from service providers that require you to enter a code ending with the # symbol (such as checking your credit balance or minutes remaining) won't process. It registers as an invalid phone number and won't go through. Other than that, I have had no issues with the phone or features in any of the 4 networks I've used it (US, and 3 places in Europe). Great all-purpose phone...."}, {"rating": "4", "user": "-", "raw-text": "I have to come out and say that first I'm a nokia fan, and have been for years. I rarely keep a phone for more than 6 months, and have owned just about every high end nokia device 3650, 6600, 6630, n80, n73, n95 8gb, n76, n78, n82, n85, n86. Pros [ mostly hardware, a few software] 1) solid built 2) Excellent 5.0 camera for photos/excellent for videos 3) TV out- Very nice/cool 4) FM transmitter - cool 5) Solid Reception 6) Probably the best web browser 7) Divx, real player support out of the box Now the OS is something else. To make a long story short, Maemo was dead before this phone was released. It has some good points, but let me point out the bad first 1) No MMS -- seriosly Nokia , what were you thinking, this is so 2002 . You should have left out sms while you're at it. 2) No sim card management -- ??? What's that all about. The only thing you can do is copy numbers from your sim to your phone but not the opposite. 3) No USSD -- \"Can dial number starting with a star or pount sign [ can't check account or minutes\" 4) Very poor email client, very slow. 5) Impossible to wipe data off your phone. You cannot factory wipe it. Actually, there is a program to do it, but you need a degree in linux to have it run. 6) No Voice navigation on Nokia maps ?? All the symbian phones have this, why can't this phone have it too 7) Maemo is a dead OS : don't let the fan boys tell you otherwise. Nokia killed maemo 2 months after the n900 was released. The decided to ditch the OS and start"}, {"rating": "4", "user": "-", "raw-text": "Pros: Best Web Browser; Great Camera; Display; Good call quality; Responsive touch screen; Quality build; Excellent SpeakersCons: No Send or End Buttons; Keyboard a little cramped; No MMS yetI mainly use it as an information center. Texting, Web use, and of course, making phone calls. Apps are very scarce, as of now. Four-row keyboard would be better. Works great on T-Mobile network. One of the best smartphones out there."}, {"rating": "4", "user": "customer", "raw-text": "Please do not get this battery. First it s not original and it does not hold full charge, after 50% directly drops to 0. so you have to stick with half the talk time or stand by time. Buy if you are ok with it."}]