[{"rating": "5", "user": "-", "raw-text": "Probably the best convergence of technologies in a very compact and easy to hold package. The camera is superb and rivals that of my dedicated digital cameras. Unfortunately, the responsiveness of the camera is pretty slow, the shutter lag is long and the autofocus takes a while, but if you can anticipate your shots its no problem. The LED flash actually works pretty well too. The camera has a nice sliding cover to protect the lens and turns on the camera function when you open it. If you update to the latest 4.x firmware, you get the Music Edition audio player with album art support. Battery life is very good with pretty moderate to heavy use. Stereo speakers are loud and sound good with 3D ringtone effects and widening effects. Menus are responsive and the screen is gorgeous and fairly large. 20megs of ram free at boot up. Stability is great, I ve installed a ton of programs and haven t had a lockup yet. Syncs perfectly with Outlook and PC Suite is probably the best bluetooth connection interface (compared to Activesync). 2gb mini SD cards work fine, but there are rumors that 4gb mini SDHC cards will work too. Then you have an iPhone killer for half the price. Only things missing are 3G, wifi, and qwerty or at least bigger keys...but then I guess you would get the N95 instead."}, {"rating": "5", "user": "-", "raw-text": "Many moons ago, I bought a W810i. It was brilliant. It also got dropped in water. Insurance sent me various flavors of braindead and broken phones (Pearl 8100, Samsung SGH-a707, W580i, LG Shine CU720) before office of the President stepped in and gave me $200 to buy this phone. It beats them all. PROS: It runs a real smartphone OS, which means real applications and real PDA functionality. The camera is fantastic. Pictures are crisp and vibrant. Video could be passed off as coming from one of those \"Flip Video\" sort of cameras. The media player flat-out makes sense. It's easy to use, lets you send it to the background, and holding a button (with the most recent firmware) immediately brings up the 'Now Playing'. Battery life has not been a problem. It's not quite the ten days my old W810i managed, but it's by no means bad. I use it moderately and charge it every third day. Charging is incredibly quick. At the maximum brightness the screen is uncomfortably bright, which is a very good thing. In the Nokia tradition, RF, signal acquisition and holding, and voice quality are stellar. Calls are loud and clear, and my mom can't be convinced I'm not on a landline. The speakers on the top are loud and clear. CONS: The keyboard is a bit cramped, but I'm used to that sort of thing. The joystick is a bit low-rent. The front camera is dreadful, but you already knew that. It uses Nokia's smaller, spindlier charging connector (but comes with an adapter - don't bin that old charger just yet) and"}, {"rating": "5", "user": "-", "raw-text": "This is the first smartphone that can really replace my iPaq pocketpc. I own this device 6 weeks and it is great. The size of the device is just within the maximum limits to be able to carry it in the pocket. (I find the N80 a little too bulky) Reception and sound quality outstanding. In combination with the Bluetooth Nokia carkit CK7W it works superbe. Hardly noise and no echo. As an MP3 player this can absolutely compete with my iPod (unfortunately MiniSD Cards do not come in bigger than 2 Gb yet). Screen is superb with QVGA. Finally it is usefull with TomTom GPS software. Multitasking works flawlessly. When I am using TomTom with the bluetooth GPS receiver, I can answer any phonecall in between (even with my CK7W bluetooth carkit). Keyboard is OK. In some reviews it was reported as troublesome but I find it good to work with. The camera is fairly good. It is the best quality I have ever seen in a smartphone. However, startup is very slow and in poor light conditions the picture quality is poor. Do not expect too much of the flash. A few not-so-good points. The Email application is crap. I cannot even delete messages. The same applies to the calendar application. (The default Calendar applications on Palm and PocketPc are crap as well). However, there are excellent alternatives for this. You should immediately purchase Papyrus calendar application and ProfiMail email application. Both are very good. I am not so happy with voice dialling. You can no longer save your own"}, {"rating": "5", "user": "-", "raw-text": "I bought this phone from an Ebay store for use with Cingular. I have had it for about a week and, so far, I am pretty happy. The multimedia functions of the phone are great. Music, video, photos, slide shows, etc. I have to say that the photos are only good in the best conditions. I was dissapointed that the camera was not nearly as sharp as my very tiny, 2.0mp Sony camera. The gallery mode is awesome! The size is pretty nice. It is almost the exact dimensions of a SLVR (but twice as thick). The biggest issue is that I still get those annoying 'out of memory' warnings that I got on my 6682. This is with all applications closed and plenty of room on my phon and SD card. What is going on Nokia? If you are a fan of the Symbian OS and you want to carry one device that will do photos, music, internet, video and, oh yeah, a phone... This is a good choice.. Pros: Size Multimedia Pretty Good Camera Great Screen Stereo speakers Lots of Symbian apps Cons: Memory errors. earpice volume could be louder Nokia Pop-port connector ( I am not a fan)"}, {"rating": "5", "user": "-", "raw-text": "I got his products 2 days ago and i m not quite satisfy with it s performance. 1) This device do not support SDHC. I bought a 4GB mini SDHC and it is not compatible with this device. It shown memory card is corrupted. 2) The # key do not work as it s design to be. It doesn t swap between silence and pre-determine profile. 3) The cancel button quot;c quot; is not that ergonomic to use and the button is too small. That is hard to use the quot;c quot; while you are typing a message. 4) The headset phone is not loud enough. The camera performance is very good. However, the rotate function do not work as it is designed. The delivery take too long. I order this at 4/25 and I only receive this device on 5/19. It take almost a month. Overall, I m not satisfy with this product."}, {"rating": "5", "user": "-", "raw-text": "I got the N73 a few weeks ago and thought it was a great phone. First and foremost is the battery. It lasts a very long time. Calls, text, mms, internet and it goes and goes. I had gotten used to charging my phones every day to every other day. The N73 can go 3 days easy wit med/heavy use on a charge. Second is the camera. The best shots I have ever seen on a phone. Auto focus is great. No blurry pic's and the flash gets it right. Here is one reason I picked the N73 over the D900. I have a 2 and 1/2 year old. Hard for her to stay still for a picture. The shutter lag on the D900 always made the shot blurry. On the N73, even though both phones have autofocus, the N73's shots come out clear and crisp. Can't figure out why, but the camera is worth the price. As far as Nokia's UI, its near the top of the phone list with Sony. You can do anything with the UI on the N73. Saves pic's to the mem card. Plays MP3's as rigtones, FULL Mp3's not making you cut them down and save to the phones mem, like the D900. I could go on and on. Yes, the D900 is super slim super cool slider phone with a 3 mega pixel camera. But it will frustrate you in a few days because of its limitations. Get the N73, and yes you will feel it bump around a bit in your shorts, but evertime you pull it out to use it, the phone that is. It will be great. The 1 and only thing Nokia missed was leaving out the A2DP BT stereo support."}, {"rating": "5", "user": "-", "raw-text": "Pros: This is a very sturdy reliable phone. It has fantastic features - MP3 player, Radio, 3.2 MP camera - and they all work very well. I have used my phone as a camera many times at weddings and other functions and it has always taken a perfect shot. The phone is very clear when you talk to people and the speakerphone is also very clear. The battery also lasts for a very long time, at times I don't charge mine for a whole week!Cons: The buttons are fairly small, and if you accidentally move the slide to open the camera the applicaton opens then you waste time closing things down.A great phone that will serve you well. I never go past nokia and have had this phone for a long time and don't want to replace it because it has been so good. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: I went with the n73 mainly because all of my past experiences with nokia have been good. The phones set out is simple and easy to use. very customisable. great little music player and FM radio built in, along with a voice recorder. I would have to say my favorite feature is the built in 3.2 mega pixel camera with Carl Zeiss optics. It takes great shots in all environments.Cons: can't say I've found any. I've had the phone a good few months now and it hasn't skipped a beat.I'd have to say I've been really happy with this phone so far, haven't had any problems at all! The battery life is good. The size and look of the phone are nice. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: it's a feel good phone. you could everything on this phone that i could even edit my documents on it! i also had a 2gb memory on it and I had downloaded songs on it and it sounds wonderfully! the web browser's great. the quality of the pictures are so exciting. thanks to it's megapixel camera. i just really love the way it works!Cons: nonesofar!"}, {"rating": "5", "user": "-", "raw-text": "Pro's Nice Camera Fast EDGE Sweet Browser Battery lasts a long time. Con's No US 3g, only 2100mhz Headphone volume could be louder No A2DP I have the N73ME, have had it for several months. I like the symbian operating system. While I miss the touch screen of my pda, this is a great phone. Calls sound good, not land line good, but good. With moderate use, the battery will last for several days. You can add apps like gmail mobile, mobile maps, shozu, and fring. The upload feature allows you to upload pictures directly to flickr. The music player is nice, but you don't have A2DP for stereo bluetooth. The headphone volume is just loud enough, but in noisy situations you may wish to have headphones with their own volume function. It's a great buy!"}, {"rating": "5", "user": "-", "raw-text": "After researching several phones, even considering an iphone, I realize that I wanted to have a phone that doesn t obligate me to use functions that I do not find too important to have in a cellphone such as checking my email instantaneously or browsing the internet excessively or using a GPS program or whatever. The Nokia N73 does allow be to do all that but since it is an unlocked phone I have no obligation to be signed up for such services. To be more specific about the actual phone, I am really fond of the phone s sleek look and design. Since I do love taking pictures, the phone is excellent in taking very high quality pictures as opposed to a typical pixelated cell phone picture as well allowing me to have manual control over the exposure of pictures. It has great reception and unburdening due to its size. It s very user friendly in terms of its ability to handle both PC and mac programs. One down side about the phone but it seems not too much trouble at all for me is the fact that it takes a second or two to go in between programs when they are running at the same time. However, I ve always liked Nokias because they withstand the test of time and their very user friendly and the designs display good aesthetics. If you re into a phone with a simple display and enthusiastic to take great pictures then the Nokia N73 is a wonderful choice."}, {"rating": "5", "user": "-", "raw-text": "Pros: Excellent 3.2 MP Camera, Symbian S60 features, Quick Office, Great Internet Browser, Bluetooth 2.0(faster), Firmware updates, Good battery lifeCons: Phone gets slow on usage, Average focus, Files take up huge amount of memory.The S60 features are great, and the battery is great, as mentioned above. There are quite a lot of applications and games available for this good-looking camera phone. The reception of signals is..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Carl Zeiss camera is what you need. 3.2 mega pixel and some great camera features available like sport,night mode,sequence capture etc. Good memory space . There are many office related feature available like word,powerpoint etc. You can hear to Fm also and there is a voice recorder also.Cons: It has the same problem that most of the big phones have it freezes a lot.A good buy . Its a phone for all types and ages of people . A good auto focus and zoom camera kills the need of a digital camera. The battery also does not run out fast. ..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Camera. Software for PC. Expandable memory.Cons: It takes a while when changing from playing music to phone/camera.The expandable memory is excellent. You can plug in a large amount of memory for songs or even tv shows if your bored at work. The software seems to work well when you have connected it to your PC to..."}, {"rating": "5", "user": "-", "raw-text": "Been using this phone for 2years now and the only problem I have is the camera's slide and lack of wifi... everything else is awesome. Tried to match and compare this phone to other high end phones because I'm looking for a new phone, but N73's feature is still good... In the Philippines where everything is changing according to the trend, N73 is still flowing with the newest trend... cons slide of the camera is not activating if it's old // joystick pros everything. especially the camera..."}, {"rating": "5", "user": "-", "raw-text": "After months and months with Windows Mobile Devices, I switched back to a Symbian platform,and I am very happy I did. The stability of Symbian is a refreshing change from freeze-ups and reboots, and hard resets. Acknowledging that there is NO perfect OS available, I would rate the Symbian OS one of the best on the market. I purchased mine (N73-ME-Black) from Phonesource.com, and I am extremely pleased. PROS: Great RF, Nokia, \"You think\" Beautiful and very large screen-QVGA-very bright and crystal clear The handset is light and easy to grip, and feels very solid Battery is typical Nokia, it \"loves you long time\" The keys are a very firm and have a nice click to them when pressed Nice joystick, easy to use and very responsive Internet is super fast, although not 3G, you really do not notice Bluetooth is good, no issues so far Camera (3.2MP) is the best feature, almost too good to believe on a phone. I have heard many people say that is not important, and that is fine. Use this camera and then tell me that!!!!! It is just as good as my 5MP Canon Camera. Music Player is 2nd best feature, with stereo speakers on the top and bottom, the sound is as good as any ipod I have seen. CONS: No 3G, I love 3G No WiFi, not a problem Nokia Pop Port-wow-the evilness of proprietary hardware This is another great Nokia product, and for people that are looking for a business phone first, with good PIM exchange and fast e-mail, this is much better then a full blown Pocket PC!"}, {"rating": "5", "user": "-", "raw-text": "Ive had this phone for a few months and it was great. the only thing is it turns off once in a while, randomly, so i sometimes don't get calls or messages. I have no idea what it is, i updated the software, rebooted my phone and got it back to factory settings but it doesn't work. I also know some people have the same problem but, i don't care because it is soooo good. Pros: Amazing Camera Good music volume side buttons not confusing Good lighting in screen Sleek and professional Cons: Mini SD Feels kind of cheap Front camera is bad (like all phones) The software problem"}, {"rating": "5", "user": "the", "raw-text": "Pros: Clear Reception; DurableCons: Difficult ControlsThis is a great phone any of those who use it will be profited greatly. Believe me, it's the best thing since the Television. I could'nt have made a better decision in choosing this phone. So don't make the mistake of not buying this phone. I still can't believe how great of a deal I made. I just wish it had bigger and better buttons. Nokia has created a great invention once again. Plus, Derek Jeter, and Alex Rodriguez have theses phones. Take this into consideration."}, {"rating": "5", "user": "-", "raw-text": "I had a blackberry pearl and there was a $19.99 monthly for the data and email plan, now with the Nokia N73 I pay $5.99 for the T-mobile Web. It s a great deal! The phone has much better reception than the blackberry pearl, and is more reliable. The only thing missing is a select option and a copy paste option."}, {"rating": "5", "user": "Dutt", "raw-text": "I've had my new N73 for about 2 weeks now. The phone visually and functions wise is a dream. The camera is brilliant, the sd card storage is great(I splurged and got a 2 gigÖwell worth it). The multimedia player(s) are brilliant. The screenÖfantasticÖIíve seen iPodís with the same res. Unfortunately, Iíve had it back to Nokia Care 3 times now with hanging icons problems, jammed / dropped call problems(apparently due to ěcorrupted contactsî but their not so sure) and a few other issues. I had similar problems with my 6230 when I got it for 6 months before they were all finally sorted out. Iím willing to hang onÖthis is a top phone but Nokia really need to spend some more time on R and D to make the experience that more reliable for their customers."}, {"rating": "5", "user": "-", "raw-text": "Pros: Good camera, Symbian OS (you can install lots more games and apps), Nokia, great screen, new multimedia viewerCons: Viewing photos is slowMy last few phones have been Nokia phones and I always prefer Nokia to other brands. When I upgraded to this phone I found the camera to be very good especially because it has a cover so you can..."}, {"rating": "5", "user": "-", "raw-text": "Pros: good size and good weight - feels solid. Runs Symbian operating system (i think it's series 6 version 3) so you can manually install third party programmes and applications as you desire - and store it on the memory card (expandable) also.Cons: Sometimes runs quite slow if multiple apps open. keypad is a bit tight and less suited to those with larger hands/fingers...One of the best digital cameras I have ever used on a phone, with zoom and auto-focus lens - with this camera phone, you actually almost don't need to be carrying a digital camera around with you..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Always had Nokia before and was very happy with all my previous phones.Cons: It keeps freezing all the time. Most of the time none of the letters work therefore I can hardly message.All my previous phones have been Nokia and I was very happy with all, however, this phone is just useless. I had it for repairs 3 times and then my warranty has expired so now i have to buy another..."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to use, toughCons: slowI have to say that my nokia has suprised me from being run over by a mitsubishi delica 4x4 and keep working. As far as speed with getting to each page it is very ordinary spped wise but the graphics..."}, {"rating": "5", "user": "-", "raw-text": "Pros: I'd have to say I've been really happy with this phone so far, haven't had any problems at all! The battery life is good....and it's the greates thingCons: nopeI'd have to say I've been really happy with this phone so far, haven't had any problems at all! The battery life is good....and it's the greates thing ..."}, {"rating": "5", "user": "-", "raw-text": "I own it for a couple of months and I can say it's great!!! I updated it to ME new version getting the great music player, PTT and i have AD2P!!!!!! the symbian s60 works perfectly and i wouldn't change it"}, {"rating": "5", "user": "-", "raw-text": "Hi, I give this phone a perfect 5 out 5 for the following reason: Picture quality is as good as my digital camera. The phone has dual stereo speakers so its very nice waking to the alarm in the morning Sound quality and speaker phone quality is the best, and I've used alot of phones... I also have the N80 and I would def. rate this higher CONS: NONE"}, {"rating": "5", "user": "-", "raw-text": "so I waited a month to use and abuse to the phone before I do a complete review... First off, I think this is the best phone I have ever owned and I've gone through ~100 phones, including all the high-end N-series The reception on the phone is incredible The speakerphone blows any phone including the motorola phones that nextel puts out. I love the broswer(same as all the other N-series) With a few extra software installations, I don't even take my laptop to work/school (I also bought a wireless bluetooth keyboard) The batter life is very good The only Con I can think of is because it is fairly new, Nokia hasn't put out a completely bug-free firmware"}, {"rating": "5", "user": "-", "raw-text": "Pros:Complete phone, great look, awesome camera, good sound quality Cons:Lack of Wi - Fi, sensitive joystick After completing my second year of graduation, I was eagerly waiting to buy this phone as it was quite popular among my friends. Two years have passed since I bought my dream phone. It has been working very perfectly as it…"}, {"rating": "5", "user": "-", "raw-text": "Summary: this phone is a good all rounder. The camera and MP3 player aren't the best on offer, but they're good enough to substitute the real thing."}, {"rating": "5", "user": "-", "raw-text": "Pros:Reception - Computer Interface - Camera Cons:Power Supply seems weak (mini micro tiny plug.) I was a little worried about spending close to $300 on a phone that can be…"}, {"rating": "5", "user": "-", "raw-text": "Pros: This is a very sturdy reliable phone. It has fantastic features - MP3 player, Radio, 3.2 MP camera - and they all work very well. I have used my phone as a camera…"}, {"rating": "5", "user": "-", "raw-text": "Pros: I went with the n73 mainly because all of my past experiences with nokia have been good. The phones set out is simple and easy to use. very customisable. great little music player…"}, {"rating": "5", "user": "-", "raw-text": "Pros: Excellent gaming, Good sound clarity, Support for many apllications, and the SYMBIAN OS... ... Cons: Sluggish performance... From the first days for which…"}, {"rating": "5", "user": "-", "raw-text": "Pros:The camera Cons:Small keypad I decided to purchase the Nokia N73 after my brother-in-law recommended the phone to me. I have used Nokia phones in the past…"}, {"rating": "5", "user": "-", "raw-text": "I have to say the N73 has a lot of useful features, and the 3MP camera takes very good quality pictures for a phone. However the phone is SLOW. There is a delay"}, {"rating": "5", "user": "-", "raw-text": "Pros:ITS HAS A HIGH CAPACITY MEMORY UP TO 2 GIGABYTES. Cons:ITS HEAVY AND BULKY. N73 PHONE IS A VERY GOOD KIND OF CELLPHONE , YOU CAN USE IT FOR INTERNET BROWSING IF YOU HAVE OPERA MINI APPS.…"}, {"rating": "5", "user": "-", "raw-text": "Pros: Camera. Software for PC. Expandable memory. ... Cons: It takes a while when changing from playing music to phone/camera. The expandable memory is…"}, {"rating": "5", "user": "-", "raw-text": "I am writing this review after my kind friend let me test-run it for a week because I am due to upgrade on my o2 contract. The camera quality is exceptionally good…"}, {"rating": "5", "user": "-", "raw-text": "Pleased with the Nokia N73, could be faster with better cover and larger keyboard. Could be smaller. But if you like smart phones I believe this is one of the best.…"}, {"rating": "5", "user": "-", "raw-text": "Pros: Carl Zeiss camera is what you need. 3.2 mega pixel and some great camera features available like sport,night mode,sequence capture etc. Good memory space…"}, {"rating": "5", "user": "-", "raw-text": "Pros:very easy use Cons:Very slow to browse I've bought this phone last year and it's very nice and reliable. It has many features like being a mobile phone, mp3…"}, {"rating": "5", "user": "-", "raw-text": "Pros: good size and good weight - feels solid. Runs Symbian operating system (i think it's series 6 version 3) so you can manually install third party programmes…"}, {"rating": "5", "user": "-", "raw-text": "Pros:- not so expensive for the benefits- cost x benefit- camera Cons:- cannot be considered a smartphone;- fragile keypad;- slow processor; I bought this phone around may 2008. In one month the…"}, {"rating": "5", "user": "-", "raw-text": "All in all its been a good phone. Fit a big memory card and you have a one stop solution when going on holiday,only one charger to pack and you got a phone"}, {"rating": "5", "user": "nathani", "raw-text": "Too many mechanical problems with the Nokia N73, although good music and music output`but slow to function in many ways."}, {"rating": "5", "user": "-", "raw-text": "Pros: Good camera, Symbian OS (you can install lots more games and apps), Nokia, great screen, new multimedia viewer ... Cons: Viewing photos is slow My last few…"}, {"rating": "5", "user": "-", "raw-text": "This phone has been in for repair two times. The firmware has been updated twice - this has made no difference to the slow response times. The phone hangs while…"}, {"rating": "5", "user": "-", "raw-text": "I used to have a 6230 and 6230i so this is a major improvement. Just wish it was a bit quicker and had a better flash. Although I do all my file transfers through…"}, {"rating": "5", "user": "-", "raw-text": "Had the N73 for 9 months and HATE IT! This Phone really looks the biz. Has a lot of features to play with. BUT! Can't understand why it has such a large screen when it…"}, {"rating": "5", "user": "-", "raw-text": "Generally the Noika N73 is a really good phone with a lovely big screen.:D However, I find the phone is often slow, and I have a problem with the background.…"}, {"rating": "5", "user": "-", "raw-text": "Of all the Nokia Nseries I would say that this is the most practical to use and very hand. It has all the features that you need without really being overly too…"}, {"rating": "5", "user": "-", "raw-text": "Not impressed with the Nokia N73 at all. The phone has been trouble since the first month I had it. It has been in for repair on 5 occassions. It turns itself…"}, {"rating": "5", "user": "-", "raw-text": "The N73 is great because of its features but some of its features make this product complicated to use."}, {"rating": "5", "user": "-", "raw-text": "Pros:everythin is pro about it Cons:no cons for this revew it is a fantastic phone What did I expect when i first got this phone a great phone is what I…"}, {"rating": "5", "user": "-", "raw-text": "Pros: Always had Nokia before and was very happy with all my previous phones. ... Cons: It keeps freezing all the time. Most of the time none of the letters work…"}, {"rating": "5", "user": "-", "raw-text": "this product is very good but this web site is not so fast please make it fast and you are a raskle."}, {"rating": "5", "user": "-", "raw-text": "The Nokia N73 has 3.2 mega pixel camera 262k colour. However the screen freezes the joystick comes out few months later and the chrome keypad just came off as well…"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to use, tough ... Cons: slow I have to say that my nokia has suprised me from being run over by a mitsubishi delica 4x4 and keep working. As far as…"}, {"rating": "5", "user": "-", "raw-text": "Good phone in the first few months..no problems everything works perfectly. Then its really annoying after a few months everything goes wrong...cant send text…"}, {"rating": "5", "user": "-", "raw-text": "Ok first of all let me start by saying my phone 2 grades down from this beats this any day! For a start you cant change snooze???? It is in 5 minute intervals. There's no auto…"}, {"rating": "5", "user": "Farmer", "raw-text": "I have had the Nokia N73 for a while, great little thing wont be giving it up yet. Has had the odd seizure but nothing to life threatening."}, {"rating": "5", "user": "-", "raw-text": "Pros: I'd have to say I've been really happy with this phone so far, haven't had any problems at all! The battery life is good....and it's the greates thing I'd have to say…"}, {"rating": "5", "user": "-", "raw-text": "This Nokia N73 phone has caused nothing but hassle. It s gone from constant error connection to not dialling out at all and now people on the other end of the…"}, {"rating": "5", "user": "-", "raw-text": "The N73 is a top phone. It has every feature you can imagine and some you can't."}, {"rating": "5", "user": "-", "raw-text": "I would recommend this phone to others but rather recommend other better ones. I like using this phone and playing music on it, I haven't had the phone for long…"}, {"rating": "5", "user": "-", "raw-text": "The Nokia N73 is the worst piece of junk I have had. Camera great but I bought a phone with a secondary camera. AS A PHONE THIS MACHINE IS A PIECE OF JUNK."}, {"rating": "5", "user": "-", "raw-text": "Cheap horrible phone. I haven't had a nokia for ages and this makes me want to steer clear."}, {"rating": "5", "user": "-", "raw-text": "Overall the n73 is perfect"}, {"rating": "5", "user": "-", "raw-text": "Pros: Great screen ....Cons: Hangs, hangs and hangs After 3 phones all with the same faults I have had enough. I was really looking forward to this phone but…"}, {"rating": "5", "user": "-", "raw-text": "I have had the n73 for 2 months now and just after 2 weeks from having it the phone turns itself off when its locked and when making or receiving calls, the phone…"}, {"rating": "5", "user": "-", "raw-text": "Ive just had my phone chipped, so it would take any sim, anyway Im on 02 now and I topped it up with just Ł10 yesterday. Well today, it has no credit so I…"}, {"rating": "5", "user": "-", "raw-text": "Cons: does NOT work with VERIZON"}, {"rating": "5", "user": "-", "raw-text": "I can't complain about this phone. This is a must have. Definitely one of the best in the industry."}, {"rating": "5", "user": "-", "raw-text": "Have had total of 8 phones and returned 4. so 50/50 % chance of getting one working without faults."}, {"rating": "5", "user": "nl", "raw-text": "I was very happy with the N73 phone once I got it, but whenever you press a button and scroll around the menu it takes 1 or 2 seconds for it to respond, which can get quite…"}, {"rating": "5", "user": "-", "raw-text": "No, I'm angry now."}, {"rating": "5", "user": "-", "raw-text": "Best brand for GSM phones. The phone is really great and also buy.com is the best online shopping site i have ever used."}, {"rating": "5", "user": "-", "raw-text": "This phone is amazing there are no other words to desctibe it!!!!!!!!!!!!!"}, {"rating": "5", "user": "mccloskey", "raw-text": "Folks If your software is hanging up your phone, freezing etc you may decide to get a software upgrade directly off the Nokia website, there are a number of…"}, {"rating": "5", "user": "-", "raw-text": "i had 2 n73,s now and had a few problems, just the 1st one kept turning off i think it was the software, and if my phones settings are on 3g it wont call out…"}, {"rating": "5", "user": "-", "raw-text": "buy it =)"}, {"rating": "5", "user": "-", "raw-text": "Got n73 last week well impressed a lot faster than n70 pictures outstanding only problem will not take any software from n70 only downfall have had no problems…"}, {"rating": "5", "user": "-", "raw-text": "I am using Nokia N 73 since last three years. Though, the performance of this phone is not on the same scale as earlier, but yet I am satisfied with this phone.…"}, {"rating": "5", "user": "-", "raw-text": "The Nokia N80 gained popularity from N73 but the research work done on mobile models tells us as the Nokia's N73 set is far better than Nokia N80. This research…"}, {"rating": "5", "user": "-", "raw-text": "Overall a very good phone but the little niggles are all the more annoying for being so easily resolved."}, {"rating": "5", "user": "-", "raw-text": "I have rung my network who sent me a \"SMS Accelerator\" but this came up as unsupported on my particular handset as it is an 'older' handset. Fantastic."}, {"rating": "5", "user": "-", "raw-text": "Overall, I'd recommend this phone, but if you're one of those who don't have the time for a slow interface and want to have something that stands out from the"}, {"rating": "5", "user": "-", "raw-text": "This was my second N-Series phone after the N70, the first thing I noticed was the incredibly clear resolution, the leap to 240x320 makes a world of difference. The…"}, {"rating": "5", "user": "-", "raw-text": "Nokia N73 is simply the best from Nokia's N series Mobile models. The N73 IS 3G Smart phone with fantastic camera video/picture quality, FM Radio, video calling and of…"}, {"rating": "5", "user": "-", "raw-text": "On the face of it the N73 was the right the phone to choose when I was in the market. It wasn't the uber expense of something like the N95 and it wasn't an entry level or dated piece…"}, {"rating": "5", "user": "-", "raw-text": "When I received calls on my second one, nobody could hear me. My third one took 2 mins to open a text message, froze in the middle of tasks, overheated when"}, {"rating": "5", "user": "-", "raw-text": "I think the Nokia N73 is a good phone with sound and picture but battery seems too stretched to meet it large screen."}, {"rating": "5", "user": "-", "raw-text": "Outstanding features, camera result is the best as compare to other sets relative to these. I will always recommend you to buy N73. Its a symbian and supports…"}, {"rating": "5", "user": "-", "raw-text": "I have so far had 3 replacement handsets since I upgraded in February 2007 and I am tied in to an 18 month contract. The first phone I had for 40 days and the joystick broke off.…"}, {"rating": "5", "user": "-", "raw-text": "Had the N73 since January 07 and apart from it being a bit expensive I have loved using this stylish phone with loads of features. One tip: make sure you keep the…"}, {"rating": "5", "user": "-", "raw-text": "I wonder how it happens but I ask almost all the cellphone technician about this problem and there is only one solution for this.."}, {"rating": "5", "user": "-", "raw-text": "I feel great to have Nokia N73. Nokia is simply great and the online 3G shop - 3mobileshop.co.uk is also great they gave a great discount."}, {"rating": "5", "user": "-", "raw-text": "I got the Nokia N73 phone for free on an upgrade. I did a bit of research and went for it, I wanted something with smart phone capabilities, and liked the idea of the…"}, {"rating": "5", "user": "-", "raw-text": "Never buy this phone i can just say not worth paying so much for this phone."}, {"rating": "5", "user": "-", "raw-text": "overall good, i currently use 1, have been using the Nokia N73 for 2 years now, and it's the second new 1 , the 1st 1's joystuck stopped working after 6 months,…"}, {"rating": "5", "user": "-", "raw-text": "I got the Nokia N73 series phone and for the first few days the phone was something I could not do without, but latter the phone started developing faults ie…"}, {"rating": "5", "user": "-", "raw-text": "I had this phone since December and it takes few seconds to load after its switched on and switches itself off even when its charged fully. It is a nightmare,…"}, {"rating": "5", "user": "-", "raw-text": "The Nokia N73 is a very good phone."}, {"rating": "5", "user": "-", "raw-text": "It rocks big time... better get one for yourself soon... don't miss it."}, {"rating": "5", "user": "-", "raw-text": "All the negatives ive heard of for the N73 have happened to me, (though i've just fixed the main one) but i've also benefited from all the positives it has to…"}]