[{"rating": "5", "user": "-", "raw-text": "Pros: Stunning picture for the price!Cons: Internet setupI was shopping before Thanksgiving for a bigger TV for my living room even though I didn't need one (don't tell my wife). The living room TV was a six year old (second gen) 50\" LG plasma. I've been a plasma fan ever since. The LED's are bright and thin but in my opinion they do not have near the depth in picture as a plasma (& are overpriced).After a lot of research I concluded that Panasonic was the only way to go considering they have won many awards in the past for plasma TV's. I was set on the Panasonic 65\" VT30 which was $2500 before Christmas but then began looking at price vs. features for the $1300 60\" S30. The only difference between the two was a 3D picture and obviously the size. I really do not care about 3D because of having to wear glasses. However the $1200 price difference was the biggest decision. I\"M EXTREMELY SATISFIED with the 60\" S30! I purchased the TV in time to watch all the college bowl games with it's crisp and clear picture. Watching blue ray movies is the best by far b/c of the excellent picture. It's just like being at the theater! I haven't used the TV speakers and sure that most people do not. The only trouble I have is getting the internet connected but just use my new blue ray player for streaming Netflix. Overall I can't be happier with my purchase and hope this review will help someone."}, {"rating": "5", "user": "-", "raw-text": "Pros: Stunning picture for the price!Cons: Internet setupI was shopping before Thanksgiving for a bigger TV for my living room even though I didn't need one (don't tell my wife). The living room TV was a six year old (second gen) 50\" LG plasma. I've been a plasma fan ever since. The LED's are bright and thin but in my opinion they do not have near the depth in picture as a plasma (& are overpriced).After a lot of research I concluded that Panasonic was the only way to go considering they have won many awards in the past for plasma TV's. I was set on the Panasonic 65\" VT30 which was $2500 before Christmas but then began looking at price vs. features for the $1300 60\" S30. The only difference between the two was a 3D picture and obviously the size. I really do not care about 3D because of having to wear glasses. However the $1200 price difference was the biggest decision. I\"M EXTREMELY SATISFIED with the 60\" S30! I purchased the TV in time to watch all the college bowl games with it's crisp and clear picture. Watching blue ray movies is the best by far b/c of the excellent picture. It's just like being at the theater! I haven't used the TV speakers and sure that most people do not. The only trouble I have is getting the internet connected but just use my new blue ray player for streaming Netflix. Overall I can't be happier with my purchase and hope this review will help someone."}, {"rating": "5", "user": "-", "raw-text": "Pros: Size and pictureCons: Still calibrating the displayI decided on this Plasma after doing alot of reseearch online. It was a consumer reports recommended buy in November/Dec 2011. While the picture does not pop like LCD displays I appreciate the softer and more natural looking picture it delivers. HD Cable and Blu-Rays look fantastic. Football games show no blurring. I have only used a surround sound set-up since day one so I cannot comment on the TV speakers. Theonly thing that keeps this TV from getting a 5 rating is that sometimes it flickers. Some bright displays flicker to a darker screen. It is quick but you do notice it. It seems more prominent on things like basketball highlights. Some days/shows you don't see it at all. It may be some type of auto contrast setting that I will play with as I tweak the calibration. Beyond that I love this 60 inch plasma for the price. I have a Blu Ray with built in WiFi so this TV not having internet capability was not an issue."}, {"rating": "5", "user": "-", "raw-text": "Pros: Movie Theatre ExperienceCons: Soung qualityIn summary:This TV offers a \"Movie theatre screen\" like experience, which once ppl actually look at it will know what I mean. Many reviewers who give negative comments towards how dark it looks just bought the wrong TV. If they want a brighter screen/lighter colors, they should go buy an LCD/LED.Actual use:Movie buffs and Bluray addicts will LOVE this TV. Truly a theatre like experience in the home. The Graininess ppl talk about gives the image a \"pull down screen\" effect, again like in the theatres (some like this, some dont). Playing games look great with very little to non-existent motion blur, but is not recommended as its main use (even with the burn in prevention/solutions they have built in now). Watching sports will offer deep/dark colors, games at night may at times be hard to see the background (especially in baseball, but the clairty of the players is amazing).Features:"}, {"rating": "5", "user": "-", "raw-text": "Pros: picture quality, sizebought this TV for an absolutely incredible price. got it delivered the day before superbowl.Having bought a panasonic TC-P50X1 plasma 2 years ago from BB, I knew plasmas had a great picture. I never liked LED/LCDs since the picture washes out if you're not exactly in front of the TV. I see that on all LED TVs at all screen sizes. The X1 always amazed me with its beautiful picture though it is a low end model. Now its going into the bedroom. The P60S30 didnt disappoint either. It's picture is beautiful and B-I-G. Sound is average; I use the TV speakers for Uverse, and home theater for bluray/dvd. I noticed with some channels the speakers crackle slightly if the volume is raised beyond 40, but thats a minor issue IMO. Here are the settings that worked for me.HDTV (Uverse) contrast +78, bright +58, CATS off, Color temp normal, all others default. REsolution set to 1080i on Uverse box.Bluray: contrast +78, bright +58, CATS off, Color temp Warm 1, all others default.dvd (component): same as blurayI did not purchase the extended warranty since my amex card extends the mrfs warranty by 1 year. At this low price I figured worst case if I get the blinking lights after 2 years, I can decide to repair or replace then. My X1 is more than 2 years old and runs fine; never bought a warranty for that either."}, {"rating": "5", "user": "-", "raw-text": "Pros: Big ScreenCons: Can't get 5.1 sound out of it.Picture is not at all what I was expecting. Honestly it is not any better than my 47 LCD I had before. I cannot tell it being 5X faster and so on. It is bigger that's for sure, but if you want it for \"movies\" or \"sports\", you get what you pay for.I have a major issue with the sound though, I simply can't get 5.1 out from it. It is requiring me to by pass the TV and run an additional cable to the receiver from the source. Not a major show stopper, but very inconvienent to have to bring out the other remotes and switch the source all the time. And guess what, with no 5.1 out VUDU HDX is a wasted effort.Panasonics service so far is dismal. I have called their 877 number 3 times and got no answer other than please wait for a total time of 45 minutes.Panasonic does have something called Viera Concierge though that may be able to service my TV. I have a service request made with them. If they can't get the 5.1 going, I'm taking the TV back for a 55\"."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy of setup and awesome picture!Cons: Nothing...I went in to my local Best Buy looking at replacing an old rear projection 57\" tv. This is such a good tv for the price and it looks great for sports, movies and online gaming. Thank you, Findlay, Ohio store employee Steve!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture quality and sizeCons: Component inputsAs far as picture quality goes, this tv really is pretty good. I hooked my blue ray player up to it and it puts out a great picture. The sound (as on most flat screens) is not that great but if you are watching in a quiet room its tolerable. I will be buying a surround sound system though. Here is the issue. I have a first generation XBOX 360 which originally came with the component hook ups. My XBOX has worked perfectly on every tv I have ever hooked it up to (6 different televisions). When I went to hook it up to the tv for the first time, it would not pick up a signal from either the component input or the audio/video input. I had three people who are a little more technology savvy than I am take a look at it to no avail. When I hooked my Blue Ray player up to it I found that the left speaker was busted (fresh out of the box on the first day that I had it). I currently am on my second television in two weeks and the component cables on this one arent working either. Needless to say I am returning this one as well. Hopefully the third time is a charm."}, {"rating": "5", "user": "-", "raw-text": "Pros: Price, Screen Size, FeaturesCons: Nothing to DateI have always been against Plasma TV's due to the maintainence issues they used to have and always wanted an LED TV since they came out. I bought the Plasma due to the price but also a good friend and avid Best Buy shopper, like myself, bought one a few weeks beforehand and I liked the look as well as the features. It was mainly the price that sold me on the product since but the screen size was also a great advantage. Like I was always told, go big or you will regret it later. I think the picture quality is good for both standard cable and HD cable, though obviously HD is preferred. Have not had much time to mess with all the other features but it has been great thus far."}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture quality is unprecidented...Cons: remote and built-in speakersI don't write reviews of really any electronic purchases that I make, but had to make an exception here. It was time to upgrade from rear projection, and it took me a few conversations to get my wife on board with the thought of a plasma -vs- an LED/LCD, but only one trip to actually see it. And no matter what you see in the store, getting it home and setup is a whole different look. WOW is all I can say, I knew it was going to have a great picture, but the longer we have watched it the better and better the picture gets. These are Pioneer Elite screens... nothing else needs to be said there!!! Sports and movies are nothing short of amazing, clarity and quality are so lifelike it's difficult to explain. We do also have an HTPC attached to this TV as well, and I have been keeping a VERY close eye for any type of ghosting/residual image or signs of burn in and none are evident. We are careful about leaving anything paused for any period of time, but have watched several weekends of football non-stop and no signs of ESPN's marquee exist. DLNA and the streaming are two features I really wasn't \"looking\" for in a TV (we have the Home Theater PC attached), but I must say, we have started to use it more and more recently as the streaming content features work FLAWLESS! And the price... amazing compared to anything else out there!The down side, the speakers are better than I expected, but if you don't have"}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture qualityPros: This is the first Panasonic product I have bought. The menu to set up and control the TV is more intuitive than my Samsung TVs. I rated the sound quality as good as I did not use it much. I was buying this TV for a media room so have a surround sound system providing audio. The picture is excellent.Cons: I would have like 1 more HDMI input, but for the price, 3 is ok."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy set up and BEAUTIFUL picture quality!Cons: Nothing at all!People, please do not pay attention to the \"Buyer Beware\" review. This person said he has owned his/her plasma for 3 years, The Panasonic Tv listed here is a 2011 model. I wish people would pay attention more to what they are posting. Let me tell you that this TV has an absolutely beautiful picture on it after you calibrate the picture settings. Panasonic is rated as the best brand for plasma. Sound quality wasn't an issue for me as I have a surround sound setup in my living room. Don't expect ANY TV to have exceptional sound from it. This TV connects to Netflix, Facebook, Pandora, among others...except Youtube. Nice bonus if you ask me. I found this TV advertised cheaper on another website and BB price matched it! I suggest you try doing the same. I have had no flickering issues. I'm in LOVE with this TV. Don't think twice just get it. Plasma has the best display, LCD cannot compete with it, especially if you like watching sports no jittery artifacts or motion blur. Enjoy it!"}, {"rating": "5", "user": "-", "raw-text": "Pros: The picture quality.Cons: The design.1. The Picture Quality is awesome. It's a Panny plasma, you can't go wrong. If you're a videophile, you would go for the higher end models but I would say it's not too much different. This is a 60, how near do you have to be to your TV? Blacks are blacks, images are sharp, colors are naturally vibrant.2. It's a really good value. I don't need 3d. There's too less content out there right now. You will need a separate dongle for wifi but you can simply attach a LAN cable. It's still a smart TV but if you have a wifi blu ray player such as PS3s, wifi TVs don't have much use.3. The look isn't as pretty as Samsungs. It's pretty dated. But I watch the screen more than the bezel. You don't get a blu-ray disc and watch the design of your tv.4. I don't care about TV speakers. TVs 55 and up are best appreciated with home theatre speakers. I didn't buy a large TV for CNN."}, {"rating": "5", "user": "-", "raw-text": "Pros: 1/2 the price of equivalent LEDCons: Can't lay it down. And picture suffers with low resolution inputHard to buy a TV without seeing it play, but I have not been disappointed. I looked at the floor model 51 inch and then bought the 60 unsight, unseen. This thing is HUGE!! I was looking to buy a new TV which I have not done since 1996 when we got married and bought a 27 inch Zenith analog . I also have a Samsung 42 inch LCD that was given to me as a gift. I was sold on buying an LED, then my father-in-law got me looking at Plasma. I looked beyond the hype and trend and looked at the picture and the plasma for me just looks more natural and definitely better with high speed sports and gaming. Very interesting because he has a new Sharp 60 inch LED. This TV overcomes many of the old plasma problems. It has a new pixel screen which limits the old Glare issues. If you look at a light in the room off the screen, it looks dull and pixel-ed much like an LED screen. It has a built in screen saver which limits chance of burn in. The one thing I would say is that picture quality is definitely related to level of resolution of the input. One HD channel looks great and then the next is not HD and it doesn't look that great. I think it does natural pictures better and I've seen computer generated stuff look a little more clear on LEDs, but again for me it goes back to a natural look. The LED TVs to me look computer generated all the time and when you do through in some computer"}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture quality and quality of TV.Cons: The only thing I am not too excited about but again I am coming from a LED is the weight, a lil heavyOkay well I had a 55 inch LED 1080p 120Hz and looks wise it was great it was paper thin and had smooth touch buttons (which you cannot see) However when it came to picture quality it was ok nothing crazy but bright, the thing that made me look at plasma was when my LED was on something with fast motion I would have tracers or shadows following after the movement. I turned off the smooth motion setting but I still was not impressed. I decided to sell my LED at a great price. Oh and you should probably know that I am very picky with tv performance in the last 6 years I have had 9 different sets ranging from the early Mitsubishi LED projection as welll as 3D DLP, various LCD's and one LED. I had always been very hesitant when it came to plasma due to what I had heard about life span, burn in, and lacking brightness. Well I can say I am absolutely in love with my 60 inch Panny plasma. You need to realize that when plasmas first came out they did not have the technology they have now to stop burn in and did not have the life span they do now. This tv is rated at 100000 hrs before it loses 50% of brightness! That is amazing! I have LCDs that have about 30 to 50k on them and I can honestly say the picture is not what it was new. Any tv can have burn in just so you know and the chances of it happening are very slim unless you are"}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture QualityCons: when in standard picture mode, sporting events brighten and fadeTV Picture is excellent. One weird thing about the TV, when in Standard picture mode, camera flashes during sporting events (especially basketball because of the flash proximity), causes the picture to brighten then fade. It's annoying after a while. Easy fix, change picture mode to sports mode. Plus sports mode looks very nice.Don't know about sound because I use a surround sound system.Overall, I love it so far. Its been 2 months"}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture, Viewing Angle, Size, QualityCons: Placement of HDMI USB portsI took about 4 months to research and look at just about every model and type of TV out there. I have had the television for just about 3 months now. I am thoroughly impressed with this television. The 60inch plasma is the perfect size. Picture is unbelievable, crisp, and brilliant. Whether its watching tv, sports, playing video games, dvd's or blu-rays this tv is awesome. It was a cake walk to set up(by myself) and very easy to hook up all of my components to. Also, just a reminder, I have Direct TV and the cable box wasn't set up to receive 1080i when it was installed, only 480i. Double check to make sure that your cable box is receiving 1080i or you'll obviously think something is wrong with your new tv. At any rate, the viewing angle is phenomenal so there isnt a bad seat in the house. I can't wait to watch the Super Bowl on this thing. The only drawback, and it really isnt one, is that the hdmi, usb component hook ups are on the far right hand side of the back of the tv and not in the middle. It wasn't a big problem, just need to make sure you hjave long enough wires to connect your toys to the tv. This is a terrific tv, and for the price you can't beat it. Best Buy matched Costco's price of $1199.99 too so shop around. A+ television, highly recommended!!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Crisp, clear, vivid picture. Great price.Cons: Needs an extra HDMI, Needs more video menu settings for adjustmentsI just purchased this flat panel on Friday 11/11/11. This is my 2nd Panasonic Plasma, my first been the th50PZ700u. I must say that Panasonic Plasma tv's provide an amazing picture. I would like a better anti glare system as, the tv suffers from glare when light is present. The Tv looks very good on the cinema setting, however it can be enhanced with a Calibration. The black colors appear to be very accurate. The skin tones appear very accurate as well. LED's and LCD's are great televisions as well, however they cannot produce the realism a plasma does. The only benefits I see to purchasing an LED or LCD are the \"Soap Opera\" effect when watching television wih the motionflow or automotion turned on high and the brightness. If you are looking for a great cinematic experience and decently priced, Panasonic Plasma is the way to go. This s30 is Sick!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Stellar Picture and Great Sound, Decent Video AdjustmentsCons: Definitely A Value Model, Average Amount of InputsThis set was purchased as a primary Television used for everyday cable/TiVo watching, DVD/streaming/Blu-Ray watching through a PS3, and gaming through a PS3, Wii, and Xbox360.This TV has a great picture with nice color, brightness, and really good contrast levels. Sports look great on this set with the real estate offered and awesome refresh rates offered by plasmas. HD content looks amazing and even the standard def programming is surprisingly sharp and clear. Audio comes through clear and loud and is better than most comparable models.Inside the menu there is a few basic settings that can be changed to maximize and personalize video/audio preferences. Presets do a decent job at setting a standard and users can feel free to adjust freely to get the best experience for the viewing environment. A few more inputs may be needed for some, but if you have a decent receiver (which is highly recommended) you should have more than enough options for the majority of setups.Anyone looking for a big and beautiful monitor for everyday TV watching, gaming and/or movie experiences will not be disappointed by this set, especially at the going price. Be prepared to feel immersed in the action and feel like you're in some gorgeous environments. If you don't need a top of the line set or 3D and want something awesome at a great price, this is your set."}, {"rating": "5", "user": "-", "raw-text": "Pros: Everything with regards to the screen displayCons: The sound (it's really not that bad though, better than lower end HDTVs)This TV is all kinds of awesome! HD content looks brilliant on it! I haven't seen a better looking picture on a TV anywhere. The blacks are black and the colors are vivid. The menu controls are very easy to use, and I found that simply setting the display to \"Game Mode\" makes everything look great. Sports and action scenes are displayed superbly. I wouldn't use the 3D feature even if this TV had it (in my opinion, either 3D is a fad, or the technology will evolve into something actually worthwhile--but for now it's garbage). And as for the lack of an internet connection, if you really want that, it's probably better to access the net through a laptop or internet ready dvd player (I find using my laptop with a full keyboard much more comfortable). The built in sound quality is ok for someone who doesn't like a strong theater sound. If you turn the volume up too much, it will start to sound a little distorted, but if you're turning it up that high, you probably want a home theater system anyway (good way to use the Reward Zone coupons you got from buying the TV). After shopping around, this was by far the most TV for the money with regards to display size and quality, and after a month with the TV, I couldn't be happier with my purchase."}, {"rating": "5", "user": "-", "raw-text": "Pros: Its a HD-Plasma made by #1 plasma maker: PanasonicCons: Nothing so farFirst off, don't be fooled by how this TV \"looks\" in the store. Factory out of the box setting is STANDARD and doesn't make this Panasonic Plasma shine. Set it to CINEMA (perfect) or VIVID (more LCD like) and throw in a Blu Ray and drool. Of course, plasma TVs work better in dimly-lit rooms (not in over-lit rooms/stores). This Panny has a 600HZ refresh rate, so NO motion blur like on some LCD's (sports like: NBA, NHL, NFL, MLB look just amazing on this Panny Plasma). In my honest opinion (and most other videophile's opinions) a plasma HDTV is far superior to a LCD or LED-LCD in many ways. Plasma's are FASTER, have a more \"true to life\" picture (not hyper-reality/over saturated picture like most LCD/LED-LCD's) and have a WIDE viewing angle perfect for rooms that people sit off to the sides. I don't like the way over-bright look of a LCD, it's just not natural looking.....people's clothes should NOT glow.Sound quality? Well, if you are shopping a 60\" plasma or LCD, you most likely have the scratch for a surround sound system......but the speakers that are built in are decent........to pretty good.No, it's NOT 3D......that's a good thing for me. I don't like 3D, it hurts my eyes and I don't buy into all the hype of it either. Just give me a Blu Ray and this Panny Plasma and I am good to go. I love this TV.Shop around for price, HDTVs are falling faster than a brick in the water......got mine for"}, {"rating": "5", "user": "-", "raw-text": "Pros: The size, picture quality, and priceCons: Not muchAfter owning a Pioneer Kuro Elite (and parents with a Panny Z1, and VT20), It was time for a 60\". The picture looks great, it does not have the extra pane of glass so there is no reflection issue, and It does NOT have 3D (thankfully). With this TV there is a very good picture with the features I like while not having to pay for the ones I don't. It might look a little washed out/grey under the bright lights in the store but when it is in a house, wow it looks good. With this model I am not longing for the next model higher as this looks great. The sound needs to be adjusted with treble way up and bass slightly up to give more than adequate sound (as good as any other panel TV in the market), but they are only TV speakers, don't expect them to immerse you in 5.1 surround. If you are in the market for a 60\" with a great pic without all the bells and whistles, this ones for you!"}, {"rating": "5", "user": "-", "raw-text": "Pros: huge screen sizeCons: the \"smart\" tv applications aren't that greatI had one issue with the TV's audio not recognizing my blu ray player's output, but after several stops and restarts the problem hasn't recurred. (this was after I had set it all up and it'd been working fine for about 2 weeks)Other than that I love this TV! The screen size is huge (obviously) and my movies (blu rays) look great on it. My normal cable is finally annoying me so I'm getting HD in a couple weeks and I'm sure it will look great!I also purchased the internet device that connects with the TV. I like that it will allow you to connect to your pictures on your laptop, but I wish it would allow you to fully connect to your laptop. I also wish it would allow you to access an internet browser. Pandora works great, however my Netflix stops every couple minutes (when it doesn't with the same internet connection on my laptop) so that's annoying. So I'm not that happy with this TV as a \"smart\" tv."}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture, priceCons: SoundSaw this in the BB ad leading up to Super Bowl. Have a Samsung 50\" Plasma that is 9 years old and still working great, but admit I was curious about the features and the low price drew me in. One hour later I was pulling my SUV up to the front of the store and took this baby home that night!The setup was super-easy. I added a Panasonic blu-ray player and Panasonic sound bar (it's worth the extra $$) and I couldn't be happier!The picture quality is great. The sound is ok (like all other posts have said) but the soundbar adds just enough umph that you need in your family room!Couldn't resist the Best Buy price of $899 and so far-I'm glad I bought this TV!"}, {"rating": "5", "user": "-", "raw-text": "Pros: ease of getting it set upCons: connections on the far right v centered ... had to adjust other equipment positions and or get a longer cordI have probably read 300 or more reviews on this product, some relevant some not ... This is a set for serious viewers who have a complimentary Home Theature system to go with it. Taking it a step further, while connectivity with a variety of brand names is easy, it is a snap plus when coordinating this product with other Panasonic components. I say for \"serious viewers\" because a) the picture preferences are a personal matter and b) taking the time to fine tune the picture to your liking is well worth the time ... but only serious people do that ... yet once done this is an awesome product The picture is rich ... and the dark tones in some types of programing can be, well, dark ... but what I have found is customizing different settings (vivid, game, custom, standard) for different types of programs so if a particular show or program 'picture' is not to my liking, in 3 clicks it it set up to my preferences. My first few days I switched a lot and tweaked a lot ... but now have a customized setting that is solid for sports to hd channels to dvd and bluerays ... so not much picture swapping lately. Sports on a plasma can't be beat. I find for the room size, the 60 inch is perfect and have noticed details in some movies/programing that I never noticed before. Hook up was a snap, internet and all and even looking at pictures stored"}, {"rating": "5", "user": "-", "raw-text": "Pros: Attractive Design; Great Picture Quality; Good Remote Control; Good Resolution; Reduced Glare; Energy Efficient; Fast Setup; Great Sound QualityJust purchased this model today. Very easy to set-up, took about 10 minutes. Made few adjustments to the picture from default settings, and picture is great, very clear with satellite. Colors are excellent. Panasonic plasma screens have less glare than other brands, only slightly more glare than a LCD/LED tv. Salesman was very informative describing features of various brands and models, and did not \"steer\" me to specific brands or higher end models. I stated what price range I was looking at, and he only showed me the models within that price, and described the features of each brand and model. Overall a good experience and I am happy with this tv."}, {"rating": "5", "user": "-", "raw-text": "We use our plasma to watch television programs and occasionally Blu Ray movies. The picture is bright and beautiful. The sound is nothing special, but we plan to purchase a stereo in the future to bring us a real home theater experience."}, {"rating": "5", "user": "-", "raw-text": "As an avid football fan, I LOVE this TV... Picture is incredible and hooked up to surround sound... Amazing experience... Oh movies are really good also... Would highly suggest"}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture, Size, PriceCons: NothingFirst of all, plasma TV's are the best TV's on the market (the only argument to this statement is if your room has a TON of light in it, even then it is still not much of an argument). Anyways this TV has amazing color and detail in every single frame of every single thing I have watched on it. The picture quality is superb! I have read other posts on here about the sound of the TV, my only question is why would you not have some type of surround sound if you are buying this TV?! aka the speakers on it are irrelevant.The price on this TV is also awesome. Look at other 60\" TVs, crazy expensive compared to this one."}, {"rating": "5", "user": "-", "raw-text": "Pros: Superb picture quality!Cons: Glare?After reading reviews and analysis from CNET, PC Mag, and mostly Consumer Reports, it now seems clear that Plasma technology has surpassed LCD and LCD+LED in overall performance. I was very hesitant to purchase a plasma but, now that I have I don't think that I will ever regret it.The only draw backs listed against plasma were glare from the glass screen and hefty power usage. The glare issue really seems to be a non-issue now that I have seen it for myself. Also, I do not feel like $20-$30/year in electricity usage should be a serious factor in someone's decision about what TV to get.In summary, colors are vivid, motion is 100% blur-less, and no artificial \"pixilation\"/washout occurs if you don't have your picture settings on \"Vivid.\" Read the owner's manual to understand how to adjust picture settings."}, {"rating": "5", "user": "-", "raw-text": "Pros: Big, clear and crisp pictures with 600 HZ refresh rate / PriceCons: Internet WiFi adaptor needs some work.I had origionally purchased a Sharp LED TV, which I traded in for this Panasonic Plasma. The LED's picture was noticably better in the color, clarity and brightness than this Panasonic Plasma, however the refresh rate on the LED was only 120Hz and made watching sports and action movies unbearable because of the motion blur. This Plasma keeps up with the action shots very well and has incredibly rich and smooth blacks in dark movie scenes.The apps on this TV are nice additions and fun to have at your remoting fingertips, however the WiFi adaptor that you must purchase seperately has fairly weak reception power. It took several attemps to actually link up to my wireless (cable internet) router's full-bar-signal. I enjoy using the Netflix Application on the TV instead of using my Wii because the movies available in HD are displayed in full High Definition. The problem is the constant buffering throughout a movie because of the inadeqate WiFi adapter that connects through the USB slot."}, {"rating": "5", "user": "-", "raw-text": "Pros: price/ picture qualityCons: not muchThis tV has served me well for the 3 months I've owned it. Panasonic Plasma is the way to go for most vivid colors and dark darks.Would defintely recommend. I only gave a good rating on sound because I use my bose system for surround"}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture QualityCons: Sound could be a little richer.First bought an 55\" Aquos LED - had to bring it back because of TERRIBLE picture quality. Replaced it with the Panasonic Viera plasma that was almost $350 cheaper and 60\" and couldn't be happier. The images are so rich and the HD is amazing. The sound is good but for movies we have it hooked up to the Bose. A beautiful television and I was nervous about plasma but absolutely love it!"}, {"rating": "5", "user": "-", "raw-text": "I bought this tv last night in store. The tv was on sale for 899$ but lucky me this item is going to be deleted by best buy and they were sold out so I got the display model for 873.26$. That's including tax. So do what I did and get the display model if you want to save a bunch of money. Overall this tv is going in my bedroom which is no bigger than a 12' x 13' room. I know it's overkill but the picture is beautiful in store can't wait for my full motion mount to come in so I can mount t. This tv was a steal."}, {"rating": "5", "user": "-", "raw-text": "Pros: Image quality behind burn inBought the tv on black friday. Paid over $1500 because the guys at best buy said these were top of the line gaming tv's. Here I am in late January and I already have burn in from my video games clearly. Sucks because warranties dont cover this anyway..and I have stopped playing games,and it is still visible. Dont waste your money on panasonic,or any plasma at all!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Image quality behind burn inBought the tv on black friday. Paid over $1500 because the guys at best buy said these were top of the line gaming tv's. Here I am in late January and I already have burn in from my video games clearly. Sucks because warranties dont cover this anyway..and I have stopped playing games,and it is still visible. Dont waste your money on panasonic,or any plasma at all!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Excellent picture, great price, QUALITYCons: Needs external speakersBefore this TV, we owned an ancient RCA rear-projection 57\" TV which lived in our living room, taking up a ton of space. My husband had been researching TVs for as long as I can remember and was sold on a Sharp Aquos Quattron LED (120Hz). He had heard some negative things about it, such as blurring during sports and other fast-paced activities so he wanted to check it out in the store. Am I glad he did - that TV was nothing compared to this S30 by Panasonic. All reviews online for plasma TVs raved about the newer plasma technology, the better blacks, the brighter colors, the ability to watch sports without blurring (due to the 600Hz). The hubs immediately forgot the Sharp, but was undecided between the awesome 55\" VT30 and this excellent 60\" S30 - but what swayed us towards the S30 was the lack of 3D (honestly, we were just never going to watch it) and the price difference - the VT30 was $2000 on sale, and the S30 was $1100. Because this TV was so affordable, we were about to purchase awesome tower speakers. The ONLY negative on this TV - the speakers aren't great - it sounds as if you are traveling in a tunnel... not ideal for such a great picture. Our new speakers really bring out the sound and weren't overpriced like other stores. All-in-all, a great purchase at a great price. Thanks BB!"}, {"rating": "5", "user": "S.", "raw-text": "This is the centerpiece of my home theater, replacing a Panasonic 50 plasma, which will go into another room. The video settings menu is a little different from the previous TV, but I am slowly tweaking it to my liking. Detail and color, especially the dark blacks, are all there. I'm looking forward to it breaking in, and really optimizing its performance."}, {"rating": "5", "user": "-", "raw-text": "Decided to pass over the 3D models for now (hate the glasses). This plasma delivers an outstanding high action picture for sports and movies. Decent streaming with Netflix - only an occasional rebuffering, after which it looks like it lowers the resolution (from 1080 downto 720 or lower). First non-Sony in years, very happy"}, {"rating": "5", "user": "-", "raw-text": "Pros: Great plasma for the priceI wasn't totally sure about this tv but after looking around, I decided to bite the bullet. Couldn't be happier with the purchase. Television looks great and the features for the plasma are great."}, {"rating": "5", "user": "-", "raw-text": "Pros: Good brand, quality and priceCons: The amount of heat thrown offWas never a fan of Plasma TV's until I saw this 60\" beauty and learn of the advancements in plasma technology. The picture is great in the \"Vivid\" mode. Not so great in any other display setting. Unit throws off a tremendous amount of heat from the screen. There are times that pixelation shows on certain angles. Overall however, this is a great television. Live sporting events are spectacular! It is like you are acutally there. I love it!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy set up great priceCons: NothingThis panasonic plasma is fantastic, picture quality is excellent and also are blacks. Blu-ray dvds are superb, can't get any better."}, {"rating": "5", "user": "-", "raw-text": "Pros: EverythingCons: NothingThis TV is by far worth every dollar. Love everything about it, the picture rocks and the features are very easy to use. I would recommend this to anyone looking for a lot of TV, for not alot of money."}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture Quality with EverythingCons: NothingThis TV is awesome. Picture is amazing, If your thinking of a 55\" just save yourself the trouble of comparing and get the 60\" you will not be disappointed believe me. I myself was very skeptical about Plasmas because I thought it was a dead technology but I was mistaken. 600hz compared to the 120hz of the LED tv's. zero motion blur and I don't have to turn mine on to see it, PLUS my tv doesn't look like someone is filming everything in the same room, it still looks like TV should. the price point of $1500 is a steal for everything you get with the size of the TV. I couldn't be happier with this purchase."}, {"rating": "5", "user": "-", "raw-text": "Pros: Screen color and picture qualityCons: nothingThis Plasma TV has a great picture and vibrant color. Others have said that the sound was not up to par but I have to say the while a little lacking in Bass the sound is really good and clear. you wont be disappointed with this model."}, {"rating": "5", "user": "-", "raw-text": "great picture, although it goes from light to dark on occassion. had to order a sound bar to improve the sound. still waitiing for it.is replacing a samsung dlp that was only 4 years old, but had to have serviced at least 3 times a year. this time i will continue the warranty"}, {"rating": "5", "user": "-", "raw-text": "Pros: good pictureCons: nothingWorks well and Geek squad installed it real well. The tv looks good in the light and in the dark. Sturdy screen and shows good from any angle"}, {"rating": "5", "user": "-", "raw-text": "Pros: price, featuresCons: lasted 3 daysI already own a similar model to this just in the 42 inch and loved the last 2 yrs with it so I figured why not....I purchased this TV 02-16-12, last night (02-18-12) a 4inch green discolored stripe appeared from the top all the way to the bottom on the far right of the screen. Before the discoloration I was really impressed with this tv. very sharp picture, sound is standard for plasma, set up took me approx 15 mins from box to flipping channels. I was thrilled to grab this tv for under 1k. Replacing it with same model today... Hoping it lasts."}, {"rating": "5", "user": "-", "raw-text": "Pros: pictureCons: nothingWe bought this tv yesterday to replace our dlp tv. In just one day of watching we are amazed at the picture quality.It is far superior in every way to the old tv.I was also very pleased with the price. Wehave the tv connected to a yamaha home theater,witch was also from best buy and who needs to go to the movie theater!"}, {"rating": "5", "user": "-", "raw-text": "Pros: The picture and the price!Cons: Does not have built in wireless. But I have a Logitech Google TV device, so it doesn't matter.I read many reviews for this TV and looked into many different brands/styles. I decided to go with this TV because of the great picture quality, #1 rating from Consumer Reports and the price. I originally bought this TV for 1199.99 and that was on sale from 1299.99. I thought it was a great deal. But thanks to the BB Price Match guarantee I was able to match the price when it lowered just a few days later. I ended up price matching twice and got it down from 1199.99 to 899.99!For the price you CAN'T beat this deal. It's a solid internet TV with no extra thrills. If you aren't looking for 3D and don't have too bright a room, this is the TV for you! Don't let the price fool you. It's well worth it."}, {"rating": "5", "user": "-", "raw-text": "I bought this tv because I wanted the biggest, highest quality, non 3-d plasma available for the best price. If u want a 60\" plasma & don't want 3-d, then I highly recommend this product. Images are smoothly rendered, blacks are deep, & colors are vibrant. Fast motion content & fine detail shine on this machine. Ten out of ten in my book!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Reduced Glare; Good Remote Control; Best Picture On Market; Fast Setup; Energy Efficient; Good Resolution; Great Picture QualityVery light for a 60inch and was able to mount to wall very easily. The picture in vivd mode is incredible. When comparing to my 42inch Panasonic Plasma and LG 42inch lcd there is NO comparison in picture quality."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great TV for it's price. Sports look great on this TV.Cons: Color managementOwned a Panasonic 50\" Plasma 720P for 7 years and it was an excellent TV. This 60\" 1080P (Top rated Plasma in it's class according to Consumer Reports) was slightly dissapointing compared to the 50\" when it comes to picture sharpness and color. Seems like you need constant color adjustment depending on the program you are watching. (Still reading the book).I wall mounted this TV and it has turned out great. I wished that all 3 HDMI outputs were on the side of the TV. I used a slim mount and having 2 of the 3 HDMI outputs on the back of the TV slightly gets in the way of the wall and the tilting mount.Want to connect the TV to my wireless network, but the wireless adapter is sold separately.Great TV for it's price and make sure you buy the proper mount as this TV is pretty heavy. I would recommend this TV."}, {"rating": "5", "user": "Vinson", "raw-text": "Pros: Energy Efficient; SD Card Flash Drive Port; Attractive Design; Good Resolution; Good Remote Control; Reduced Glare; Great Picture QualityCons: Very heavyOk, This is the first review that I have given on anything but felt that I needed to tell everyone about my experience with this product. I mounted mine on the wall and it was not easy because it is very heavy. It will take at least to to mount it or even carry it into your home. The sound through the internal speakers is ok, but sounds great on a surround sound system. The picture quality is great especially if you have HD. I tried to watch a movie off the flash drive last night but found out that it did not support AVI movies (I will have to look more into that) which is a bummer. The sales people at hhgregg were very professional and helped me through the sale and even gave me a discount. Another area that I really liked is that this site offers a video instructions which I watched and really helped me out on a couple of things. I have not tried watching Netflex yet but I am connecting my wireless to it tonight. Panasonic is a great name brand and would highly recommend this to anyone."}, {"rating": "5", "user": "-", "raw-text": "Pros: True ColorLove this television it has great color, true colors that only plasma can give you! Easy installation too. If your looking for great television at a great price, this is it!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: PriceCons: Trying to watch a Hockey game - dull whitesI moved my 61\" Samsung LED DLP into another room for this one. While this has a nice picture it's no better than the DLP. Baseball is fine, but Hockey is horrible. The Whites are very dull and on my DLP the Whites are super bright. No comparison for hockey. I have gone through all the necessary adjustments and it is not too bad. Uses twice the electricity of my DLP. I still wonder why they stopped making them. I thought about sending it back, but for just under $1300 and three years to pay, I decided to keep it."}, {"rating": "5", "user": "-", "raw-text": "Pros: Size and pictureCons: Have not found anthing yetI bought a 57 LED Insignia and had it at the house for about five days. Something about the picture wasn't right so I brought it back with no problems from best buy. I decided on the Plasma Panasonic, and could not be happier with the choice. The picture is awesome in HD and the standard channels look much better then they did on the LED."}, {"rating": "5", "user": "-", "raw-text": "Pros: Ease of useCons: Must have HD, hard to keep cleanThere is virtually no setup with this TV. The remote controls my home theatre system automatically without having to program it. The APPs used witht he internet pop up with the touch of a button, and the colors and picture quality are amazing. It has a true 180 degree veiweing angle.Another user commented that the speakers are bad. They are not amazing, but if you have a 60\" plasma and don't have a home theatre system something is wrong. You can very easily set the TV to automatically play through your home theater system, but if you choose not to the sound is just fine."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great price, Great pictureCons: noneThis a great TV for the money if you don't need all the bells and whistles. I didn't need a TV to do my Facebook or use it for the internet. I liked this TV over Samsung, Sony and Sharp. When you are ready to buy a TV go into the store and look at the picture quality before buying I was going to buy a Samsung I liked Panasonic's picture quality alot more than the other TV's"}, {"rating": "5", "user": "-", "raw-text": "Pros: nothing as i can't get over the poor speakersCons: lowest quality speakers on the market...I own two 50\" panasonic plasma tvs.. both are good, so I thought we would upgrade to the 60\" -- bought online and just received today... WHAT A DISAPPOINTMENT... I know panasonic as a company has been struggling lately, but I cannot believe how bad the speakers are.. really tinny and the bass is really aweful.. I am returning tomorrow and looking for something better.. picture is fine, but not blowing me away.. thankfully bestbuy doesn't charge a restocking fee"}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture, networking.Originally purchased a different brand thinking that LCD was better (mostly for energy savings and price), but didn't like the pixelization with high speed action. Then this beauty went on sale for only $100 more and I decided to exchange. Best decision ever!"}, {"rating": "5", "user": "-", "raw-text": "Product was as described, in great condition. Easy transaction and great price. No delivery charge was a selling point. Delivered on my schedule and on time. Carried to the room upstairs too! Very please with the whole process. Have purchased several items from B & H and will do so again."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great Picture Quality; Energy Efficient; Good Remote Control; Good Resolution; Fast Setup; Attractive Design; Reduced GlareCons: Poor Sound Qualitygreat for streaming movies. Price was awesome."}, {"rating": "5", "user": "-", "raw-text": "Pros: EverythingCons: NothingI was just about ready to buy a Samsung LED TV, Spent a week researching TVs and decided on the Panasonic 60\" Plasma. LOVE, LOVE, LOVE it!!! Don't let anyone tell you that Plasma is not the way to go! Sound is really good too..."}, {"rating": "5", "user": "Dad", "raw-text": "Picture in HD is phenomenal. SD picture quality was actually better on my old Sony rear projection TV, but aside from the local weather channel, everything I watch is in HD, so that doesn't matter much to me. Also, this is a 2D set, which I intentionally sought out, since I'm just not interested in wearing 3D glasses for limited programming anyway. Plasma is the preferred choice for viewing at extreme angles, and this picture is clear and defined for a very wide angle of viewing. That was my main reason for buying this TV, and I am thoroughly satisfied with it."}, {"rating": "5", "user": "-", "raw-text": "Pros: ABSOLUTELY NOTHINGCons: Dies WAY before the 60,000hr life it states to haveLet me start by saying the picture on this TV is great...until the red flashing lights of death appear. We have had this TV for a little over 3 yrs, our Panasonic extended warranty has just expired, and it died two days ago. When I went to research what the flashing power light meant I stumbled across MANY websites devoted to the flashing red light that occurs when one of many parts on this TV go out. Mine was flashing twice (there are 10+ different flashes) which means the 15v SOS D board is out. We were thinking of having it repaired, for about $400, until we realized this is probably the first of the many parts on this TV to go out.Before you buy this TV PLEASE go online and research more than just this sight. You might end up regreting it if you don't."}, {"rating": "5", "user": "-", "raw-text": "Pros: sizeCons: weightTV has god picture quality, sound is ok . the only feature from a negative aspect is the weight - this flat panel is heavier than most models."}, {"rating": "5", "user": "-", "raw-text": "Pros: sizeCons: weightTV has god picture quality, sound is ok . the only feature from a negative aspect is the weight - this flat panel is heavier than most models."}, {"rating": "5", "user": "-", "raw-text": "Pros: So Far Everything has been Great !Cons: Heats up a bit but i think it normal based on my researchBest Buy was Great they didn't have the TV in stock, however my representative made arrangements of having the TV delivered to my residence Free of Charge! It took about 2 days and the TV was right at my door stop 1st thing in the morning. Couldn't wait to hook up my 60\" TV, after I did 1st thing I popped into the Blueray Player was Avatar and it was just JAW DROPPING CLEAR! I think maybe even Clearer then LED. Didn't really car about the regular sound from the TV as I have a Samsung Blueray Surround Sound system, Just So Happy to have the TV and for the Price $1049 you can beat it !!! Highly Recommended TV !!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: good quality pictureCons: energy consumptionThis was our first foray into HD TV and we are very pleased with this model--good picture and easy integration with our stereo system. Easy to use."}, {"rating": "5", "user": "-", "raw-text": "Pros: Ease of menu optionsCons: One heavy t.v.At times the picture seems too dark, especially in high contrast lighting, however in HD and in most instances the picture is excellant."}, {"rating": "5", "user": "Deere", "raw-text": "This is our family room TV. It is a wonderful size to help us see the detail in a movie compared to our old, much smaller TV.We live in a remote area without cable and we are still working on the details so we can get a signal off of an antenna to watch our local stations."}, {"rating": "5", "user": "-", "raw-text": "Geek Squad set up this tv viewing system for us...Very pleased with their service AND the tv and all components.....would def recommend this model and utilizing geek squad's services....tv and universal remote went on sale within the 60 day purchase plan and Best Buy refunded us the difference....great policy Best Buy!! A definite must have is the Logitech universal remote......ties all components together seamlessly.....went from 4 or 5 remotes for cr*ppy tv viewing system to a wonderful system with great components and ONE REMOTE!!! A must have!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: NothingCons: It didn't last a weekOn the fourth day the TV was in the house, it failed. The second one in three years. Stay away from Panasonic and the dreaded blinking light....check out the Internet...hundreds of similar stories."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great Picture Quality; Good Resolution; Reduced Glare; Nice and slim for a PlasmThis was a gift, I had wanted the Quatron, but I'm pleasantly surprised by the looks and function of this set."}, {"rating": "5", "user": "Mcarthur", "raw-text": "Pros: Good Remote Control; Good Resolution; Great Picture Quality; Great Sound Quality; Energy Efficient; Reduced Glare; Fast Setup; Attractive DesignCons: Replaced exsisting box; Changed to more poweful; Antnnadelivery was prompt even with weather delayswe were kept up to date as to where in delivery processOverall our experience was great-we are very satisfied and have recommended the whole process to several others."}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture SizeCons: Picture Quality Compared to Other Panasonic PlasmasI purchased this tv in October because I really liked the 60\" screen.I spent almost a month trying to get the picture settings the way I liked it,but to no avail.I already own a Panasonic Plasma TC-P50GT25 I purchased last year.The picture quality on it, is excellent.Not quite sure if it is because it has THX mode or not.But in THX mode it couldn't be better.Picture on this 60\" tv just seems to always be a little grainy & the picture quality ,I just can't seem to get adjusted to look near as good as my 50\" plasma.I took this tv back & traded it in for the Panasonic tc-p55st30 plasma,because it uses the same infinite black screen my other plasma does.From what I understand the S30 models don't.The picture on this tv was much easier to adjust to close to the picture quality as my tc-p50gt25.Plus for the same price as the 60\",this tv is only 5\" smaller in screen size & has 3d & 2d to 3d conversion & the infinite black panel Panasonic is famous for..While I am not quite as happy with the picture quality as my tc-p50gt25 tv,It is very close.And the 3d looks just as good.This is my 3rd. Panasonic Plasma tv,my first one is 50\" and is about 4 or 5 years old & works as well as it did when it was new.Panasonic makes an excellent Plasma,and as far as I'm concerned,the best brand out there for picture quality & durability.I would first recommend the GT30 series,as it is the best of the ones they make in my opinion for"}, {"rating": "5", "user": "-", "raw-text": "Outstanding picture and size. No blur with fast motion. Great tv and outstanding price. Great value"}, {"rating": "5", "user": "-", "raw-text": "Only three HDMI inputs. Lots of online content. Somewhat difficult at first to understand setting all preferences. Good value overall."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great Picture Quality; Fast Setup; Good ResolutionSports and movies"}, {"rating": "5", "user": "-", "raw-text": "Pros: Color, pictureCons: soundColor is fantastic. Crisp, clear.Sound is lacking -- needs a sound bar or connectivity to a sound system."}, {"rating": "5", "user": "-", "raw-text": "Great for sports/movies. Hooked up to my own sound source (Bose)"}, {"rating": "5", "user": "-", "raw-text": "i originally purchased a panasonic 50\" viera plasma. after 1 year i was thoroughly impressed with the picture quality and ease of use. i decided that i wanted to upgrade the…"}, {"rating": "5", "user": "-", "raw-text": "best bang for buck. excellent value. crutchfield service is excellent!"}, {"rating": "5", "user": "-", "raw-text": "This TV is amazing the picture quality is top of the line. Don't let the low price fool you. It has plus DLNA. I'm very satisfied with it."}, {"rating": "5", "user": "-", "raw-text": "Pros: the features, resolution, and the internetCons: nothing at allall my family love it, its a great tv to buy, come on by it!!!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Clear picture with great color.Crisp picture, beautiful natural colors. Excellent value for the price."}, {"rating": "5", "user": "-", "raw-text": "The picture is outstanding. The menu is very easy to follow which makes set-up a simple process. Best bang for the buck out there!"}, {"rating": "5", "user": "-", "raw-text": "Pros: PictureCons: NothingThis TV is great!! For the money you won't find one this good."}, {"rating": "5", "user": "-", "raw-text": "Looks grate works even better. I watch alot of racing and the reafresh rate work fahtastic all i wanted."}, {"rating": "5", "user": "-", "raw-text": "I can't believe the picture, this is the best I've seen."}, {"rating": "5", "user": "-", "raw-text": "We now own 2 Panasonic Viera's and would buy a 3rd. I didn't rate sound because we use external speakers."}, {"rating": "5", "user": "-", "raw-text": "Really good picture, great TV if you don't need all the bells & whistles"}]