[{"rating": "5", "user": "-", "raw-text": "Pros: stunning picture quality for the priceCons: could use a couple more HDMI connectionsI purchased this TV to go along with my home theater setup. I have this hooked up with HDMI to my Denon AVR-1312. Then I hooked up my other HDMI stuff (Directv HD, Sony Blu-Ray and AppleTV) to the Denon receiver. Because I only needed this TV as part of a larger home theater setup, I don't care that it only has two HDMI inputs and doesn't connect to the internet. I use my Sony Blu-Ray and AppleTV to connect to the internet, so why do I need a TV for that? I needed something with a nice picture quality and this TV does it very well. The screen size is perfect for my family room. I LOVE this TV. For the price and quality, I must say.. buy this TV! It's a Sony, so you won't be disappointed."}, {"rating": "5", "user": "-", "raw-text": "Pros: Pretty much everythingCons: NothingThe picture quality on this TV is amazing. The only adjustments I made was turning the sharpness from 15 to 17. Even though this TV is only 60Hz, the picture quality looks more like a 120Hz on it's lowest setting. Colors and tones are very true and life-like. For the price, I don't think this TV can be beat. It could use more than two HDMI connections, but with my Sony STR-DH520 made for blu-ray receiver, it wasn't an issue for me."}, {"rating": "5", "user": "-", "raw-text": "ProsWe had been debating on what to buy and glad we went with the Sony. Awesome picture and colors and sound. Great HD quality. Easy to setup and get running (less than 10 minutes). Great deal with Dell, superfast shipping and great cutomer service. Lot of things I still haven't learned about the tv so I am sure I could write a better review in 2-3 months.ConsNothing bad about the tv. Granted we have only had it 3 weeks, but we couldnt be happier. The only thing I wish I would have done was to pick up another HDMI cable from Dell for the Sony Blue Ray Player."}, {"rating": "5", "user": "-", "raw-text": "Pros: picture quality, sound, ease of set-upThis TV was a replacement for use in our bedroom. This TV is comparable in picture & sound to the Samsung in our living room. I've read other reviews which complained about the audio. I have no problems with the sound level produced by this product. The price I paid was incredible for the size and quality. I was happy to try a Sony at this price. I paid several hundred dollars more for the Samsung, but I can't see or hear a difference. This Sony does not have as many connections as the higher priced models, but I didn't need them for the room it is being used in. I would definitely recommend this to others."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great picture quality and easy to operateCons: The sound is good but with surround sound, it would be awesome!This is a great tv at a great price. This picture quality is great. The sound is good I think a surround sound system would make it perfect. I probalby need to do some adjusting, but the volume needs to be pretty high when watching movies to hear the voices. I am very pleased and satisfied with my purchase. I have always had good luck with Sony products."}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to Setup, Great Picture, Good SoundCons: Only 2 HDMI inputsThis item had some positive and negative reviews, but I have a 52\" Sony from a few years ago that is similar that I love. This is easy to setup out of the box and has a great picture. I have another LCD that is a Vizio and the comparison is like apples and oranges. If you are going from an old analog TV you may not appreciate the superior picture because of the difference in technology. I was concerned about the 60hz (my other Sony is 120hz) but watching the last week of NFL games in HD and a couple of action movies I saw no issues with the picture quality. I don't have a BD player hooked up, so I can't speak to that use.Some reviewers complain about the sound. I have a home theater system in another room and if you are expecting that level of sound quality you will not get it. Having said that, the sound on the unit is more than adequate for the vast majority of users.The only flaw in this unit is having only 2 HDMI inputs. If all you want to connect a HD box and a blue ray player you're ok. But if you want to add a game system or other device you will be disappointed here.At $699 on sale, I think it's a steal. Hope this is helpful."}, {"rating": "5", "user": "the", "raw-text": "The KDL46BX420 is our primary TV. Since we did not need the more expensive bells and whistles, we opted for this unit. It did not disappoint! The set-up was quick and easy and just the right size for our mobile home. The picture quality is GREAT, which is in keeping with the SONY TRADITION. To date, we have not encountered a single problem. Even with limited input ports, it can handle all of our needs - Cable TV, Blu-ray DVD, HD Camcorder, and various DV Camcorders."}, {"rating": "5", "user": "-", "raw-text": "I needed a larger TV for my living room so purchased this one for my mantle. I was concerned that it would be too heavy for my mantle but it fits perfectly and the weight is fine. This is the second Sony I've purchased of this model - great picture clarity with a sleek design. The shipping was supposed to take 10 days but I recieved it in three. I'm very pleased with this product and the service I've received."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great price, Great features, Can't beat SonyCons: Wish it had more than 2 HDMI inputsThe picture is great. My only problems with it are that there's quite a bit of dot crawl on my XBox 360, but that may be because it is a very old system (pre-HDMI) and the BluRay player (HDMI) is great, but I typically watch regular DVDs on there. So, really, I am not pushing this TV to it's full potential, which may be why I think the picture quality is great, but not blowing me away. The cable box I have hooked up to it (HDMI) has a great picture, but the channels typically come in in 720p or 1080i, so the 1080p is really only utilized by the 360 and BluRay.Other than my own subpar-hookup problems, I'd say the TV and picture are perfect. I'm not a sound guy, so I don't think I'd recognize the difference between the sound of two TVs (probably takes actual surround sound to get me to notice a difference).The features are great, the TV is great looking, and I would definitely buy this again and recommend it to a friend.Only incident I had was that the TV couldn't recognize my HDMI 2 plug, so I had to \"hard reset\" the TV (hold up on the remote and press the power button on the TV itself). After that, it recognized everything and I've had nothing but good things to say about this TV. As always, Sony made a great product."}, {"rating": "5", "user": "-", "raw-text": "i would highly recommend this lcd hdtv. for the price it has excellent picture quality and sound. unfortunatly no fault of dells but my first shipment of the t.v. i found the stirofoam packaging around the t.v. had been shattered and laying in the bottom of the box and upon taking the t.v. out of the box it had a 2 inch piece broken off the corner. i contacted dell and explained the problem and immediatly they shipped a new repalcement really fast and a few days later picked the broken one up. other than the shipping problem, this t.v. is great!!it would also be a plus though if they included a hdmi cable with these types of t.v's"}, {"rating": "5", "user": "-", "raw-text": "Pros: Easy to set up and picture looks good.Cons: TV base doesnt rotateThis is a good TV. Nice quality picture and sound. Cant go wrong with this Sony TV. Price isnt that bad."}, {"rating": "5", "user": "-", "raw-text": "I have been a Dell Customer for several years. I have always had good service from the many products I have purchased. This Sony TV is no different. It was delivered promptly and has a great picture. It was very easy to set up and we are enjoying our purchase. It has been a good experience."}, {"rating": "5", "user": "-", "raw-text": "i am real happy with my purchase. was real easy to hook up'it has real nice picture and sound i would recommend this product and dell web site.they were real help full with my purchase."}, {"rating": "5", "user": "-", "raw-text": "I am writing this review 18 months after I bought my LCD TV. It worked just fine for about 14 months - long enough for the manufacturer warranty to expire. Then the problems began. Suddenly small pixelated lines appeared along the screen. Progressively increased until I had to contact a repair place to have it fixed - reputable, one which repairs all our hospital HD monitors. They diagnosed that the LCD display is broken. contacted Sony and they requested a Sony authorized facility to do the check up. Same result. Any further discussions with the SONY Customer support turned completely obsolete as their only statement was - out of warranty, your loss. What is shocking: 1. Change in Quality of SONY production - how can the display, most important and expensive part of the product, break in only 14 months?! This cannot be Sony product from the past - known for their excellent quality control and backing their production. 2. Customer support - arrogant (hanging up) and oblivious to the core of the issue - it is not just warranty vs. no warranty. It is about the quality they are known for. Overall, the final question remains are we taken for a ride by a big company which relies on past glory to push a mediocre product at exorbitant price?! For all of you on the market for a LCD or LED TV, take a look at Samsung!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Its easy to set up and the price is greatCons: not many inputs also not internet connect ableIt is a great tv allows for many great uses although not many inputs. the tv is great for the price range it is in. looks flawless although it lacks the inputs but overall great."}, {"rating": "5", "user": "-", "raw-text": "I ordered this tv for my husband for father's day. Delivery and customer service from Dell leaves much to be desired. The tv itself is big and the picture is clear. We put this tv in our living room replacing a 27 inch tv that was not HD. I expected this to be a huge upgrade but other than being significantly larger than our old tv the picture and quality is the same. We have the hdmi cable and we upgraded to an hd cable box so there isn't much we can do beyond that to improve the picture."}, {"rating": "5", "user": "-", "raw-text": "Best TV I've seen in years. Upgraded from a Plasma. Colors are rich, clarity is spectacular, and there are plenty of input ports to go around. I can't wait to start gaming on it! :)"}, {"rating": "5", "user": "-", "raw-text": "I love the Sony Bravia. I am very pleased with Dell as well. The product was shipped much quicker than expected. The processing time was great. It has a great picture and sound. We love the Sony sync features as we have a Sony home theater system as well...one button and they all work together on EVERY remote."}, {"rating": "5", "user": "-", "raw-text": "Pros: Price, Picture, SoundCons: Only 2 HDMI ports, could use 2 moreDefinitely a better buy vs the Samsung 46\", which is the competitor to this TV in my opnion. The black colors for this TV is way deeper than the Samsung and the sound system in this TV sounds way better than Samsung.Sound is the biggest differentiator between the Samsung vs Sony TVs in my opinion - Sony's sound is way better. Sony provides a more surround sound effect and has more bass and fuller sounds compared to the Samsung,This Samsung TV has more HDMI ports than the Sony though, 4 for Samsung vs only 2 for Sony. Not a big deal for me, but if you're plugging in a lot of devices to the TV then the Samsung might be better for you - for myself, i prefer a better picture and much better sound than having 2 extra hdmi ports."}, {"rating": "5", "user": "-", "raw-text": "My wife and I will often just look at each other in amazement at the beauty of the picture on this television. I would not hesitate to make this choice again. I understand that Sony makes much more expensive products, but I wish that the sound was as impressive as the picture in this affordable model."}, {"rating": "5", "user": "-", "raw-text": "This T.V. began to display vertical lines down the left side of the screen after only 6 months of use. Sony customer service was less apathetic. They set up for service to come out, however they never showed up. They then offered to replace it with a \"refurbished\" t.v.. I will not be purchasing from Sony again!!"}, {"rating": "5", "user": "-", "raw-text": "This TV was a gift for my husband, and he loves it. We went from an old tube TV to a flat screen, and the difference is amazing.The picture is very clear, and it was easy to set up."}, {"rating": "5", "user": "-", "raw-text": "Pros: Clear pictureCons: SoundBought this as a open box item and have been very happy with it. The only complaint I have is that when you turn up the sound the voices get a little echoy and get hard to understand. Needs to be hooked to a home theater system to get everything from it."}, {"rating": "5", "user": "-", "raw-text": "Excellent picture. Easy to set up. The price was a great deal, but I couldn't resist the \"free shipping\". The delivery was very convenient. They actually called me and asked when it would be convenient for me to accept delivery--wow! What a change from \"We'll be there at this time; somebody needs to be there\""}, {"rating": "5", "user": "-", "raw-text": "I bought the 46\" Sony Bravia BX420. It is the coolest best looking TV ever! It has the clearest and sharpest picture and the sound quality is amazing!There aren't any cons with this TV or with Dell. Awesome awesome awesome!!!!"}, {"rating": "5", "user": "-", "raw-text": "Good no frills tv at a good price. No led back light, no swivel stand, no internet apps, only 60 hz etc., but it has a great quality picture. I see no motion blur. Works great. Sometimes, in life, less is more!"}, {"rating": "5", "user": "-", "raw-text": "Usually I turn to Sony for my electronics as I felt they had the best customer support and overall experience as far as their products went. When I first purchased this, I was thrilled and it obviously worked better than the previous ones. After two weeks of having it though, I started getting \"dead pixels.\" I let it go for a while, thinking maybe if turned off for a while, something would happen?? Nope, okay...so I call up customer service explained what happened, where the rep essentially told me he couldn't do anything and \"this doesn't usually happen.\" At that point I was put on hold while the manager was notified, but was not patched through/anything. The sheer disrespect of being left to hang there coupled with poor customer service and diminished product quality is the cause of why you are losing another customer."}, {"rating": "5", "user": "-", "raw-text": "Pros: nothingCons: It does not do what they say it can do.This TV was nothing but a problem. I have had 5 service calls, no one know how to fix it and the main control board was replaced twice. When you call for troubleshooting, no one really knows how to fix it. When I buy a new TV it will be at a different store and with a different company."}, {"rating": "5", "user": "-", "raw-text": "Pros: it was easy to set up, picture quality is excellentCons: sound is a little low could be a little betterI love the picture quality of this tv, it's very sharp and the colors are brilliant. I don't, however, like the sound quality. It's very low. I have to raise the volume almost to the highest level to get a good sound quality. All in all it's a great TV."}, {"rating": "5", "user": "-", "raw-text": "Awesome T.V. no complaints as of yet. Just that you need to hook up RCA cables for you to listen to cable T.V. though your home theater. Other than that it's AWESOME."}, {"rating": "5", "user": "-", "raw-text": "This tv provides an excellent picture with vibrant colors and HD quality picture. I have had it for 2 months now and am still amazed at the exceptional quality. I especially like the way my Sony blue ray and reciever work seamlessly with the tv. Sony lives up to its name with this one!"}, {"rating": "5", "user": "-", "raw-text": "Have had our 46 inch Sony for a couple of weeks. Best picture ever. Have other HDTV's the picture is better with the Sony. Looking forward to using the camera and computer hookups. We spend our free time in front of the Sony, especially sports and the nature channels."}, {"rating": "5", "user": "-", "raw-text": "I got my tv this weekend and loved it the minute it came on. It's so sleek, the picture is theater quality. I have been in front of the tv for the last two days. A must have!"}, {"rating": "5", "user": "-", "raw-text": "Pros: Picture color and qualityCons: Didn't last past 2 yrs.3 years ago when this model first came out, we decided to pay extra for the great color and picture quality. Into our 3rd year of this model the picture has gone completely with wavvy lines and jumping picture. I can't believe after less than 3 years this TV is done. This TV gets very little use on top of it. I don't mind paying for top quality, but I expect it to last 10yrs plus not 2!"}, {"rating": "5", "user": "-", "raw-text": "Pros: EntertainmentCons: Dont Know yet.....I luv my bravia...bought PS3 just for this tv the graphics on this baby is out-of-site. Its syncs to my PS3 as well (meaning u can turn of or on with remote alone with more things) I would recommend this product to anyone. Movies are amazing wait till u see..."}, {"rating": "5", "user": "-", "raw-text": "Pros: size and easy to set upCons: nothingSONY makes the best TVs. This HDTV is light weight and low profile. It was easy to set up and fits perfectly in our small den."}, {"rating": "5", "user": "-", "raw-text": "Pros: EverythingCons: NothingLove the picture quality. Color is real and not pushed as I found looking at the Samsung, which is also a great television. But yet again, for me the Sony won through."}, {"rating": "5", "user": "-", "raw-text": "I have friends bragging about having a 47\" t.v., then they see my bravia 46\" and wish they had purchased this. I received a better price and free shipping. Excellent t.v. and great job Dell."}, {"rating": "5", "user": "-", "raw-text": "Pros: Great pictureCons: Number of HDMI inputsPros: If you aren't looking for all the bells and whistles this is a great TV.Excellent picture qualityEasy set upGreat sound (if using its speakers alone)Cons: 60Hz refresh rate vs. 120 (didn't matter to us)Less HDMI inputs than our living room LG HDTV (this was fine for our bedroom TV, but would have been too limited for our main TV)"}, {"rating": "5", "user": "-", "raw-text": "Pros: ClarityBought this model at Christmas time of 2010 and we love it. Good, Clear picture and quality with this TV. You do not need to 120, the 60 works just fine and is a great energy saver."}, {"rating": "5", "user": "-", "raw-text": "SWEEEET picture, better with hd channels,I highley recommend it to everyone who wants to upgrade.I hooked up a sony surround sound, and boy feels like im in a movie theather!CONS-none."}, {"rating": "5", "user": "-", "raw-text": "Even though this is the \"low-end\" Sony model, it blows my Insignia out of the water despite the fact that the sales team gave me a had time. They wouldnt honor a hand-written coupon the store manager gave me. I'll go back to Sony, not so sure about Best Buy."}, {"rating": "5", "user": "-", "raw-text": "Pros: beautiful pictureHaving the Geek Squad install and connect to our surround system and adding the fantastic remote control that controls ALL has made a world of difference."}, {"rating": "5", "user": "-", "raw-text": "Pros: Excellent picture without paying for stupid frillsCons: Thicker than others on the market right now; only 2 HDMIsI purchased this TV because I know what I need. I don't like 120 or 240 Hz, so I wasn't going to pay for it. I've heard from many people that internet within the TV is a bad idea, so I didn't pay for it. (We use a Roku box which is great! Much better than the Sony Blu-Ray Internet) If you want a TV with great picture quality that is adjustable to the discerning eye and descent audio, this is a great TV. It only has 2 HDMI inputs, but there is a VGA input (audio, too) for a computer which is great .It's not as \"cool\" as some of the other models out there, (not crazy thin or sleek), but a fantastic TV for the price. I'm extremely happy with it."}, {"rating": "5", "user": "-", "raw-text": "The TV is very good and it is a 1080p quality product. Some of the automatic pre-sets are annoying but once I reset them I was happy. Delivery was slow, nearly 2 weeks. Overall I was completely satisfied. DELL was a good choice and they periodically have terrific sales."}, {"rating": "5", "user": "-", "raw-text": "I WOULD RECOMEND THIS TV TO EVERYONE, BEAUTIFUL PICTURE, I JUST LOVE IT. ITS ALSO A GREAT PRICE.I HAD A PROJECTION TV FROM SONY BUT THIS LCD TV IS THE TOPPS, THE BEST."}, {"rating": "5", "user": "-", "raw-text": "Pros:1080p looks great, auto adjusts for lower signal, several HDMI inputs Cons:the sound does not go up high when going throw cable box I have finally decided to purchase a flat-screen HDTV after my old big…"}, {"rating": "5", "user": "-", "raw-text": "After looking over multiple TV reviews my boyfriend and I chose this Sony Bravia - and we are very happy we did! It is a great size and has amazing picture and sound…"}, {"rating": "5", "user": "-", "raw-text": "Pros:: Attractive,, Easy to setup,, Energy efficient,, Good audio,, Good connections,, Good remote control,, Great picture quality,, Led-backlit,, Reduces glare Sony is rated #1 for a reason.…"}, {"rating": "5", "user": "-", "raw-text": "Pros:-Big screen-Thin edges-good sound -good quality Cons:-expensive This is a product that I would recommend to anyone. With a large screen, a thin side, and…"}, {"rating": "5", "user": "-", "raw-text": "Pros:Good Features, Perfect size, SUB Modom Cons:Business to Business Sony BRAVIA KDL46BX420 46\" HDTV-Ready LCD TV is one of the best tv in all Brand. It's…"}, {"rating": "5", "user": "-", "raw-text": "We are very happy with our purchase. Good quality TV. Nice picture and sound!"}, {"rating": "5", "user": "-", "raw-text": "This is our 2nd 46\", & the picture & sound are amazing! Great value!!!"}, {"rating": "5", "user": "-", "raw-text": "This is our 2nd 46\", & the picture & sound are amazing! Great value!!! ..."}, {"rating": "5", "user": "-", "raw-text": "I love my new LCD TV. It has great screen, nice colors and pictures. The sound is to low I have to adjust the volume."}, {"rating": "5", "user": "-", "raw-text": "Pros:: Attractive,, Easy to setup,, Good audio,, Great picture quality,, Led-backlit,, Reduces glare I watch a lot of TV I am 70 years old and love the Sony."}, {"rating": "5", "user": "-", "raw-text": "Pros:: Easy to setup,, Good remote control Cons: Poor connection options I am writing this review 18 months after I bought my LCD TV. It worked just fine for about 14…"}, {"rating": "5", "user": "-", "raw-text": "This TV has an incredible picture which I feel is better than many sets which cost significantly more. I am not a fan of LED back lighting because I feel it…"}, {"rating": "5", "user": "Bear", "raw-text": "Pros:: Attractive,, Easy to setup,, Energy efficient,, Good audio,, Good remote control,, Great picture quality,, Led-backlit,, Reduces glare I was overwhelmed with…"}, {"rating": "5", "user": "-", "raw-text": "Great Tv. Very pleased with the picture and the many different hook up options."}, {"rating": "5", "user": "-", "raw-text": "Pros: The pictureCons: nothingI love watching sports on this TV and movies. Almost like being at the theatre."}, {"rating": "5", "user": "-", "raw-text": "Wish I would have purchased this TV sooner. Spend the extra money and get a Monster high speed HDMI cable it makes a difference."}, {"rating": "5", "user": "-", "raw-text": "My wife and I will often just look at each other in amazement at the beauty of the picture on this television. I would not hesitate to make this choice again. I…"}, {"rating": "5", "user": "21,", "raw-text": "Pros: great picture ... Cons: speakers are not up with the rest of the tv I cant believe how great the hd picture is on this model..."}, {"rating": "5", "user": "-", "raw-text": "The image is very crisp and clear. Easy to programWould have liked better sound quality but overall is great."}, {"rating": "5", "user": "-", "raw-text": "Perfect picture quality while watchign movies and 3D movies;"}, {"rating": "5", "user": "-", "raw-text": "Pros: Great Picture QualityThis product was easy to set up.The picture is beautiful.Best Buy had the product fairly priced."}, {"rating": "5", "user": "-", "raw-text": "Pros:perfect size crystal clear Cons:not one thing i love this tv. i got it as a present from walmart and it amazing. i always loved sony since i got my first…"}, {"rating": "5", "user": "-", "raw-text": "Arrived faster than expected and was in great shape. Love the picture would recomend this to anyone."}, {"rating": "5", "user": "-", "raw-text": "This tv provides an excellent picture with vibrant colors and HD quality picture. I have had it for 2 months now and am still amazed at the exceptional quality.…"}, {"rating": "5", "user": "-", "raw-text": "Good Picture"}, {"rating": "5", "user": "-", "raw-text": "I got my tv this weekend and loved it the minute it came on. It's so sleek, the picture is theater quality. I have been in front of the tv for the last two…"}, {"rating": "5", "user": "-", "raw-text": "I have three Sony TV's 32\", 40\" and now a 46\" it is by far the best picture quality of my other TV 's"}, {"rating": "5", "user": "-", "raw-text": "It is so light-weight, I can move it around on my own."}, {"rating": "5", "user": "-", "raw-text": "Seems like a great tv but......You cant tell the difference between 1080 and 720. Also, 60hz to 120hz...also cant tell them apart."}, {"rating": "5", "user": "-", "raw-text": "After a month's full of doubt about which TV should we choose, we found this one and it's a by far the best option, my wife and I really enjoy watching our…"}, {"rating": "5", "user": "-", "raw-text": "I am very satisfied with this TV."}, {"rating": "5", "user": "-", "raw-text": "Pros: everythingCons: nothingThis is a great TV, as I knew it would be, being a Sony."}, {"rating": "5", "user": "-", "raw-text": "Pros:true colorsgood, real imageseasy-to-use user interfaceUSB portsHD mode Cons:price is a bit highrequires very delicate handlinglarge, needs space after seeing the Sony…"}, {"rating": "5", "user": "-", "raw-text": "excellent, sounds great that i don't even use my surround sound most of the time.picture is spectacular ,features are not alot but that's why i purchased this…"}, {"rating": "5", "user": "-", "raw-text": "Excellent television. Recommend very highly. Love Dell products!"}, {"rating": "5", "user": "-", "raw-text": "Excellent television. Recommend very highly. Love Dell products!"}, {"rating": "5", "user": "-", "raw-text": "This TV has a great picture, and the sound is fantastic compared to my old 42 inch samsung, The only complaint I have is that there should be a better screen fit…"}, {"rating": "5", "user": "-", "raw-text": "SWEEEET picture, better with hd channels,I highley recommend it to everyone who wants to upgrade.I hooked up a sony surround sound, and boy feels like im in a…"}, {"rating": "5", "user": "-", "raw-text": "the tv was more than what I expected,and it was shipped by dell really fast."}, {"rating": "5", "user": "-", "raw-text": "Sony's are the best for longevity so we spent a little bit more to have a longer T.V. life. Worth it."}]